# -*- coding: UTF-8 -*-

# 浮动框描述内容
TipDatas = {
		"加入家族":"@F{fc=c1}大劫当前，群英并起！10级之后你可以加入家族，结识英雄好汉歃血为盟，@B共享经验一同成长。",
		"拜师":"@F{fc=c1}创世的世界浩大无边，为什么不找个良师益友指导自己闯荡呢？现在就到凤鸣@B城@F{fc=c4}礼相@F{fc=c1}那里找个师父，共同修炼吧！有丰富的奖励等你来拿哦！",
		"经验乱斗":"@F{fc=c1}每周六举行的经验乱斗，是个产出海量经验的活动，有机会获得@F{fc=c35}七彩莲花法宝@F{fc=c1}、@B@F{fc=c35}拳击兔宝宝蛋@F{fc=c1}，还有其他丰富的奖品等你来拿，千万别错过。",
		"科举答题":"@F{fc=c1}凤鸣城@F{fc=c4}科举报名官员@F{fc=c1}听闻你凿壁求光、寒窗苦读数年，文采非凡，特意邀请你@B参加科举，愿你金榜题名。科举答题每天都有海量经验和极品道具，金科状元@B还可以获得@F{fc=c35}鹦鹉宝宝蛋@F{fc=c1}。",
		"冲级奖励1":"@F{fc=c1}凤鸣城@F{fc=c4}创世之光@F{fc=c1}已经为你准备了10级礼包庆祝你升到10级，@F{fc=c35}高级药品@F{fc=c1}、@B@F{fc=c35}引路蜂@F{fc=c1}、@F{fc=c35}归命符箓@F{fc=c1}等商城物品尽在礼包中，还不快去拿！",
		"钓鱼":"@F{fc=c1}一壶酒，一竿纶，世上如侬有几人。凤鸣海滩汇聚了一群气定神闲的钓@B鱼人，你也可以加入其中，每杆必有收获，拿到@F{fc=c4}囡囡@F{fc=c1}那里能够换取@F{fc=c35}收费药@F{fc=c1}、@B@F{fc=c35}镶嵌水晶@F{fc=c1}等各种道具。",
		"跳舞":"@F{fc=c1}凤鸣海滩的@F{fc=c4}舞厅@F{fc=c1}每日舞动奇迹，演绎浪漫传奇。不仅可以邀请心仪之人共舞，@B还能获得大量经验和跳舞积分，跳舞积分可以用来换取@F{fc=c35}“师徒”标记@F{fc=c1}，还能换@B@F{fc=c35}灵药@F{fc=c1}！",
		"星宿挑战":"@F{fc=c1}天上的星宿们百无聊赖，被创世大陆的繁华热闹吸引，纷纷下界巡玩。凡间异@B士得遇仙官，怎能轻易错过机缘，快快到凤鸣城找@F{fc=c4}星宿挑战总管@F{fc=c1}打听星宿下落，@B一定要与天罡地煞们讨教一番，非但可以增进修为，还极有可能意外获得@F{fc=c35}炫彩@B鸳鸯宝宝蛋@F{fc=c1}哦！",
		"变身":"@F{fc=c1}凤鸣海滩的@F{fc=c4}马夕@F{fc=c1}广发英雄帖，只求一败。每天14：30和20：30举行变身大@B赛。谁能使用变身牌跟上他七十二变的速度，他就甘拜下风，奉上小丑徽@B记，玩家凭此换取@F{fc=c35}镶嵌水晶@F{fc=c1}和@F{fc=c35}讨伐令@F{fc=c1}。",
		"兵临城下":"@F{fc=c1}每天10:00-12:00，22：00-24：00魔神进犯，家园危在旦夕，拯救黎民百姓非@B你不可。请速度赶到各城市门口，砍杀怪物，赢取海量经验，并有机会获得@F{fc=c35}紫@B金壶法宝@F{fc=c1}和@F{fc=c35}浣熊宝宝蛋@F{fc=c1}。",
		"千年毒蛙":"@F{fc=c1}每天11：00-11：30、21:00-21:30听取蛙声一片，便是毒蛙进犯各城门，天下@B若累卵，请英雄大显神威，与他们对话战斗，赢取海量经验，并有机会获得@F{fc=c35}灵@B玉琥珀法宝@F{fc=c1}、@F{fc=c35}古神鸠宝宝蛋@F{fc=c1}。",
		"牛魔王":"@F{fc=c1}每天11:30-12:00、21:30-22:00，屡败屡战，屡战屡败的牛魔王都会准时出@B现在各城市等待挑战。打败它就能获得@F{fc=c35}驾驭神典@F{fc=c1}和@F{fc=c35}神威老虎宝宝蛋@F{fc=c1}，还等什@B么！",
		"摆摊":"@F{fc=c1}15级后，你可以在凤鸣广场的摆摊区摆摊了。说不定，你的第一桶金很快就@B有了！",
		"潜能任务":"@F{fc=c1}想成长为无上强者吗？ 15级开始，可以在凤鸣城的@F{fc=c4}子车玄@F{fc=c1}那里接受任务，寻@B找并击杀BOSS，爆发你的潜能小宇宙。",
		"潜能乱斗":"@F{fc=c1}学习技能不用愁，到凤鸣广场@F{fc=c4}吴霜@F{fc=c1}处参加潜能乱斗，就能获得海量潜能，成功@B消灭BOSS还有机会获得@F{fc=c35}七彩莲花法宝@F{fc=c1}、@F{fc=c35}拳击兔宝宝蛋@F{fc=c1}。但是要记得，3人以上队@B伍才能参加这个活动哦。",
		"材料任务":"@F{fc=c1}行走创世，装备的好坏是非常重要的，然而如何获得材料就需要你来努力了。@B你可以去凤鸣城的@F{fc=c4}钱大福@F{fc=c1}处接取材料任务，完成任务就能获得@F{fc=c35}打造材料@F{fc=c1}。",
		"讨伐任务":"@F{fc=c1}紧急发布集结令！野外正有大批怪物滋扰百姓！请协助凤鸣城@F{fc=c4}木公@F{fc=c1}讨伐野外怪@B物，换取更多经验，提高自身修为！",
		"世界喊话":"@F{fc=c1}在频道设置中选择“世界”，每次交纳5银就能让所有在线玩家听到你的呐喊。",
		"赛马":"@F{fc=c1}鲜衣怒马，意气风发。凤鸣城@F{fc=c4}采薇@F{fc=c1}每天12:00-12:30、19:00-19:30召开赛马大@B会，凡名列前茅者均有丰厚奖励。",
		"冲级奖励2":"@F{fc=c1}你的成长速度简直惊为天人！凤鸣城@F{fc=c4}创世之光@F{fc=c1}感叹天降奇人，再次奉送20级@B礼包请英雄再接再厉。礼包中有除了@F{fc=c35}高级药品@F{fc=c1}还有@F{fc=c35}双倍经验@F{fc=c1}。",
		"建立家族":"@F{fc=c1}30级的你已有一股不凡的领袖气质，世上有许多人期待奔赴你麾下。你可以@B到凤鸣城@F{fc=c4}少帝@F{fc=c1}那里申请建立家族，从此招兵买马，建功立业。",
		"PK":"@F{fc=c1}与人相斗，其乐无穷！现在你可以PK了。在头像下可以设置PK模式，@B快意恩仇。恶意PK会增加PK值，PK值大于17点就会红名，红名会被城@B市里的卫兵追杀，而且PK值大于60点会被关进监狱。",
		"镖局系统":"@F{fc=c1}“兴隆”、“昌平”镖局都称自己是天下第一镖，双方镖头相信你的@B加入会如虎添翼，都虚位以待。你可以在凤鸣城找金乌王表示效忠决@B心，选择加入哪个阵营，每天完成运镖、劫镖任务，获得大量金钱和@B镖局声望。",
		"采集技能":"@F{fc=c1}凤鸣城的@F{fc=c4}寒天@F{fc=c1}在琴棋书画之余，也研究了一些生活中比较实用的技能。想获得@B好装备的玩家就赶紧去找他报名学习采集吧！这年头，没个一技之长不好混哟！",
		"竞技系统":"@F{fc=c1}一战成名惊天下！周一和周四20:00-20:30，@F{fc=c4}战八方@F{fc=c1}举行组队乱斗。星期一三五@B的17:30-19:30，@F{fc=c4}少帝@F{fc=c1}举办家族擂台。周日10：00，@F{fc=c4}赛刑天@F{fc=c1}会开设武道大会。赢@B得比赛的玩家将获得大量经验奖励。",
		"NPC争夺战":"@F{fc=c1}各个城市都有部分NPC可以被家族占领，不仅被占领的NPC会头顶你的家族大@B名，歌功颂德不止，而且家族还可以领到不少好处。不过NPC不是一次占有终@B生征用，随时可能会被其它觊觎已久的家族争夺。",
		"水晶副本":"@F{fc=c1}邪恶的水晶发威了！凤鸣的@F{fc=c4}云舒@F{fc=c1}焦急地号召30级以上的勇士在每天@B13:30-14:30、21:00-22:00结队进入水晶副本，惩妖除魔。完成水@B晶副本可以获得大量经验和@F{fc=c35}镶嵌水晶@F{fc=c1}，BOSS梦寐还可能掉落@F{fc=c35}灵玉琥@B珀法宝@F{fc=c1}、@F{fc=c35}璇翼鹦鹉宝宝蛋@F{fc=c1}！",
		"师徒关怀":"@F{fc=c1}闯荡江湖，恩师如父。如果你有师父，30级的时可以让他带你去凤鸣城师徒@B管理员@F{fc=c4}礼相@F{fc=c1}领取30级师徒关怀奖励了！",
		"混沌入侵":"@F{fc=c1}每逢人多热闹的时候，创世各城市门口就会出现大批不知何处而来的混沌怪物@B前来作乱。能为之士自当前往，组队杀敌，为民除害。勇士归来定有厚赏！还@B有机会获得@F{fc=c35}仓鼠宝宝蛋@F{fc=c1}。",
		"冲级奖励3":"@F{fc=c1}你果然是盘古大神的血脉！凤鸣城@F{fc=c4}创世之光@F{fc=c1}对你的能力惊叹不已，再送30级@B礼包助你闯荡世界。礼包中有@F{fc=c35}强化材料@F{fc=c1}、@F{fc=c35}打造材料@F{fc=c1}和@F{fc=c35}大量元宝@F{fc=c1}！",
		"环任务":"@F{fc=c1}30级以后就可以接取环任务，每完成一组环任务，就有机会得到道具，总会@B有一个道具是让你惊喜的。",
		"神鬼秘境":"@F{fc=c1}巫妖王偷窃了大量的凤鸣城至宝，逃去无踪。追回珍宝也只有你才做得到了。@B35级之后你可以在凤鸣城找@F{fc=c4}金乌近卫军官@F{fc=c1}，组三人以上队伍报名进入神鬼秘境@B副本，每天两次。副本中会掉落大量稀世珍宝。还有@F{fc=c35}紫金壶法宝@F{fc=c1}、@F{fc=c35}胧灵老虎宝@B宝蛋@F{fc=c1}。",
		"巫妖前哨":"@F{fc=c1}40级可以开始探索巫妖前哨副本了。在凤鸣城找@F{fc=c4}勾玉文@F{fc=c1}@B报名进入。要求队伍至少3个人，每天都能参加两次。副本中掉落@F{fc=c35}宠物@B技能书@F{fc=c1}，BOSS还可能掉落@F{fc=c35}紫金壶法宝@F{fc=c1}和@F{fc=c35}大头老虎宝宝蛋@F{fc=c1}。",
		"天降奇兽":"@F{fc=c1}想赢取一头在侏罗纪时代嘶吼的暴龙，作为你的拉风宠物吗？每天13:30-14:00、@B20:30-21:00在40级以上城市门口会刷新很多大头暴龙，战胜他们就有机会获得@F{fc=c35}大@B头暴龙宝宝蛋@F{fc=c1}！",
		"冲级奖励4":"@F{fc=c1}当今时代最缺的是什么？人才！凤鸣城@F{fc=c4}创世之光@F{fc=c1}对你赞誉有加，又准备了一份@B豪华礼包等你来领。礼包中有各种@F{fc=c35}强化宠物的道具@F{fc=c1}，当然还有金光闪闪的@F{fc=c35}元宝@F{fc=c1}！",
		"建立帮会":"@F{fc=c1}能力越大，责任越大。一族之长已经不够你施展抱负了，建立帮会才是你更大@B的天空，45级后，你可以去凤鸣城@F{fc=c4}肖业@F{fc=c1}那里申请建立帮会，拥有自己的帮会领@B地，收纳更多家族。",
		"帮会城市战":"@F{fc=c1}每两周都将举行一次城市争夺。帮会帮主在希望争夺的城市管理员那里@B报名。获得城市占有权之后，可以收取这个城市的税收。",
		"师徒关怀123":"@F{fc=c1}名师出高徒。凤鸣城师徒管理员@F{fc=c4}礼相@F{fc=c1}相当满意你们和谐的师徒关系，邀请你来@B领取45级师徒关怀奖励了！",
		"出师":"@F{fc=c1}50级了，你已经可以独当一面，从此任重而道远。让你的师父带领你去凤鸣@B城找师徒管理员@F{fc=c4}礼相@F{fc=c1}举行出师仪式吧。师徒二人都会获得意想不到的大赏。",
		"失落宝藏":"@F{fc=c1}50级可以开始探索失落宝藏副本了。在凤鸣城找@F{fc=c4}旬苞@F{fc=c1}@B报名进入。要求队伍至少3个人，每天都能参加两次。副本中掉落@B@F{fc=c35}宠物技能书@F{fc=c1}，BOSS还可能掉落@F{fc=c35}紫金壶法宝@F{fc=c1}和@F{fc=c35}红翼蝙蝠宝宝蛋@F{fc=c1}。",
		"冲级奖励5":"@F{fc=c4}创世之光@F{fc=c1}看到你的能力越来越强，准备了更为豪华的50级礼包送@B你步入愈发惊心动魄的征途。",
		"地宫杀怪":"@F{fc=c1}听闻帝王古墓的怪物层出不穷，无穷无尽，被誉为练级圣地。许多@B冒险家兴致勃勃地来到避世山谷西南挑战极限，任意杀戮却不受惩@B罚的设定也让他们多了几个提防的心眼。",
		"收徒":"@F{fc=c1}你的英勇事迹被人们口耳相传。凤鸣师徒管理员@F{fc=c4}礼相@F{fc=c1}希望你把毕生所学发扬光@B大，劝说你物色几个不错的菜鸟收为徒弟。为师后，你可以获得大量奖励，领@B银元宝工资！",
		"闯天关":"@F{fc=c1}天界之神也听说你的威名，很想与你较量一番，特地在凤鸣@F{fc=c4}羿巫@F{fc=c1}处设下天关通@B行处。只要你组织3人以上队伍，击败所有天兵天将，便可获得天帝慷慨的奖@B赏。还有@F{fc=c35}七彩莲花法宝@F{fc=c1}、@F{fc=c35}霹雳贝贝宝宝蛋@F{fc=c1}！",
		"拯救猰貐":"@F{fc=c1}本来已经陷入绝望的狩人氏见到你后重燃希望，相信你一定可以帮@B助他们解救着魔的猰貐。组织3人以上队伍前往凤鸣城找@F{fc=c4}碧血@F{fc=c1}报名@B进入副本，每日两次，消灭BOSS有机会获得@F{fc=c35}七巧晶狐宝宝蛋@F{fc=c1}。",
		"组队竞技":"@F{fc=c1}周一和周四20:00-20:30，@F{fc=c4}战八方@F{fc=c1}将举行组队乱斗。比赛10级一段，每个等级段前10只报@B名的队伍有资格参加。每只队伍至少3个人。赢的比赛有几率获得@F{fc=c35}同林鸟宝宝蛋@F{fc=c1}、@F{fc=c35}万年冰@B魄法宝制作卷@F{fc=c1}。",
		"家族擂台":"@F{fc=c1}星期1、3、5的17:30-19:30，@F{fc=c4}少帝@F{fc=c1}将举办家族擂台。族长报名，每次前16个报名@B的家族有资格参加。等级大于55级的家族成员才能参加。超高经验奖励和家族声@B望等待你。",
		"武道大会":"@F{fc=c1}周日10：00，@F{fc=c4}赛刑天@F{fc=c1}会开设武道大会。比赛10级一段，每个等级段只能有32位@B勇士参与。一一对决，竞争最后的冠军。冠军有几率获得@F{fc=c35}火纹浣熊宝宝蛋@F{fc=c1}、@F{fc=c35}奇@B宝锦囊法宝制作卷@F{fc=c1}。",
		"邪龙洞穴":"@F{fc=c1}组织3人以上队伍，在凤鸣城找@F{fc=c4}荀隆@F{fc=c1}进入副本。挑战大批列阵的狼兵之后，你@B将面对BOSS应龙。消灭BOSS不但可以获得大量经验，而且有机会获得@F{fc=c35}皮皮熊宝@B宝蛋@F{fc=c1}。",
		"个人竞技":"@F{fc=c1}60级之后，可以在凤鸣城@F{fc=c4}迢斩@F{fc=c1}那里参加个人竞技活动。进入的时候需要100@B点以上的荣誉，只要在线荣誉就会自动回复。并且在战场中杀死对手也可以@B获得荣誉。每300点荣誉可以在凤鸣皇宫找@F{fc=c4}环荣@F{fc=c1}那里换取荣誉宝箱。宝箱中@B可以开出@F{fc=c35}金鱼宝宝蛋@F{fc=c1}还有@F{fc=c35}坐骑@F{fc=c1}哦！",
		"家族竞技":"@F{fc=c1}60级之后，可以在凤鸣城@F{fc=c4}峮欧@F{fc=c1}那里参加家族竞赛活动。进入的时候需要100@B点荣誉。在战场中击杀对手可以获得荣誉，而同家族成员击杀对手之后，你@B也可以获得荣誉。每300点荣誉可以在凤鸣皇宫找@F{fc=c4}环荣@F{fc=c1}那里换取荣誉宝箱。@B宝箱中可@B以开出@F{fc=c35}珍宠：金鱼@F{fc=c1}还有@F{fc=c35}坐骑@F{fc=c1}哦！",
		"龙岐洞":"@F{fc=c1}龙岐洞坐落在蓬莱仙岛中部。地宫中怪物密集，而且刷新速度快，是练级圣地。@B当然，那里可以任意PK不受惩罚，也要小心。",
		"商会任务":"@F{fc=c1}去飞来石找@F{fc=c4}华曾@F{fc=c1}接受商会任务吧。野外杀怪可以获得很多商会材料，用以完成@B任务。完成商会任务可以获得大量金钱，同时还能获得商会金票，商会金票是@B与投机商人做生意的凭证。",
		"封剑神宫":"@F{fc=c1}80级可以探索海底世界了。在凤鸣城通过@F{fc=c4}鱼人甚平@F{fc=c1}，与好友一起挑战封剑神宫。@B海底藏有大量极品道具，每天可以进入两次。",
		"摄魂迷阵":"@F{fc=c1}金乌王被困摄魂迷阵，只有90级以上的玩家才能进入。请组成多职业队伍，从@B凤鸣城@F{fc=c4}雏鸣@F{fc=c1}处进入摄魂迷阵，向巫妖王信徒宣战。副本每天开启两次，BOSS随@B机掉落@F{fc=c35}洗髓丹@F{fc=c1}、@F{fc=c35}忘忧丹@F{fc=c1}等宝物。",
}


# 物品产出帮助内容，左边为页码，右边为内容
ContenDatas = {
	0 : "@F{fc=c39}金钱获得途径：@B"
		"@F{fc=c4}1、活动产出（例如：赛马，主要途径）@B"
		"@F{fc=c4}2、商会任务（主要途径）@B"
		"@F{fc=c4}3、运镖任务（主要途径）@B"
		"@F{fc=c4}4、剧情任务@B"
		"@F{fc=c4}5、帮会跑商@B"
		"@F{fc=c4}6、杀怪掉落杂物出售@B"
		"@B"
		"@F{fc=c39}装备强化道具产出途径：@B"
		"@F{fc=c4}1、副本掉落（例如：潜能副本、水晶副本。主要途径）@B"
		"@F{fc=c4}2、活动掉落（例如：兵临城下。主要途径）@B"
		"@F{fc=c4}3、野外杀怪掉落@B"
		"@F{fc=c4}4、环任务产出@B"
		"@B",
	1 : "@F{fc=c39}打造材料的产出途径：@B"
		"@F{fc=c4}1、采集技能收集（主要途径）@B"
		"@F{fc=c4}2、副本掉落（例如：潜能副本、神鬼秘境。主要途径）@B"
		"@F{fc=c4}3、装备分解产出（主要途径）@B"
		"@F{fc=c4}4、材料任务产出（主要途径）@B"
		"@F{fc=c4}5、击杀野外BOSS掉落（主要途径）@B"
		"@F{fc=c4}6、锦囊掉落@B"
		"@F{fc=c4}7、藏宝图宝箱掉落@B"
		"@F{fc=c4}8、天降宝盒掉落@B"
		"@F{fc=c4}9、野外杀怪掉落@B"
		"@B"
		"@F{fc=c39}珍宠产出途径：@B"
		"@F{fc=c4}1、副本掉落（例如：失落宝藏。主要途径）@B"
		"@F{fc=c4}2、活动获得（例如：天降奇兽）@B"
		"@B",
	2 : "@F{fc=c39}宠物技能书产出途径：@B"
		"@F{fc=c4}1、副本掉落（例如：潜能副本。主要途径）@B"
		"@F{fc=c4}2、环任务奖励：“徽章”换取@B"
		"@B"
		"@F{fc=c39}法宝产出途径：@B"
		"@F{fc=c4}1、副本掉落（例如：失落宝藏。）@B"
		"@F{fc=c4}2、天关宝箱产出@B"
		"@F{fc=c4}3、法宝指引任务@B"
		"@B"
		"@F{fc=c39}绿装产出途径：@B"
		"@F{fc=c4}1、收集打造材料在NPC处打造（主要途径）@B"
		"@F{fc=c4}2、收集材料和制作卷轴在神机匣中合成（主要途径）@B"
		"@F{fc=c4}3、剧情任务@B"
		"@F{fc=c4}4、收集书页任务@B"
		"@F{fc=c4}5、蓝装换绿装任务@B"
		"@B",		
	3 : "@F{fc=c39}药品、强化宠物等辅助道具产出途径：@B"
		"@F{fc=c4}1、野外杀怪掉落@B"
		"@F{fc=c4}2、副本掉落（例如：神鬼秘境）@B"
		"@F{fc=c4}3、活动产出（例如：兵临城下）@B"
		"@F{fc=c4}4、剧情、指引任务@B" ,	
}

# 需要弹出物品产出帮助的等级，后面加"u"是为了区别于活动帮助
ShowLevelDatas = ["u1","u25","u37",]