# -*- coding: UTF-8 -*-
Datas = {
	10 : "恭喜您升到10级，现在您可以去凤鸣城中心广场找@L{t='创世之光($xz{10111227})';m=goto:10111227;cfc=c4;hfc=c3}领取10级升级奖励了！" ,
	20 : "恭喜您升到20级，现在您可以去凤鸣城中心广场找@L{t='创世之光($xz{10111227})';m=goto:10111227;cfc=c4;hfc=c3}领取20级升级奖励了！" ,
	30 : "恭喜您升到30级，现在您可以去凤鸣城中心广场找@L{t='创世之光($xz{10111227})';m=goto:10111227;cfc=c4;hfc=c3}领取30级升级奖励了！" ,
	40 : "恭喜您升到40级，现在您可以去凤鸣城中心广场找@L{t='创世之光($xz{10111227})';m=goto:10111227;cfc=c4;hfc=c3}领取40级升级奖励了！" ,
	50 : "恭喜您升到50级，现在您可以去凤鸣城中心广场找@L{t='创世之光($xz{10111227})';m=goto:10111227;cfc=c4;hfc=c3}领取50级升级奖励了！" ,
	0  : "@S{4}您的累计在线时间已达到5小时，可以在凤鸣广场的@L{t='创世之光($xz{10111227})';m=goto:10111227;cfc=c4;hfc=c3}活动大使处获得在线奖励！",
}