# -*- coding: gb18030 -*-
Datas = {
	0:{
		'OutPutDes':'','Des':'',
	},
	1:{
		'OutPutDes':'金钱获得途径','Des':'@B{2}@S{2}@F{fc=c39}金钱获得途径：@D@B{2}@F{fc=c4}@S{4}1、帮会跑商@B@S{4}2、劫镖@B@S{4}3、各类任务与各类活动奖励@B@D',
	},
	2:{
		'OutPutDes':'装备强化道具产出途径','Des':'@B{2}@S{2}@F{fc=c39}装备强化道具产出途径：@D@B{2}@F{fc=c4}@S{4}1、神鬼秘境、失落宝藏副本掉落@B@S{4}2、野外boss掉落@B@S{4}3、休闲活动奖励@B@D',
	},
	3:{
		'OutPutDes':'打造材料的产出途径','Des':'@B{2}@S{2}@F{fc=c39}打造材料的产出途径：@D@B{2}@F{fc=c4}@S{4}1、野外采集@B@S{4}2、材料任务奖励@B@S{4}3、装备分解@B@S{4}4、各类副本掉落@B@D',
	},
	4:{
		'OutPutDes':'绿装产出途径','Des':'@B{2}@S{2}@F{fc=c39}绿装产出途径：@D@B{2}@F{fc=c4}@S{4}1、各类副本掉落@B@S{4}2、剧情任务奖励@B@D',
	},
	5:{
		'OutPutDes':'珍宠产出途径','Des':'@B{2}@S{2}@F{fc=c39}珍宠产出途径：@D@B{2}@F{fc=c4}@S{4}1、巫妖前哨副本掉落@B@D',
	},
	6:{
		'OutPutDes':'宠物技能书产出途径','Des':'@B{2}@S{2}@F{fc=c39}宠物技能书产出途径：@D@B{2}@F{fc=c4}@S{4}1、巫妖前哨副本掉落@B@S{4}2、环任务勋章换取@B@S{4}3、帮会研制@B@D',
	},
	7:{
		'OutPutDes':'宠物强化道具产出途径','Des':'@B{2}@S{2}@F{fc=c39}宠物强化道具产出途径：@D@B{2}@F{fc=c4}@S{4}1、千年毒蛙、牛魔王掉落@B@S{4}2、各类休闲活动奖励@B@D',
	},
	8:{
		'OutPutDes':'自动回复药品产出途径','Des':'@B{2}@S{2}@F{fc=c39}自动回复药品产出途径：@D@B{2}@F{fc=c4}@S{4}1、竞技类比赛奖励@B@S{4}2、各类休闲活动奖励@B@D',
	},
	9:{
		'OutPutDes':'镶嵌水晶产出途径','Des':'@B{2}@S{2}@F{fc=c39}镶嵌水晶产出途径：@D@B{2}@F{fc=c4}@S{4}1、水晶副本掉落@B@S{4}2、势力声望奖励@B@D',
	},
	
}

