# -*- coding: UTF-8 -*-
Datas = {
	'10111208':{
		'50101026':(200,'@S{4}凤鸣的火铜是打造神兵的好材料，如果你有门路弄到，我%s一个收，有多少要多少。',),
		'50101029':(2830,'@S{4}狩人氏的元气散具有强大的复原能力，如果你有门路弄到，我%s一个收，有多少要多少。',),
		'50101028':(1482,'@S{4}迎客村的风鸟氏手上的雷羽具有让人飞天的特殊法力，如果你有门路弄到，我%s一个收，有多少要多少。',),
		'50101030':(4713,'@S{4}青鸟氏的净魂膏能够解除万蛊百毒，如果你有门路弄到，我%s一个收，有多少要多少。',),
		'50101031':(7184,'@S{4}苗人氏的三苗毒蛊号称天下第一奇毒，如果你有门路弄到，我%s一个收，有多少要多少。',),
		'50101103':(10303,'@S{4}蓬莱仙人炼制的不朽金丹吃后可以长生不老，如果你有门路弄到，我%s金一个收，有多少要多少。',),
		'50101027':(620,'@S{4}板泉乡秘制的镇魂酒号称天下第一，如果你有门路弄到，我%s一个收，有多少要多少。',),
		'50101137':(14133,'@S{4}昆仑族人用万年积雪寒酿的天阶玉液乃天下一绝，如果你有门路弄到，我%s一个收，有多少要多少。',),
	},
	
}

serverDatas = {
	'10111208':{
				'yun_meng_ze_01':'50101030',
				'yun_meng_ze_02':'50101031',
				'zly_ying_ke_cun':'50101028',
				'zly_bi_shi_jian':'50101029',
				'zly_ban_quan_xiang':'50101027',
				'peng_lai':'50101103',
				'kun_lun':'50101137',
				'fengming':'50101026',
				'50101026':'未熔炼的火铜',
				'50101029':'秘制元气散',
				'50101028':'完整的雷羽',
				'50101027':'百年镇魂酒',
				'50101031':'三苗毒蛊',
				'50101103':'不朽金丹',
				'50101030':'青鸟净魂膏',
				'50101137':'天阶玉液',
	},
	
}

