# -*- coding: cp950 -*-

lbs_CArmor = {
	1 : "物理防禦 %i",
	2 : "含強化",
	3 : "含認主",
	4 : "法術防禦 %i",
	5 : "抵抗沉默 %i",
	6 : "抵抗眩暈 %i",
	7 : "抵抗定身 %i",
	8 : "抵抗睡眠 %i",
	9 : "招架 %i",
	10 : "閃避 %i",
	11 : "降低對方物理命中 %i",
	12 : "降低對方法術命中 %i" ,
	13 : "(集齊激活套裝屬性)",
	}

lbs_CEquip = {
	1 : "殘缺",
	2 : "嶄新",
	3 : "完好",
	4 : "半舊",
	5 : "破損",
	6 : "殘缺",

	10 : "職業  ",
	11 : "套裝屬性",
	12 : "(未激活)",
	13 : "鑲嵌:",
	14 : "【神器】",
	15 : "已滿",
	}

lbs_CEquipMakeScroll = {
	1 : "錯誤：未找到符合的材料配置",
	2 : "需要材料：",
	3 : "出售單價：",
	4 : "合成後裝備:",
	}

lbs_CItemTreasureMap = {
	1 : "唯一",
	2 : "不可出售",
	}

lbs_CLuckyBox = {
	1 : "唯一",
	2 : "不可出售",
	}

lbs_CMarryRing = {
	1 : "唯一",
	2 : "不可出售",
	3 : "剩餘冷卻時間:",
	4 : "秒",
	}

lbs_CNecklace = {
	1 : "物理防禦 %i",
	2 : "含強化",
	3 : "含認主",
	4 : "法術防禦 %i",
	5 : "降低對方法術命中 %i",
	}

lbs_CItemBase = {
	1 : "唯一",
	2 : "不可出售",
	3 : "剩餘使用時間:",
	4 : "0秒",
	5 : "%s天",
	6 : "%s時",
	7 : "%s分鐘",
	8 : "%s秒",
	9 : "物品過了使用期限。",
	}

lbs_CRing = {
	1 : "物理攻擊 %i",
	2 : "含強化",
	3 : "含認主",
	4 : "法術攻擊 %i",
	}

lbs_CTalisman = {
	1 : "凡品屬性",
	2 : "仙品屬性",
	3 : "神品屬性",
	4 : "法寶技能: %s",
	5 : "技能等級: %s",
	6 : "含強化",
	7 : "破綻屬性"
	}

lbs_CWeapon = {
	1 : "物理攻擊 %i",
	2 : "含強化",
	3 : "含認主",
	4 : "法術攻擊 %i",
	5 : "神器屬性"
	}


lbs_CTeleport = {
	1 : "右鍵點擊,傳送至:",
	}

lbs_CTeleportCharm = {
	1 : "唯一",
	2 : "不可出售",
	}

lbs_EquipEffects = {
	1 : "體質",
	2 : "智力",
	3 : "力量",
	4 : "敏捷",
	5 : "生命",
	6 : "法力",
	7 : "物理防禦",
	8 : "法術防禦" ,
	9 : "物理攻擊力",
	10 : "法術攻擊力",
	11 : "生命恢復速度",
	12 : "法力恢復速度",
	13 : "最小攻擊力",
	14 : "最大攻擊力",
	15 : "物理命中",
	16 : "法術命中",
	17 : "閃避",
	18 : "物理爆擊",
	19 : "法術爆擊",
	20 : "招架",
	21 : "招架減傷",
	22 : "物理傷害減免",
	23 : "法術傷害減免",
	24 : "傷害減免",
	25 : "特效觸發",
	26 : "物理爆擊傷害倍數",
	27 : "法術爆擊傷害倍數",
	28 : "降低對方物理命中",
	29 : "降低對方法術命中",
	30 : "抵抗沉默",
	31 : "抵抗眩暈",
	32 : "抵抗定身",
	33 : "抵抗睡眠",
	34 : "抵抗沉默機率",
	35 : "抵抗眩暈機率",
	36 : "抵抗定身機率",
	37 : "抵抗睡眠機率",
	38 : "攻擊速度",
	39 : "移動速度",
	40 : "攻擊距離",
	41 : "特效觸發率",
	42 : "物理爆擊率",
	43 : "法術爆擊率",
	44 : "物理命中率",
	45 : "法術命中率",
	46 : "武器攻擊力",
	47 : "體質",
	48 : "智力",
	49 : "力量",
	50 : "敏捷",
	51 : "生命",
	52 : "法力",
	53 : "物理防禦",
	54 : "法術防禦",
	55 : "武器攻擊力",
	56 : "物理攻擊力",
	57 : "法術攻擊力",
	58 : "物理攻擊力",
	59 : "法術攻擊力",
	60 : "生命恢復速度",
	61 : "法力恢復速度",
	62 : "物理傷害減免",
	63 : "法術傷害減免",
	64 : "傷害減免",
	65 : "經驗",
	66 : "潛能",
	67 : "移動速度",
	68 : "攻擊速度",
	69 : "添加效果:",

	100 : "物理擊中(特效)：",
	101 : "法術擊中(特效)：",
	102 : "被擊中(特效)：",
	103 : "被爆擊(特效)：",
	104 : "物理爆擊(特效)：",
	105 : "法術爆擊(特效)：",
	106 : "增加法術(特效)：",

	107 : "火攻擊",
	108 : "玄攻擊",
	109 : "雷攻擊",
	110 : "冰攻擊",
	111 : "火抗",
	112 : "玄抗",
	113 : "雷抗",
	114 : "冰抗",

	115 : "物理被爆擊減免",
	116 : "法術被爆擊減免",

	117 : "沖鋒破綻機率",
	118 : "猛擊破綻機率",
	119 : "橫掃破綻機率",
	120 : "泰山壓頂破綻機率",
	121 : "勁射破綻機率",
	122 : "亂射破綻機率",
	123 : "落日破綻機率",
	124 : "快劍破綻機率",
	125 : "連綿劍破綻機率",
	126 : "追魂奪命破綻機率",
	127 : "火球術破綻機率",
	128 : "電擊術破綻機率",
	129 : "風卷殘雲破綻機率",

	}

lbs_kitCasket = {
	1 : "剩餘次數",
	}

lbs_Spell_LivingSkill = {
	1 : "採集技能",
	}

lbs_createEffect = {
	1 : "(屬性空位)",
	2 : "(灌注屬性)",
	}