# -*- coding: cp950 -*-

main = {
	'btn_6'		: { 'color' : (255.0, 250.0, 190.0), 'text' : "活躍度排行" },
	'btn_5'		: { 'color' : (255.0, 250.0, 190.0), 'text' : "PK排行" },
	'btn_4'		: { 'color' : (255.0, 250.0, 190.0), 'text' : "家族排行" },
	'btn_3'		: { 'color' : (255.0, 250.0, 190.0), 'text' : "幫會排行" },
	'btn_2'		: { 'color' : (255.0, 250.0, 190.0), 'text' : "財富排行" },
	'btn_1'		: { 'color' : (255.0, 250.0, 190.0), 'text' : "等級排行" },
	'shutBtn'	: { 'color' : (255.0, 248.0, 158.0), 'text' : "關 閉" },
	'lbTitle'	: { 'color' : (255.0, 248.0, 158.0), 'text' : "排行榜" },
	'bankInfo'	: { 'text' : "@F{fc=( 1, 255, 216, 255 )}刷新說明:@F{fc=( 255, 250, 190, 255 )}此排行榜於每天凌晨0：00刷新。" },
	'miNone'	: { 'text' : "無" },
	'miLevel'	: { 'text' : "%s級" },
	'exp_1'		: { 'text': "@F{fc=( 1, 255, 216, 255 )}浩蕩雄風藏萬卷，@B磅礡大氣獨凜然。@B一腔熱血沸騰時，@B萬裡汪洋起波瀾。" },
	'exp_2'		: { 'text': "@S{4}@F{fc=( 1, 255, 216, 255 )}有錢能使鬼推磨。錢不是萬能的，但是沒有錢卻是萬萬不能的。努力賺錢吧！" },
	'exp_3'		: { 'text': "@F{fc=( 1, 255, 216, 255 )}烽煙乍起，@B戰火驟急。@B血染徵袍，@B舍身不惜。@B今日霸主，@B明朝何去? @B萬戶集聚，@B群英莫敵。" },
	'exp_4'		: { 'text': "@F{fc=( 1, 255, 216, 255 )}團結的一家人，@B友愛的一家人，@B活潑的一家人，@B開朗的一家人，@B幸福的一家人。" },
	'exp_5'		: { 'text': "@F{fc=( 1, 255, 216, 255 )}十步殺一人，@B千裡不留行。@B事了拂衣去，@B深藏身與名。" },
}

panel_1 = {
	'opt_6'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "幫會" },
	'opt_5'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "家族" },
	'opt_4'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "職業" },
	'opt_3'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "等級" },
	'opt_2'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "名稱" },
	'opt_1'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "升降" },
	'opt_0'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "排名" },
}

panel_2 = {
	'opt_5'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "幫會" },
	'opt_4'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "家族" },
	'opt_3'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "總資產" },
	'opt_2'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "名稱" },
	'opt_1'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "升降" },
	'opt_0'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "排名" },
}

panel_3 = {
	'opt_6'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "成員數量" },
	'opt_5'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "幫主" },
	'opt_4'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "幫會聲望" },
	'opt_3'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "幫會等級" },
	'opt_2'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "幫會" },
	'opt_1'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "升降" },
	'opt_0'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "排名" },
}

panel_4 = {
	'opt_6'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "擁有NPC" },
	'opt_5'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "成員數量" },
	'opt_4'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "族長" },
	'opt_3'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "家族聲望" },
	'opt_2'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "家族" },
	'opt_1'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "升降" },
	'opt_0'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "排名" },
}

panel_5 = {
	'opt_6'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "被殺次數" },
	'opt_5'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "殺人次數" },
	'opt_4'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "職業" },
	'opt_3'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "等級" },
	'opt_2'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "名稱" },
	'opt_1'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "升降" },
	'opt_0'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "排名" },
}

panel_6 = {
	'opt_6'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "活躍度" },
	'opt_5'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "幫主" },
	'opt_4'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "幫會聲望" },
	'opt_3'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "幫會等級" },
	'opt_2'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "幫會名稱" },
	'opt_1'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "升降" },
	'opt_0'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "排名" },
}