# -*- coding: cp950 -*-

main = {
	'btnTry'		 : { 'color' : (255.0, 248.0, 158.0), 'text' : "試穿/騎" },
	'affirmChecker'	 : { 'color' : (255.0, 248.0, 158.0), 'text' : "購買確認" },
	'btnInc'		 : { 'color' : (255.0, 248.0, 158.0), 'text' : "後一頁" },
	'btnDec'		 : { 'color' : (255.0, 248.0, 158.0), 'text' : "前一頁" },
	'btnGuide'		 : { 'color' : (255.0, 248.0, 158.0), 'text' : "商城說明" },
	'btnCharge'		 : { 'color' : (255.0, 248.0, 158.0), 'text' : "快速充值" },
	'choiceIngot'	 : { 'color' : (255.0, 248.0, 158.0), 'text' : "選擇貨幣類型:" },
	'typeBtn_0'		 : { 'color' : (255.0, 248.0, 158.0), 'text' : "全部商品" },
	'typeBtn_2'		 : { 'color' : (255.0, 248.0, 158.0), 'text' : "熱銷商品" },
	'typeBtn_3'		 : { 'color' : (255.0, 248.0, 158.0), 'text' : "天材地寶" },
	'typeBtn_4'		 : { 'color' : (255.0, 248.0, 158.0), 'text' : "靈丹妙藥" },
	'typeBtn_6'		 : { 'color' : (255.0, 248.0, 158.0), 'text' : "坐騎商城" },
	'typeBtn_7'		 : { 'color' : (255.0, 248.0, 158.0), 'text' : "珍寵商城" },
	'typeBtn_8'		 : { 'color' : (255.0, 248.0, 158.0), 'text' : "時裝廣場" },
	'typeBtn_10'	 : { 'color' : (255.0, 248.0, 158.0), 'text' : "鑲嵌水晶" },
	'typeBtn_11'	 : { 'color' : (255.0, 248.0, 158.0), 'text' : "天幣交易" },
	'lbTitle'		 : { 'color' : (240.0, 232.0, 110.0), 'text' : "遊戲商城" },
	'buyOneConfirm'	 : { 'text'  : '確定花費%d天幣購買1個%s?'},
	'buyMoreConfirm' : { 'text'  : '確定花費%d天幣購買%d個%s?'},
	'btnBuy'		 : { 'text'  : '購買'},
	'stTips'		 : { 'color' : (0.0, 255.0, 0.0), 'text'  : 'shift+滑鼠右鍵批量購買'},
	'buyConfirm'	 : { 'color' : (240.0, 232.0, 110.0), 'text' : "購買確認" },
	'tab_0'			 : { 'color' : (255.0, 248.0, 158.0), "text": "金天幣商城"},
	'tab_1'			 : { 'color' : (255.0, 248.0, 158.0), "text": "銀天幣商城"},	
	'converatio'	 : { "text": "1WGS = 20天幣"},
	
}

explainwnd = {
	'shutBtn'		 : { 'color' : (255.0, 248.0, 158.0), 'text' : "關 閉" },
	'lbTitle'		 : { 'color' : (237.0, 230.0, 155.0), 'text' : "商城說明" },
	'explain'		 : { 'text': '@F{fc=( 240, 232, 110, 255 )}遊戲商城使用說明@B@B@F{fc=( 240, 232, 110, 255 )}金天幣/銀天幣@F{fc = ( 255, 250, 208, 255 )}@B@S{4}金天幣和銀天幣是遊戲中的特殊貨幣，用來在遊戲商城中購買道具。在遊戲商城中購買道具只能使用金天幣或銀天幣。@B@S{4}金天幣和銀天幣的區別在於，金天幣所購買的道具不會立刻與角色綁定，而使用銀天幣購買的道具一旦獲得即與角色綁定，無法與其他玩家交易。@B@B@F{fc=( 240, 232, 110, 255 )}怎樣獲得天幣@F{fc = ( 255, 250, 208, 255 )}@B@S{4}金天幣可以通過購買《光宇一卡通》或使用銀行卡、聲訊卡等方式在光宇遊戲充值中心充入光宇幣，然後兌換為天上人間天幣來獲得，具體的充值步驟可查看官方充值幫助(http://www.gyyx.cn/pay/PayHelp.aspx)。如果您擁有天幣票，可以直接使用獲得金天幣。@B@S{4}銀天幣是通過參與官方舉行的各種活動獲得。@B@B@F{fc=( 240, 232, 110, 255 )}查看天幣數量@F{fc = ( 255, 250, 208, 255 )}@B@S{4}打開您的背包，在神機匣位置與金錢之間，顯示有您當前擁有的金天幣和銀天幣數量。打開遊戲商城，在界面最下方，也顯示有金天幣和銀天幣的數量，方便您在購買商品時參考。@B@B@F{fc=( 240, 232, 110, 255 )}購買商品@F{fc = ( 255, 250, 208, 255 )}@B@S{4}您可以隨時隨地在遊戲商城中購買商品，各種分類讓您可以方便地選擇您所需要的商品種類，看到喜歡的時裝和騎寵，還可以在試穿功能中查看使用後的外型。@B@S{4}如果您取消了商城窗口右上角的“購買確認”選擇，您在購買商品時將不會再出現提示您確定購買商品的窗口。'},
	'explain_big5'	 : { 'text': '@F{fc=( 240, 232, 110, 255 )}遊戲商城使用說明@B@B@F{fc=( 240, 232, 110, 255 )}金天幣/銀天幣@F{fc = ( 255, 250, 208, 255 )}@B@S{4}金天幣和銀天幣是遊戲中的特殊貨幣，用來在遊戲商城中購買道具。在遊戲商城中購買道具只能使用金天幣或銀天幣。@B@S{4}金天幣和銀天幣的區別在於，金天幣所購買的道具不會立刻與角色綁定，而使用銀天幣購買的道具一旦獲得即與角色綁定，無法與其他玩家交易。@B@B@F{fc=( 240, 232, 110, 255 )}怎樣獲得天幣@F{fc = ( 255, 250, 208, 255 )}@B@S{4}金天幣可以透過在全省各大便利超商、3C通路賣場所購買《實體WGS點數卡》獲得，亦可透過信用卡、網路ATM、郵政劃撥、小額付費、ATM轉賬……等付款方式輕鬆購買《虛擬WGS點數》以兌換成金天幣。詳細內容清參閱官網(http://PL.wayi.com.tw)。如果您擁有天幣票，可以直接使用獲得金天幣。@B@S{4}銀天幣是通過參與官方舉行的各種活動獲得。@B@B@F{fc=( 240, 232, 110, 255 )}查看天幣數量@F{fc = ( 255, 250, 208, 255 )}@B@S{4}打開您的背包，在神機匣位置與金錢之間，顯示有您當前擁有的金天幣和銀天幣數量。打開遊戲商城，在界面最下方，也顯示有金天幣和銀天幣的數量，方便您在購買商品時參考。@B@B@F{fc=( 240, 232, 110, 255 )}購買商品@F{fc = ( 255, 250, 208, 255 )}@B@S{4}您可以隨時隨地在遊戲商城中購買商品，各種分類讓您可以方便地選擇您所需要的商品種類，看到喜歡的時裝和騎寵，還可以在試穿功能中查看使用後的外型。@B@S{4}如果您取消了商城窗口右上角的“購買確認”選擇，您在購買商品時將不會再出現提示您確定購買商品的窗口。'}
}

FittingPanel = {
	'shutBtn'		 : { 'color' : (255.0, 248.0, 158.0), 'text' : "關 閉" },
	'lbTitle'		 : { 'color' : (237.0, 230.0, 155.0), 'text' : "試 衣 間" },
}

ybPanel = {
	'btn_0'			:{ 'color' : (255.0, 248.0, 158.0), 'text' : "寄售列表"},
	'btn_1'			:{ 'color' : (255.0, 248.0, 158.0), 'text' : "求購列表"},
	'btn_2'			:{ 'color' : (255.0, 248.0, 158.0), 'text' : "訂單發布"},
	'btn_3'			:{ 'color' : (255.0, 248.0, 158.0), 'text' : "交易記錄"},
	'btn_4'			:{ 'color' : (255.0, 248.0, 158.0), 'text' : "訂單操作"},
	'btnFresh'		:{ 'color' : (255.0, 248.0, 158.0), 'text' : "刷新"},
	'btnBuy'		:{ 'color' : (255.0, 248.0, 158.0), 'text' : "購買天幣"},
	'btnSell'		:{ 'color' : (255.0, 248.0, 158.0), 'text' : "出售天幣"},
}
TranstPanel = {
	'colBtn_0'		:{ 'color' : (255.0, 248.0, 158.0), 'text' : "訂單號"},
	'colBtn_1'		:{ 'color' : (255.0, 248.0, 158.0), 'text' : "單價(銅/100金天幣)"},
	'colBtn_2'		:{ 'color' : (255.0, 248.0, 158.0), 'text' : "金天幣總量"},
	'colBtn_3'		:{ 'color' : (255.0, 248.0, 158.0), 'text' : "剩餘時間"},
	'remainDays'	:{ 'color' : (255.0, 248.0, 158.0), 'text' : "%d天%d小時"},
	'remainHours'	:{ 'color' : (255.0, 248.0, 158.0), 'text' : "%d小時%d分鐘"},
	'remainMins'	:{ 'color' : (255.0, 248.0, 158.0), 'text' : "%d分鐘"},
}
ReleasePanel = {
	'sellSetting'	:{ 'color' : (255.0, 248.0, 158.0), 'text' : "寄售天幣設置"},
	'sellUnit'		:{ 'color' : (255.0, 248.0, 158.0), 'text' : "寄售單價"},
	'sellNumber'	:{ 'color' : (255.0, 248.0, 158.0), 'text' : "寄售數"},
	'totalText'		:{ 'color' : (255.0, 248.0, 158.0), 'text' : "總計金額"},
	'feeText'		:{ 'color' : (255.0, 248.0, 158.0), 'text' : "手續費"},
	'totalIncome'	:{ 'color' : (255.0, 248.0, 158.0), 'text' : "總計收入"},
	'tradeTime'		:{ 'color' : (255.0, 248.0, 158.0), 'text' : "掛單時間72小時(3天)"},
	'confirmSell'	:{ 'color' : (255.0, 248.0, 158.0), 'text' : "確認寄售"},
	'totalExpend'	:{ 'color' : (255.0, 248.0, 158.0), 'text' : "總計支出"},
	'confirmBuy'	:{ 'color' : (255.0, 248.0, 158.0), 'text' : "確認求購"},
	'buyUnit'		:{ 'color' : (255.0, 248.0, 158.0), 'text' : "求購單價"},
	'buyNumber'		:{ 'color' : (255.0, 248.0, 158.0), 'text' : "求購數"},
	'tradeAccount'	:{ 'color' : (255.0, 248.0, 158.0), 'text' : "天幣交易賬戶"},
	'accountMoney'	:{ 'color' : (255.0, 248.0, 158.0), 'text' : "賬戶遊戲幣"},
	'accountGold'	:{ 'color' : (255.0, 248.0, 158.0), 'text' : "賬戶金天幣"},
	'btnWithdraw'	:{ 'color' : (255.0, 248.0, 158.0), 'text' : "取出"},
	'buySetting'	:{ 'color' : (255.0, 248.0, 158.0), 'text' : "購買天幣設置"},
	'rateText'		:{ 'color' : (255.0, 248.0, 158.0), 'text' : " x100"},

}
DetailsPanel = {
	'colBtn_0'		:{ 'color' : (255.0, 248.0, 158.0), 'text' : "訂單號"},
	'colBtn_1'		:{ 'color' : (255.0, 248.0, 158.0), 'text' : "類型"},
	'colBtn_2'		:{ 'color' : (255.0, 248.0, 158.0), 'text' : "數量(金天幣)"},
	'colBtn_3'		:{ 'color' : (255.0, 248.0, 158.0), 'text' : "單價(銅/100金天幣)"},
	"colBtn_release":{ 'color' : (255.0, 248.0, 158.0), 'text' : "發布時間"},
	'colBtn_trade'	:{ 'color' : (255.0, 248.0, 158.0), 'text' : "交易時間"},
	'btnDraw'		:{ 'color' : (255.0, 248.0, 158.0), 'text' : "撤銷訂單"},
	'dateText'		:{ 'color' : (255.0, 248.0, 158.0), 'text' : "%d月%d日%d時%d分"},
	'freshWarning'	:{ 'text': "您刷新過快，每次刷新時間間隔至少10秒。"},
}
TranstBox = {
	'orderNumer'	:{ 'color' : (255.0, 248.0, 158.0), 'text' : "訂單號"},
	'buyTitle'		:{ 'color' : (255.0, 248.0, 158.0), 'text' : "購買天幣"},
	'sellUnit'		:{ 'color' : (255.0, 248.0, 158.0), 'text' : "出售單價"},
	'sellNumber'	:{ 'color' : (255.0, 248.0, 158.0), 'text' : "出售數量"},
	'inputBuy'		:{ 'color' : (255.0, 248.0, 158.0), 'text' : "輸入購買數量"},
	'totalExpend'	:{ 'color' : (255.0, 248.0, 158.0), 'text' : "總共需要支付"},
	'sellTitle'		:{ 'color' : (255.0, 248.0, 158.0), 'text' : "出售天幣"},
	'buyUnit'		:{ 'color' : (255.0, 248.0, 158.0), 'text' : "求購單價"},
	'buyNumber'		:{ 'color' : (255.0, 248.0, 158.0), 'text' : "求購數量"},
	'inputSell'		:{ 'color' : (255.0, 248.0, 158.0), 'text' : "輸入出售數量"},
	'totalIncome'	:{ 'color' : (255.0, 248.0, 158.0), 'text' : "總共可以獲得"},

	
}