# -*- coding: cp950 -*-

# 浮動框描述內容
TipDatas = {
		"加入家族":"@F{fc=c1}大劫當前，群英并起！10級之后你可以加入家族，結識英雄好漢歃血為盟，@B共享經驗一同成長。",
		"拜師":"@F{fc=c1}世界浩大無邊，為什么不找個良師益友指導自己闖蕩呢？現在就到鳳鳴城@F{fc=c4}禮相@F{fc=c1}@B那里找個師父，共同修煉吧！有豐富的獎勵等你來拿哦！",
		"經驗亂斗":"@F{fc=c1}每周六舉行的經驗亂斗，是個產出海量經驗的活動，有機會獲得@F{fc=c35}七彩蓮花法寶@F{fc=c1}、@B@F{fc=c35}拳擊兔寶寶蛋@F{fc=c1}，還有其他豐富的獎品等你來拿，千萬別錯過。",
		"科舉答題":"@F{fc=c1}鳳鳴城@F{fc=c4}科舉報名官員@F{fc=c1}聽聞你鑿壁求光、寒窗苦讀數年，文采非凡，特意邀請你@B參加科舉，愿你金榜題名。科舉答題每天都有海量經驗和極品道具，金科狀元@B還可以獲得@F{fc=c35}鸚鵡寶寶蛋@F{fc=c1}。",
		"沖級獎勵1":"@F{fc=c1}鳳鳴城@F{fc=c4}鳳鳴之光@F{fc=c1}已經為你準備了10級禮包慶祝你升到10級，@F{fc=c35}高級藥品@F{fc=c1}、@B@F{fc=c35}引路蜂@F{fc=c1}、@F{fc=c35}歸命符籙@F{fc=c1}等商城物品盡在禮包中，還不快去拿！",
		"釣魚":"@F{fc=c1}一壺酒，一竿綸，世上如儂有幾人。鳳鳴海灘匯聚了一群氣定神閑的釣@B魚人，你也可以加入其中，每桿必有收獲，拿到@F{fc=c4}囡囡@F{fc=c1}那里能夠換取@F{fc=c35}收費藥@F{fc=c1}、@B@F{fc=c35}鑲嵌水晶@F{fc=c1}等各種道具。",
		"跳舞":"@F{fc=c1}鳳鳴海灘的@F{fc=c4}舞廳@F{fc=c1}每日舞動奇跡，演繹浪漫傳奇。不僅可以邀請心儀之人共舞，@B還能獲得大量經驗和跳舞積分，跳舞積分可以用來換取@F{fc=c35}“師徒”標記@F{fc=c1}，還能換@B@F{fc=c35}靈藥@F{fc=c1}！",
		"星宿挑戰":"@F{fc=c1}天上的星宿們百無聊賴，被人間的繁華熱鬧吸引，紛紛下界巡玩。凡間異士得@B遇仙官，怎能輕易錯過機緣，快快到鳳鳴城找@F{fc=c4}星宿挑戰總管@F{fc=c1}打聽星宿下落，一@B定要與天罡地煞們討教一番，非但可以增進修為，還極有可能意外獲得@F{fc=c35}炫彩鴛@B鴦寶寶蛋@F{fc=c1}哦！",
		"變身":"@F{fc=c1}鳳鳴海灘的@F{fc=c4}馬夕@F{fc=c1}廣發英雄帖，只求一敗。每天14：30和20：30舉行變身大@B賽。誰能使用變身牌跟上他七十二變的速度，他就甘拜下風，奉上小丑徽@B記，玩家憑此換取@F{fc=c35}鑲嵌水晶@F{fc=c1}和@F{fc=c35}討伐令@F{fc=c1}。",
		"兵臨城下":"@F{fc=c1}每天10:00-12:00，22：00-24：00魔神進犯，家園危在旦夕，拯救黎民百姓非@B你不可。請速度趕到各城市門口，砍殺怪物，贏取海量經驗，并有機會獲得@F{fc=c35}紫@B金壺法寶@F{fc=c1}和@F{fc=c35}浣熊寶寶蛋@F{fc=c1}。",
		"千年毒蛙":"@F{fc=c1}每天11：00-11：30、21:00-21:30聽取蛙聲一片，便是毒蛙進犯各城門，天下@B若累卵，請英雄大顯神威，與他們對話戰斗，贏取海量經驗，并有機會獲得@F{fc=c35}靈@B玉琥珀法寶@F{fc=c1}、@F{fc=c35}古神鳩寶寶蛋@F{fc=c1}。",
		"牛魔王":"@F{fc=c1}每天11:30-12:00、21:30-22:00，屢敗屢戰，屢戰屢敗的牛魔王都會準時出@B現在各城市等待挑戰。打敗它就能獲得@F{fc=c35}駕馭神典@F{fc=c1}和@F{fc=c35}神威老虎寶寶蛋@F{fc=c1}，還等什@B么！",
		"擺攤":"@F{fc=c1}15級后，你可以在鳳鳴廣場的擺攤區擺攤了。說不定，你的第一桶金很快就@B有了！",
		"潛能任務":"@F{fc=c1}想成長為無上強者嗎？ 15級開始，可以在鳳鳴城的@F{fc=c4}子車玄@F{fc=c1}那里接受任務，尋@B找并擊殺BOSS，爆發你的潛能小宇宙。",
		"潛能亂斗":"@F{fc=c1}學習技能不用愁，到鳳鳴廣場@F{fc=c4}吳霜@F{fc=c1}處參加潛能亂斗，就能獲得海量潛能，成功@B消滅BOSS還有機會獲得@F{fc=c35}七彩蓮花法寶@F{fc=c1}、@F{fc=c35}拳擊兔寶寶蛋@F{fc=c1}。但是要記得，3人以上隊@B伍才能參加這個活動哦。",
		"材料任務":"@F{fc=c1}裝備的好壞是非常重要的，然而如何獲得材料就需要你來努力了。你可以去鳳@B鳴城的@F{fc=c4}錢大福@F{fc=c1}處接取材料任務，完成任務就能獲得@F{fc=c35}打造材料@F{fc=c1}。",
		"討伐任務":"@F{fc=c1}緊急發布集結令！野外正有大批怪物滋擾百姓！請協助鳳鳴城@F{fc=c4}木公@F{fc=c1}討伐野外怪@B物，換取更多經驗，提高自身修為！",
		"世界喊話":"@F{fc=c1}在頻道設置中選擇“世界”，每次交納5銀就能讓所有在線玩家聽到你的吶喊。",
		"賽馬":"@F{fc=c1}鮮衣怒馬，意氣風發。鳳鳴城@F{fc=c4}采薇@F{fc=c1}每天12:00-12:30、19:00-19:30召開賽馬大@B會，凡名列前茅者均有豐厚獎勵。",
		"沖級獎勵2":"@F{fc=c1}你的成長速度簡直驚為天人！鳳鳴城@F{fc=c4}鳳鳴之光@F{fc=c1}感嘆天降奇人，再次奉送20級@B禮包請英雄再接再厲。禮包中有除了@F{fc=c35}高級藥品@F{fc=c1}還有@F{fc=c35}雙倍經驗@F{fc=c1}。",
		"建立家族":"@F{fc=c1}30級的你已有一股不凡的領袖氣質，世上有許多人期待奔赴你麾下。你可以@B到鳳鳴城@F{fc=c4}少帝@F{fc=c1}那里申請建立家族，從此招兵買馬，建功立業。",
		"PK":"@F{fc=c1}與人相斗，其樂無窮！現在你可以PK了。在頭像下可以設置PK模式，@B快意恩仇。惡意PK會增加PK值，PK值大于17點就會紅名，紅名會被城@B市里的衛兵追殺，而且PK值大于60點會被關進監獄。",
		"鏢局系統":"@F{fc=c1}“興隆”、“昌平”鏢局都稱自己是天下第一鏢，雙方鏢頭相信你的@B加入會如虎添翼，都虛位以待。你可以在鳳鳴城找金烏王表示效忠決@B心，選擇加入哪個陣營，每天完成運鏢、劫鏢任務，獲得大量金錢和@B鏢局聲望。",
		"采集技能":"@F{fc=c1}鳳鳴城的@F{fc=c4}寒天@F{fc=c1}在琴棋書畫之余，也研究了一些生活中比較實用的技能。想獲得@B好裝備的玩家就趕緊去找他報名學習采集吧！這年頭，沒個一技之長不好混喲！",
		"競技系統":"@F{fc=c1}一戰成名驚天下！周一和周四20:00-20:30，@F{fc=c4}戰八方@F{fc=c1}舉行組隊亂斗。星期一三五@B的17:30-19:30，@F{fc=c4}少帝@F{fc=c1}舉辦家族擂臺。周日10：00，@F{fc=c4}賽刑天@F{fc=c1}會開設武道大會。贏@B得比賽的玩家將獲得大量經驗獎勵。",
		"NPC爭奪戰":"@F{fc=c1}各個城市都有部分NPC可以被家族占領，不僅被占領的NPC會頭頂你的家族大@B名，歌功頌德不止，而且家族還可以領到不少好處。不過NPC不是一次占有終@B生征用，隨時可能會被其它覬覦已久的家族爭奪。",
		"水晶副本":"@F{fc=c1}邪惡的水晶發威了！鳳鳴的@F{fc=c4}云舒@F{fc=c1}焦急地號召30級以上的勇士在每天@B13:30-14:30、21:00-22:00結隊進入水晶副本，懲妖除魔。完成水@B晶副本可以獲得大量經驗和@F{fc=c35}鑲嵌水晶@F{fc=c1}，BOSS夢寐還可能掉落@F{fc=c35}靈玉琥@B珀法寶@F{fc=c1}、@F{fc=c35}璇翼鸚鵡寶寶蛋@F{fc=c1}！",
		"師徒關懷":"@F{fc=c1}闖蕩江湖，恩師如父。如果你有師父，30級的時可以讓他帶你去鳳鳴城師徒@B管理員@F{fc=c4}禮相@F{fc=c1}領取30級師徒關懷獎勵了！",
		"混沌入侵":"@F{fc=c1}每逢人多熱鬧的時候，各城市門口就會出現大批不知何處而來的混沌怪物前來@B作亂。能為之士自當前往，組隊殺敵，為民除害。勇士歸來定有厚賞！還有機@B會獲得@F{fc=c35}倉鼠寶寶蛋@F{fc=c1}。",
		"沖級獎勵3":"@F{fc=c1}你果然是盤古大神的血脈！鳳鳴城@F{fc=c4}鳳鳴之光@F{fc=c1}對你的能力驚嘆不已，再送30級@B禮包助你闖蕩世界。禮包中有@F{fc=c35}強化材料@F{fc=c1}、@F{fc=c35}打造材料@F{fc=c1}和@F{fc=c35}大量元寶@F{fc=c1}！",
		"環任務":"@F{fc=c1}30級以后就可以接取環任務，每完成一組環任務，就有機會得到道具，總會@B有一個道具是讓你驚喜的。",
		"神鬼秘境":"@F{fc=c1}巫妖王偷竊了大量的鳳鳴城至寶，逃去無蹤。追回珍寶也只有你才做得到了。@B35級之后你可以在鳳鳴城找@F{fc=c4}金烏近衛軍官@F{fc=c1}，組三人以上隊伍報名進入神鬼秘境@B副本，每天兩次。副本中會掉落大量稀世珍寶。還有@F{fc=c35}紫金壺法寶@F{fc=c1}、@F{fc=c35}朧靈老虎寶@B寶蛋@F{fc=c1}。",
		"巫妖前哨":"@F{fc=c1}40級可以開始探索巫妖前哨副本了。在鳳鳴城找@F{fc=c4}勾玉文@F{fc=c1}@B報名進入。要求隊伍至少3個人，每天都能參加兩次。副本中掉落@F{fc=c35}寵物@B技能書@F{fc=c1}，BOSS還可能掉落@F{fc=c35}紫金壺法寶@F{fc=c1}和@F{fc=c35}大頭老虎寶寶蛋@F{fc=c1}。",
		"天降奇獸":"@F{fc=c1}想贏取一頭在侏羅紀時代嘶吼的暴龍，作為你的拉風寵物嗎？每天13:30-14:00、@B20:30-21:00在40級以上城市門口會刷新很多大頭暴龍，戰勝他們就有機會獲得@F{fc=c35}大@B頭暴龍寶寶蛋@F{fc=c1}！",
		"沖級獎勵4":"@F{fc=c1}當今時代最缺的是什么？人才！鳳鳴城@F{fc=c4}鳳鳴之光@F{fc=c1}對你贊譽有加，又準備了一份@B豪華禮包等你來領。禮包中有各種@F{fc=c35}強化寵物的道具@F{fc=c1}，當然還有金光閃閃的@F{fc=c35}元寶@F{fc=c1}！",
		"建立幫會":"@F{fc=c1}能力越大，責任越大。一族之長已經不夠你施展抱負了，建立幫會才是你更大@B的天空，45級后，你可以去鳳鳴城@F{fc=c4}肖業@F{fc=c1}那里申請建立幫會，擁有自己的幫會領@B地，收納更多家族。",
		"幫會城市戰":"@F{fc=c1}每兩周都將舉行一次城市爭奪。幫會幫主在希望爭奪的城市管理員那里@B報名。獲得城市占有權之后，可以收取這個城市的稅收。",
		"師徒關懷123":"@F{fc=c1}名師出高徒。鳳鳴城師徒管理員@F{fc=c4}禮相@F{fc=c1}相當滿意你們和諧的師徒關系，邀請你來@B領取45級師徒關懷獎勵了！",
		"出師":"@F{fc=c1}50級了，你已經可以獨當一面，從此任重而道遠。讓你的師父帶領你去鳳鳴@B城找師徒管理員@F{fc=c4}禮相@F{fc=c1}舉行出師儀式吧。師徒二人都會獲得意想不到的大賞。",
		"失落寶藏":"@F{fc=c1}50級可以開始探索失落寶藏副本了。在鳳鳴城找@F{fc=c4}旬苞@F{fc=c1}@B報名進入。要求隊伍至少3個人，每天都能參加兩次。副本中掉落@B@F{fc=c35}寵物技能書@F{fc=c1}，BOSS還可能掉落@F{fc=c35}紫金壺法寶@F{fc=c1}和@F{fc=c35}紅翼蝙蝠寶寶蛋@F{fc=c1}。",
		"沖級獎勵5":"@F{fc=c4}鳳鳴之光@F{fc=c1}看到你的能力越來越強，準備了更為豪華的50級禮包送@B你步入愈發驚心動魄的征途。",
		"地宮殺怪":"@F{fc=c1}聽聞帝王古墓的怪物層出不窮，無窮無盡，被譽為練級圣地。許多@B冒險家興致勃勃地來到避世山谷西南挑戰極限，任意殺戮卻不受懲@B罰的設定也讓他們多了幾個提防的心眼。",
		"收徒":"@F{fc=c1}你的英勇事跡被人們口耳相傳。鳳鳴師徒管理員@F{fc=c4}禮相@F{fc=c1}希望你把畢生所學發揚光@B大，勸說你物色幾個不錯的菜鳥收為徒弟。為師后，你可以獲得大量獎勵，領@B銀元寶工資！",
		"闖天關":"@F{fc=c1}天界之神也聽說你的威名，很想與你較量一番，特地在鳳鳴@F{fc=c4}羿巫@F{fc=c1}處設下天關通@B行處。只要你組織3人以上隊伍，擊敗所有天兵天將，便可獲得天帝慷慨的獎@B賞。還有@F{fc=c35}七彩蓮花法寶@F{fc=c1}、@F{fc=c35}霹靂貝貝寶寶蛋@F{fc=c1}！",
		"拯救猰貐":"@F{fc=c1}本來已經陷入絕望的狩人氏見到你后重燃希望，相信你一定可以幫@B助他們解救著魔的猰貐。組織3人以上隊伍前往鳳鳴城找@F{fc=c4}碧血@F{fc=c1}報名@B進入副本，每日兩次，消滅BOSS有機會獲得@F{fc=c35}七巧晶狐寶寶蛋@F{fc=c1}。",
		"組隊競技":"@F{fc=c1}周一和周四20:00-20:30，@F{fc=c4}戰八方@F{fc=c1}將舉行組隊亂斗。比賽10級一段，每個等級段前10只報@B名的隊伍有資格參加。每只隊伍至少3個人。贏的比賽有幾率獲得@F{fc=c35}同林鳥寶寶蛋@F{fc=c1}、@F{fc=c35}萬年冰@B魄法寶制作卷@F{fc=c1}。",
		"家族擂臺":"@F{fc=c1}星期1、3、5的17:30-19:30，@F{fc=c4}少帝@F{fc=c1}將舉辦家族擂臺。族長報名，每次前16個報名@B的家族有資格參加。等級大于55級的家族成員才能參加。超高經驗獎勵和家族聲@B望等待你。",
		"武道大會":"@F{fc=c1}周日10：00，@F{fc=c4}賽刑天@F{fc=c1}會開設武道大會。比賽10級一段，每個等級段只能有32位@B勇士參與。一一對決，競爭最后的冠軍。冠軍有幾率獲得@F{fc=c35}火紋浣熊寶寶蛋@F{fc=c1}、@F{fc=c35}奇@B寶錦囊法寶制作卷@F{fc=c1}。",
		"邪龍洞穴":"@F{fc=c1}組織3人以上隊伍，在鳳鳴城找@F{fc=c4}荀隆@F{fc=c1}進入副本。挑戰大批列陣的狼兵之后，你@B將面對BOSS應龍。消滅BOSS不但可以獲得大量經驗，而且有機會獲得@F{fc=c35}皮皮熊寶@B寶蛋@F{fc=c1}。",
		"個人競技":"@F{fc=c1}60級之后，可以在鳳鳴城@F{fc=c4}迢斬@F{fc=c1}那里參加個人競技活動。進入的時候需要100@B點以上的榮譽，只要在線榮譽就會自動回復。并且在戰場中殺死對手也可以@B獲得榮譽。每300點榮譽可以在鳳鳴皇宮找@F{fc=c4}環榮@F{fc=c1}那里換取榮譽寶箱。寶箱中@B可以開出@F{fc=c35}金魚寶寶蛋@F{fc=c1}還有@F{fc=c35}坐騎@F{fc=c1}哦！",
		"家族競技":"@F{fc=c1}60級之后，可以在鳳鳴城@F{fc=c4}峮歐@F{fc=c1}那里參加家族競賽活動。進入的時候需要100@B點榮譽。在戰場中擊殺對手可以獲得榮譽，而同家族成員擊殺對手之后，你@B也可以獲得榮譽。每300點榮譽可以在鳳鳴皇宮找@F{fc=c4}環榮@F{fc=c1}那里換取榮譽寶箱。@B寶箱中可@B以開出@F{fc=c35}珍寵：金魚@F{fc=c1}還有@F{fc=c35}坐騎@F{fc=c1}哦！",
		"龍岐洞":"@F{fc=c1}龍岐洞坐落在蓬萊仙島中部。地宮中怪物密集，而且刷新速度快，是練級圣地。@B當然，那里可以任意PK不受懲罰，也要小心。",
		"商會任務":"@F{fc=c1}去飛來石找@F{fc=c4}華曾@F{fc=c1}接受商會任務吧。野外殺怪可以獲得很多商會材料，用以完成@B任務。完成商會任務可以獲得大量金錢，同時還能獲得商會金票，商會金票是@B與投機商人做生意的憑證。",
		"封劍神宮":"@F{fc=c1}80級可以探索海底世界了。在鳳鳴城通過@F{fc=c4}魚人甚平@F{fc=c1}，與好友一起挑戰封劍神宮。@B海底藏有大量極品道具，每天可以進入兩次。",
		"攝魂迷陣":"@F{fc=c1}金烏王被困攝魂迷陣，只有90級以上的玩家才能進入。請組成多職業隊伍，從@B鳳鳴城@F{fc=c4}雛鳴@F{fc=c1}處進入攝魂迷陣，向巫妖王信徒宣戰。副本每天開啟兩次，BOSS隨@B機掉落@F{fc=c35}洗髓丹@F{fc=c1}、@F{fc=c35}忘憂丹@F{fc=c1}等寶物。",
}


# 物品產出幫助內容，左邊為頁碼，右邊為內容
ContenDatas = {
	0 : "@F{fc=c39}金錢獲得途徑：@B"
		"@F{fc=c4}1、活動產出（例如：賽馬，主要途徑）@B"
		"@F{fc=c4}2、商會任務（主要途徑）@B"
		"@F{fc=c4}3、運鏢任務（主要途徑）@B"
		"@F{fc=c4}4、劇情任務@B"
		"@F{fc=c4}5、幫會跑商@B"
		"@F{fc=c4}6、殺怪掉落雜物出售@B"
		"@B"
		"@F{fc=c39}裝備強化道具產出途徑：@B"
		"@F{fc=c4}1、副本掉落（例如：潛能副本、水晶副本。主要途徑）@B"
		"@F{fc=c4}2、活動掉落（例如：兵臨城下。主要途徑）@B"
		"@F{fc=c4}3、野外殺怪掉落@B"
		"@F{fc=c4}4、環任務產出@B"
		"@B",
	1 : "@F{fc=c39}打造材料的產出途徑：@B"
		"@F{fc=c4}1、采集技能收集（主要途徑）@B"
		"@F{fc=c4}2、副本掉落（例如：潛能副本、神鬼秘境。主要途徑）@B"
		"@F{fc=c4}3、裝備分解產出（主要途徑）@B"
		"@F{fc=c4}4、材料任務產出（主要途徑）@B"
		"@F{fc=c4}5、擊殺野外BOSS掉落（主要途徑）@B"
		"@F{fc=c4}6、錦囊掉落@B"
		"@F{fc=c4}7、藏寶圖寶箱掉落@B"
		"@F{fc=c4}8、天降寶盒掉落@B"
		"@F{fc=c4}9、野外殺怪掉落@B"
		"@B"
		"@F{fc=c39}珍寵產出途徑：@B"
		"@F{fc=c4}1、副本掉落（例如：失落寶藏。主要途徑）@B"
		"@F{fc=c4}2、活動獲得（例如：天降奇獸）@B"
		"@B",
	2 : "@F{fc=c39}寵物技能書產出途徑：@B"
		"@F{fc=c4}1、副本掉落（例如：潛能副本。主要途徑）@B"
		"@F{fc=c4}2、環任務獎勵：“徽章”換取@B"
		"@B"
		"@F{fc=c39}法寶產出途徑：@B"
		"@F{fc=c4}1、副本掉落（例如：失落寶藏。）@B"
		"@F{fc=c4}2、天關寶箱產出@B"
		"@F{fc=c4}3、法寶指引任務@B"
		"@B"
		"@F{fc=c39}綠裝產出途徑：@B"
		"@F{fc=c4}1、收集打造材料在NPC處打造（主要途徑）@B"
		"@F{fc=c4}2、收集材料和制作卷軸在神機匣中合成（主要途徑）@B"
		"@F{fc=c4}3、劇情任務@B"
		"@F{fc=c4}4、收集書頁任務@B"
		"@F{fc=c4}5、藍裝換綠裝任務@B"
		"@B",		
	3 : "@F{fc=c39}藥品、強化寵物等輔助道具產出途徑：@B"
		"@F{fc=c4}1、野外殺怪掉落@B"
		"@F{fc=c4}2、副本掉落（例如：神鬼秘境）@B"
		"@F{fc=c4}3、活動產出（例如：兵臨城下）@B"
		"@F{fc=c4}4、劇情、指引任務@B" ,	
}

# 需要彈出物品產出幫助的等級，后面加"u"是為了區別于活動幫助
ShowLevelDatas = ["u1","u25","u37",]