# -*- coding: cp950 -*-
Datas = {
	10 : "恭喜您升到10級，現在您可以去鳳鳴城中心廣場找@L{t='鳳鳴之光($xz{10111227})';m=goto:10111227;cfc=c4;hfc=c3}領取10級升級獎勵了！" ,
	20 : "恭喜您升到20級，現在您可以去鳳鳴城中心廣場找@L{t='鳳鳴之光($xz{10111227})';m=goto:10111227;cfc=c4;hfc=c3}領取20級升級獎勵了！" ,
	30 : "恭喜您升到30級，現在您可以去鳳鳴城中心廣場找@L{t='鳳鳴之光($xz{10111227})';m=goto:10111227;cfc=c4;hfc=c3}領取30級升級獎勵了！" ,
	40 : "恭喜您升到40級，現在您可以去鳳鳴城中心廣場找@L{t='鳳鳴之光($xz{10111227})';m=goto:10111227;cfc=c4;hfc=c3}領取40級升級獎勵了！" ,
	50 : "恭喜您升到50級，現在您可以去鳳鳴城中心廣場找@L{t='鳳鳴之光($xz{10111227})';m=goto:10111227;cfc=c4;hfc=c3}領取50級升級獎勵了！" ,
	0  : "@S{4}您的累計在線時間已達到5小時，可以在鳳鳴廣場的@L{t='鳳鳴之光($xz{10111227})';m=goto:10111227;cfc=c4;hfc=c3}活動大使處獲得在線獎勵！",
}