# -*- coding: cp950 -*-
Datas = {
	'10111208':{
		'50101026':(200,'@S{4}鳳鳴的火銅是打造神兵的好材料，如果你有門路弄到，我%s一個收，有多少要多少。',),
		'50101029':(2830,'@S{4}狩人氏的元氣散具有強大的復原能力，如果你有門路弄到，我%s一個收，有多少要多少。',),
		'50101028':(1482,'@S{4}迎客村的風鳥氏手上的雷羽具有讓人飛天的特殊法力，如果你有門路弄到，我%s一個收，有多少要多少。',),
		'50101030':(4713,'@S{4}青鳥氏的凈魂膏能夠解除萬蠱百毒，如果你有門路弄到，我%s一個收，有多少要多少。',),
		'50101031':(7184,'@S{4}苗人氏的三苗毒蠱號稱天下第一奇毒，如果你有門路弄到，我%s一個收，有多少要多少。',),
		'50101103':(10303,'@S{4}蓬萊仙人煉製的不朽金丹吃後可以長生不老，如果你有門路弄到，我%s金一個收，有多少要多少。',),
		'50101027':(620,'@S{4}板泉鄉秘製的鎮魂酒號稱天下第一，如果你有門路弄到，我%s一個收，有多少要多少。',),
		'50101137':(14133,'@S{4}崑崙族人用萬年積雪寒釀的天階玉液乃天下一絕，如果你有門路弄到，我%s一個收，有多少要多少。',),
	},
	
}

serverDatas = {
	'10111208':{
				'yun_meng_ze_01':'50101030',
				'yun_meng_ze_02':'50101031',
				'zly_ying_ke_cun':'50101028',
				'zly_bi_shi_jian':'50101029',
				'zly_ban_quan_xiang':'50101027',
				'peng_lai':'50101103',
				'kun_lun':'50101137',
				'fengming':'50101026',
				'50101026':'未熔煉的火銅',
				'50101029':'秘製元氣散',
				'50101028':'完整的雷羽',
				'50101027':'百年鎮魂酒',
				'50101031':'三苗毒蠱',
				'50101103':'不朽金丹',
				'50101030':'青鳥凈魂膏',
				'50101137':'天階玉液',
	},
	
}

