# -*- coding: gb18030 -*-

lbs_CArmor = {
	1 : "物理防御 %i",
	2 : "含强化",
	3 : "含认主",
	4 : "法术防御 %i",
	5 : "抵抗沉默 %i",
	6 : "抵抗眩晕 %i",
	7 : "抵抗定身 %i",
	8 : "抵抗睡眠 %i",
	9 : "招架 %i",
	10 : "闪避 %i",
	11 : "降低对方物理命中 %i",
	12 : "降低对方法术命中 %i" ,
	13 : "(集齐激活套装属性)",
	}

lbs_CEquip = {
	1 : "残缺",
	2 : "崭新",
	3 : "完好",
	4 : "半旧",
	5 : "破损",
	6 : "残缺",

	10 : "职业  ",
	11 : "套装属性",
	12 : "(未激活)",
	13 : "镶嵌:",
	14 : "【神器】",
	15 : "已满",
	}

lbs_CEquipMakeScroll = {
	1 : "错误：未找到符合的材料配置",
	2 : "需要材料：",
	3 : "出售单价：",
	4 : "合成后装备:",
	}

lbs_CItemTreasureMap = {
	1 : "唯一",
	2 : "不可出售",
	}

lbs_CLuckyBox = {
	1 : "唯一",
	2 : "不可出售",
	}

lbs_CMarryRing = {
	1 : "唯一",
	2 : "不可出售",
	3 : "剩余冷却时间:",
	4 : "秒",
	}

lbs_CNecklace = {
	1 : "物理防御 %i",
	2 : "含强化",
	3 : "含认主",
	4 : "法术防御 %i",
	5 : "降低对方法术命中 %i",
	}

lbs_CItemBase = {
	1 : "唯一",
	2 : "不可出售",
	3 : "剩余使用时间:",
	4 : "0秒",
	5 : "%s天",
	6 : "%s时",
	7 : "%s分钟",
	8 : "%s秒",
	9 : "物品过了使用期限。",
	}

lbs_CRing = {
	1 : "物理攻击 %i",
	2 : "含强化",
	3 : "含认主",
	4 : "法术攻击 %i",
	}

lbs_CTalisman = {
	1 : "凡品属性",
	2 : "仙品属性",
	3 : "神品属性",
	4 : "法宝技能: %s",
	5 : "技能等级: %s",
	6 : "含强化",
	7 : "破绽属性"
	}

lbs_CWeapon = {
	1 : "物理攻击 %i",
	2 : "含强化",
	3 : "含认主",
	4 : "法术攻击 %i",
	5 : "神器属性"
	}


lbs_CTeleport = {
	1 : "右键点击,传送至:",
	}

lbs_CTeleportCharm = {
	1 : "唯一",
	2 : "不可出售",
	}

lbs_EquipEffects = {
	1 : "体质",
	2 : "智力",
	3 : "力量",
	4 : "敏捷",
	5 : "生命",
	6 : "法力",
	7 : "物理防御",
	8 : "法术防御" ,
	9 : "物理攻击力",
	10 : "法术攻击力",
	11 : "生命恢复速度",
	12 : "法力恢复速度",
	13 : "最小攻击力",
	14 : "最大攻击力",
	15 : "物理命中",
	16 : "法术命中",
	17 : "闪避",
	18 : "物理暴击",
	19 : "法术暴击",
	20 : "招架",
	21 : "招架减伤",
	22 : "物理伤害减免",
	23 : "法术伤害减免",
	24 : "伤害减免",
	25 : "特效触发",
	26 : "物理暴击伤害倍数",
	27 : "法术暴击伤害倍数",
	28 : "降低对方物理命中",
	29 : "降低对方法术命中",
	30 : "抵抗沉默",
	31 : "抵抗眩晕",
	32 : "抵抗定身",
	33 : "抵抗睡眠",
	34 : "抵抗沉默几率",
	35 : "抵抗眩晕几率",
	36 : "抵抗定身几率",
	37 : "抵抗睡眠几率",
	38 : "攻击速度",
	39 : "移动速度",
	40 : "攻击距离",
	41 : "特效触发率",
	42 : "物理暴击率",
	43 : "法术暴击率",
	44 : "物理命中率",
	45 : "法术命中率",
	46 : "武器攻击力",
	47 : "体质",
	48 : "智力",
	49 : "力量",
	50 : "敏捷",
	51 : "生命",
	52 : "法力",
	53 : "物理防御",
	54 : "法术防御",
	55 : "武器攻击力",
	56 : "物理攻击力",
	57 : "法术攻击力",
	58 : "物理攻击力",
	59 : "法术攻击力",
	60 : "生命恢复速度",
	61 : "法力恢复速度",
	62 : "物理伤害减免",
	63 : "法术伤害减免",
	64 : "伤害减免",
	65 : "经验",
	66 : "潜能",
	67 : "移动速度",
	68 : "攻击速度",
	69 : "添加效果:",

	100 : "物理击中(特效)：",
	101 : "法术击中(特效)：",
	102 : "被击中(特效)：",
	103 : "被暴击(特效)：",
	104 : "物理暴击(特效)：",
	105 : "法术暴击(特效)：",
	106 : "增加法术(特效)：",

	107 : "火攻击",
	108 : "玄攻击",
	109 : "雷攻击",
	110 : "冰攻击",
	111 : "火抗",
	112 : "玄抗",
	113 : "雷抗",
	114 : "冰抗",

	115 : "物理被暴击减免",
	116 : "法术被暴击减免",

	117 : "冲锋破绽几率",
	118 : "猛击破绽几率",
	119 : "横扫破绽几率",
	120 : "泰山压顶破绽几率",
	121 : "劲射破绽几率",
	122 : "乱射破绽几率",
	123 : "落日破绽几率",
	124 : "快剑破绽几率",
	125 : "连绵剑破绽几率",
	126 : "追魂夺命破绽几率",
	127 : "火球术破绽几率",
	128 : "电击术破绽几率",
	129 : "风卷残云破绽几率",
	130 : "御敌",
	131 : "破敌",

	}

lbs_kitCasket = {
	1 : "剩余次数",
	}

lbs_Spell_LivingSkill = {
	1 : "采集技能",
	}

lbs_createEffect = {
	1 : "(属性空位)",
	2 : "(灌注属性)",
	}
	
lbs_vehicle = {
	1 : "成长度",
	2 : "饱腹度",
	3 : "天",
	
	}