# -*- coding: UTF-8 -*-

main = {
	'btn_6'		: { 'color' : (255.0, 250.0, 190.0), 'text' : "活跃度排行" },
	'btn_5'		: { 'color' : (255.0, 250.0, 190.0), 'text' : "PK排行" },
	'btn_4'		: { 'color' : (255.0, 250.0, 190.0), 'text' : "家族排行" },
	'btn_3'		: { 'color' : (255.0, 250.0, 190.0), 'text' : "帮会排行" },
	'btn_2'		: { 'color' : (255.0, 250.0, 190.0), 'text' : "财富排行" },
	'btn_1'		: { 'color' : (255.0, 250.0, 190.0), 'text' : "等级排行" },
	'shutBtn'	: { 'color' : (255.0, 248.0, 158.0), 'text' : "关 闭" },
	'lbTitle'	: { 'color' : (255.0, 248.0, 158.0), 'text' : "排行榜" },
	'bankInfo'	: { 'text' : "@F{fc=( 1, 255, 216, 255 )}刷新说明:@F{fc=( 255, 250, 190, 255 )}此排行榜于每天凌晨0：00刷新。" },
	'miNone'	: { 'text' : "无" },
	'miLevel'	: { 'text' : "%s级" },
	'exp_1'		: { 'text': "@F{fc=( 1, 255, 216, 255 )}近来论世杰，@B高低自有别。@B风流出我辈，@B一战显招绝。" },
	'exp_2'		: { 'text': "@F{fc=( 1, 255, 216, 255 )}泰运得天时，@B欣然自无虑。@B腰间缠万贯，@B功名定不虚。" },
	'exp_3'		: { 'text': "@F{fc=( 1, 255, 216, 255 )}江湖风云啸，@B群英竞相较。@B霸主谈何易，@B依剑任逍遥。" },
	'exp_5'		: { 'text': "@F{fc=( 1, 255, 216, 255 )}十步杀一人，@B千里不留行，@B事了拂衣去，@B深藏身与名。" },
	'exp_6'		: { 'text': "@F{fc=( 1, 255, 216, 255 )}蛮荒无所隐，@B归来有英灵。@B来日显身手，@B且看榜上名。" },
}

panel_1 = {
	'opt_5'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "帮会" },
	'opt_4'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "职业" },
	'opt_3'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "等级" },
	'opt_2'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "名称" },
	'opt_1'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "升降" },
	'opt_0'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "排名" },
}

panel_2 = {
	'opt_4'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "帮会" },
	'opt_3'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "总资产" },
	'opt_2'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "名称" },
	'opt_1'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "升降" },
	'opt_0'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "排名" },
}

panel_3 = {
	'opt_6'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "成员数量" },
	'opt_5'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "帮主" },
	'opt_4'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "帮会声望" },
	'opt_3'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "帮会等级" },
	'opt_2'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "帮会" },
	'opt_1'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "升降" },
	'opt_0'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "排名" },
}

panel_5 = {
	'opt_6'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "死亡次数" },
	'opt_5'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "击败次数" },
	'opt_4'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "职业" },
	'opt_3'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "等级" },
	'opt_2'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "名称" },
	'opt_1'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "升降" },
	'opt_0'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "排名" },
}

panel_6 = {
	'opt_6'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "活跃度" },
	'opt_5'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "帮主" },
	'opt_4'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "帮会声望" },
	'opt_3'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "帮会等级" },
	'opt_2'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "帮会名称" },
	'opt_1'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "升降" },
	'opt_0'		: { 'color' : (219.0, 211.0, 180.0), 'text' : "排名" },
}