# -*- coding: UTF-8 -*-

main = {
	'btnTry'		 : { 'color' : (255.0, 248.0, 158.0), 'text' : "试穿/骑" },
	'affirmChecker'	 : { 'color' : (255.0, 248.0, 158.0), 'text' : "购买确认" },
	'btnInc'		 : { 'color' : (255.0, 248.0, 158.0), 'text' : "后一页" },
	'btnDec'		 : { 'color' : (255.0, 248.0, 158.0), 'text' : "前一页" },
	'btnGuide'		 : { 'color' : (255.0, 248.0, 158.0), 'text' : "商城说明" },
	'btnCharge'		 : { 'color' : (255.0, 248.0, 158.0), 'text' : "快速充值" },
	'choiceIngot'	 : { 'color' : (255.0, 248.0, 158.0), 'text' : "选择货币类型:" },
	'typeBtn_0'		 : { 'color' : (255.0, 248.0, 158.0), 'text' : "全部商品" },
	'typeBtn_2'		 : { 'color' : (255.0, 248.0, 158.0), 'text' : "热销商品" },
	'typeBtn_3'		 : { 'color' : (255.0, 248.0, 158.0), 'text' : "天材地宝" },
	'typeBtn_4'		 : { 'color' : (255.0, 248.0, 158.0), 'text' : "灵丹妙药" },
	'typeBtn_6'		 : { 'color' : (255.0, 248.0, 158.0), 'text' : "坐骑商城" },
	'typeBtn_7'		 : { 'color' : (255.0, 248.0, 158.0), 'text' : "珍宠商城" },
	'typeBtn_8'		 : { 'color' : (255.0, 248.0, 158.0), 'text' : "时装广场" },
	'typeBtn_10'	 : { 'color' : (255.0, 248.0, 158.0), 'text' : "镶嵌水晶" },
	'typeBtn_11'	 : { 'color' : (255.0, 248.0, 158.0), 'text' : "元宝交易" },
	'lbTitle'		 : { 'color' : (240.0, 232.0, 110.0), 'text' : "游戏商城", 'charSpace': 2 },
	'buyOneConfirm'	 : { 'text'  : '确定花费%d元宝购买1个%s?'},
	'buyMoreConfirm' : { 'text'  : '确定花费%d元宝购买%d个%s?'},
	'btnBuy'		 : { 'text'  : '购买'},
	'stTips'		 : { 'color' : (0.0, 255.0, 0.0), 'text'  : 'shift+鼠标右键批量购买'},
	'buyConfirm'	 : { 'color' : (240.0, 232.0, 110.0), 'text' : "购买确认" },
	'tab_0'			 : { 'color' : (255.0, 248.0, 158.0), "text": "金元宝商城"},
	'tab_1'			 : { 'color' : (255.0, 248.0, 158.0), "text": "银元宝商城"},	
	'converatio'	 : { "text": "1WGS = 20元宝"},
	'page'			 : { "text": "翻页:"},
	
}

explainwnd = {
	'shutBtn'		 : { 'color' : (255.0, 248.0, 158.0), 'text' : "关 闭" },
	'lbTitle'		 : { 'color' : (237.0, 230.0, 155.0), 'text' : "商城说明", 'charSpace':2 },
	'explain'		 : { 'text': '@F{fc=( 240, 232, 110, 255 )}游戏商城使用说明@B@B@F{fc=( 240, 232, 110, 255 )}金元宝/银元宝@F{fc = ( 255, 250, 208, 255 )}@B@S{4}金元宝和银元宝是游戏中的特殊货币，用来在游戏商城中购买道具。在游戏商城中购买道具只能使用金元宝或银元宝。@B@S{4}金元宝和银元宝的区别在于，金元宝所购买的道具不会立刻与角色绑定，而使用银元宝购买的道具一旦获得即与角色绑定，无法与其他玩家交易。@B@B@F{fc=( 240, 232, 110, 255 )}怎样获得元宝@F{fc = ( 255, 250, 208, 255 )}@B@S{4}金元宝可以通过购买《光宇一卡通》或使用银行卡、声讯卡等方式在光宇游戏充值中心充入光宇币，然后兑换为创世元宝来获得，具体的充值步骤可查看官方充值帮助(http://www.gyyx.cn/pay/PayHelp.aspx)。如果您拥有元宝票，可以直接使用获得金元宝。@B@S{4}银元宝是通过参与官方举行的各种活动获得。@B@B@F{fc=( 240, 232, 110, 255 )}查看元宝数量@F{fc = ( 255, 250, 208, 255 )}@B@S{4}打开您的背包，在神机匣位置与金钱之间，显示有您当前拥有的金元宝和银元宝数量。打开游戏商城，在界面最下方，也显示有金元宝和银元宝的数量，方便您在购买商品时参考。@B@B@F{fc=( 240, 232, 110, 255 )}购买商品@F{fc = ( 255, 250, 208, 255 )}@B@S{4}您可以随时随地在游戏商城中购买商品，各种分类让您可以方便地选择您所需要的商品种类，看到喜欢的时装和骑宠，还可以在试穿功能中查看使用后的外型。@B@S{4}如果您取消了商城窗口右上角的“购买确认”选择，您在购买商品时将不会再出现提示您确定购买商品的窗口。'},
	'explain_big5'	 : { 'text': '@F{fc=( 240, 232, 110, 255 )}游戏商城使用说明@B@B@F{fc=( 240, 232, 110, 255 )}金天币/银天币@F{fc = ( 255, 250, 208, 255 )}@B@S{4}金天币和银天币是游戏中的特殊货币，用来在游戏商城中购买道具。在游戏商城中购买道具只能使用金天币或银天币。@B@S{4}金天币和银天币的区别在于，金天币所购买的道具不会立刻与角色绑定，而使用银天币购买的道具一旦获得即与角色绑定，无法与其他玩家交易。@B@B@F{fc=( 240, 232, 110, 255 )}怎样获得天币@F{fc = ( 255, 250, 208, 255 )}@B@S{4}金天币可以透过在全省各大便利超商、3C通路卖场所购买《实体WGS点数卡》获得，亦可透过信用卡、网路ATM、邮政划拨、小额付费、ATM转账……等付款方式轻松购买《虚拟WGS点数》以兑换成金天币。详细内容清参阅官网(http://PL.wayi.com.tw)。如果您拥有天币票，可以直接使用获得金天币。@B@S{4}银天币是通过参与官方举行的各种活动获得。@B@B@F{fc=( 240, 232, 110, 255 )}查看天币数量@F{fc = ( 255, 250, 208, 255 )}@B@S{4}打开您的背包，在神机匣位置与金钱之间，显示有您当前拥有的金天币和银天币数量。打开游戏商城，在界面最下方，也显示有金天币和银天币的数量，方便您在购买商品时参考。@B@B@F{fc=( 240, 232, 110, 255 )}购买商品@F{fc = ( 255, 250, 208, 255 )}@B@S{4}您可以随时随地在游戏商城中购买商品，各种分类让您可以方便地选择您所需要的商品种类，看到喜欢的时装和骑宠，还可以在试穿功能中查看使用后的外型。@B@S{4}如果您取消了商城窗口右上角的“购买确认”选择，您在购买商品时将不会再出现提示您确定购买商品的窗口。'}
}

FittingPanel = {
	'shutBtn'		 : { 'color' : (255.0, 248.0, 158.0), 'text' : "关 闭" },
	'lbTitle'		 : { 'color' : (237.0, 230.0, 155.0), 'text' : "试 衣 间" },
}

ybPanel = {
	'btn_0'			:{ 'color' : (255.0, 248.0, 158.0), 'text' : "寄售列表"},
	'btn_1'			:{ 'color' : (255.0, 248.0, 158.0), 'text' : "求购列表"},
	'btn_2'			:{ 'color' : (255.0, 248.0, 158.0), 'text' : "订单发布"},
	'btn_3'			:{ 'color' : (255.0, 248.0, 158.0), 'text' : "交易记录"},
	'btn_4'			:{ 'color' : (255.0, 248.0, 158.0), 'text' : "订单操作"},
	'btnFresh'		:{ 'color' : (255.0, 248.0, 158.0), 'text' : "刷新"},
	'btnBuy'		:{ 'color' : (255.0, 248.0, 158.0), 'text' : "购买元宝"},
	'btnSell'		:{ 'color' : (255.0, 248.0, 158.0), 'text' : "出售元宝"},
}
TranstPanel = {
	'colBtn_0'		:{ 'color' : (255.0, 248.0, 158.0), 'text' : "订单号"},
	'colBtn_1'		:{ 'color' : (255.0, 248.0, 158.0), 'text' : "单价(铜/100金元宝)"},
	'colBtn_2'		:{ 'color' : (255.0, 248.0, 158.0), 'text' : "金元宝总量"},
	'colBtn_3'		:{ 'color' : (255.0, 248.0, 158.0), 'text' : "剩余时间"},
	'remainDays'	:{ 'color' : (255.0, 248.0, 158.0), 'text' : "%d天%d小时"},
	'remainHours'	:{ 'color' : (255.0, 248.0, 158.0), 'text' : "%d小时%d分钟"},
	'remainMins'	:{ 'color' : (255.0, 248.0, 158.0), 'text' : "%d分钟"},
}
ReleasePanel = {
	'sellSetting'	:{ 'color' : (255.0, 248.0, 158.0), 'text' : "寄售元宝设置"},
	'sellUnit'		:{ 'color' : (255.0, 248.0, 158.0), 'text' : "寄售单价"},
	'sellNumber'	:{ 'color' : (255.0, 248.0, 158.0), 'text' : "寄售数"},
	'totalText'		:{ 'color' : (255.0, 248.0, 158.0), 'text' : "总计金额"},
	'feeText'		:{ 'color' : (255.0, 248.0, 158.0), 'text' : "手续费"},
	'totalIncome'	:{ 'color' : (255.0, 248.0, 158.0), 'text' : "总计收入"},
	'tradeTime'		:{ 'color' : (255.0, 248.0, 158.0), 'text' : "挂单时间72小时(3天)"},
	'confirmSell'	:{ 'color' : (255.0, 248.0, 158.0), 'text' : "确认寄售"},
	'totalExpend'	:{ 'color' : (255.0, 248.0, 158.0), 'text' : "总计支出"},
	'confirmBuy'	:{ 'color' : (255.0, 248.0, 158.0), 'text' : "确认求购"},
	'buyUnit'		:{ 'color' : (255.0, 248.0, 158.0), 'text' : "求购单价"},
	'buyNumber'		:{ 'color' : (255.0, 248.0, 158.0), 'text' : "求购数"},
	'tradeAccount'	:{ 'color' : (255.0, 248.0, 158.0), 'text' : "元宝交易账户"},
	'accountMoney'	:{ 'color' : (255.0, 248.0, 158.0), 'text' : "账户游戏币"},
	'accountGold'	:{ 'color' : (255.0, 248.0, 158.0), 'text' : "账户金元宝"},
	'btnWithdraw'	:{ 'color' : (255.0, 248.0, 158.0), 'text' : "取出"},
	'buySetting'	:{ 'color' : (255.0, 248.0, 158.0), 'text' : "购买元宝设置"},
	'rateText'		:{ 'color' : (255.0, 248.0, 158.0), 'text' : " x100"},

}
DetailsPanel = {
	'colBtn_0'		:{ 'color' : (255.0, 248.0, 158.0), 'text' : "订单号"},
	'colBtn_1'		:{ 'color' : (255.0, 248.0, 158.0), 'text' : "类型"},
	'colBtn_2'		:{ 'color' : (255.0, 248.0, 158.0), 'text' : "数量(金元宝)"},
	'colBtn_3'		:{ 'color' : (255.0, 248.0, 158.0), 'text' : "单价(铜/100金元宝)"},
	"colBtn_release":{ 'color' : (255.0, 248.0, 158.0), 'text' : "发布时间"},
	'colBtn_trade'	:{ 'color' : (255.0, 248.0, 158.0), 'text' : "交易时间"},
	'btnDraw'		:{ 'color' : (255.0, 248.0, 158.0), 'text' : "撤销订单"},
	'dateText'		:{ 'color' : (255.0, 248.0, 158.0), 'text' : "%d月%d日%d时%d分"},
	'freshWarning'	:{ 'text': "您刷新过快，每次刷新时间间隔至少10秒。"},
}
TranstBox = {
	'orderNumer'	:{ 'color' : (255.0, 248.0, 158.0), 'text' : "订单号"},
	'buyTitle'		:{ 'color' : (255.0, 248.0, 158.0), 'text' : "购买元宝"},
	'sellUnit'		:{ 'color' : (255.0, 248.0, 158.0), 'text' : "出售单价"},
	'sellNumber'	:{ 'color' : (255.0, 248.0, 158.0), 'text' : "出售数量"},
	'inputBuy'		:{ 'color' : (255.0, 248.0, 158.0), 'text' : "输入购买数量"},
	'totalExpend'	:{ 'color' : (255.0, 248.0, 158.0), 'text' : "总共需要支付"},
	'sellTitle'		:{ 'color' : (255.0, 248.0, 158.0), 'text' : "出售元宝"},
	'buyUnit'		:{ 'color' : (255.0, 248.0, 158.0), 'text' : "求购单价"},
	'buyNumber'		:{ 'color' : (255.0, 248.0, 158.0), 'text' : "求购数量"},
	'inputSell'		:{ 'color' : (255.0, 248.0, 158.0), 'text' : "输入出售数量"},
	'totalIncome'	:{ 'color' : (255.0, 248.0, 158.0), 'text' : "总共可以获得"},
	'cancel'			:{ 'color' : (255.0, 248.0, 158.0), 'text' : "取消"},
	'unit'			:{ 'color' : (255.0, 248.0, 158.0), 'text' : "x100"},
}