# -*- coding: cp950 -*-
# 注意：每一行的字符數控制在25個中文字符（一個中文字符頂兩個英文字符）以內，否則界面顯示會越界

Datas = {
	1 : "@F{fc=(0,255,0)}0~25熟練度提升：在鳳鳴野外采集一級資源@B@F{fc=(255,255,0)}26~50熟練度提升：在飛來石區域采集二級資源",
	2 : "@F{fc=(0,255,0)}51~75熟練度提升：在九河渡區域采集三級資源@B@F{fc=(255,255,0)}76~100熟練度提升：在留仙臺區域采集四級資源",
	3 : "@F{fc=(0,255,0)}101~150熟練度提升：在避世澗區域采集五級資源@B@F{fc=(255,255,0)}151~200熟練度提升：在青鳥邑區域采集六級資源",
	4 : "@F{fc=(0,255,0)}201~350熟練度提升：在巫苗寨區域采集七級資源@B@F{fc=(255,255,0)}351~500熟練度提升：在蓬萊區域采集八級資源",
	5 : "@F{fc=(0,255,0)}501~850熟練度提升：在昆侖區域采集九級資源@B@F{fc=(255,255,0)}851~1200熟練度提升：在后續地圖區域采集十級資源",
	}