# -*- coding: UTF-8 -*-
Datas = {
	'劍客':'爆發力驚人，舞雙劍沖鋒陷陣，關鍵時能用法術致命一擊。@B@B優勢：爆發力強；能夠無視防御和抗性有效打擊敵人@B弱點：持續攻擊力不足，輸出不穩定',
	'祭師':'擁有福澤全隊的強大精神力，是活躍在殺戮戰場上的生命之光。@B@B優勢：能夠使用各種增益和恢復能力@B弱點：攻擊力較弱；如果缺乏隊友的保護，則生存能力較弱',
	'法師':'掌握著自然界的奧秘，擅用各種法術援友襲敵。@B@B優勢：擁有遠程優勢，攻擊力和戰鬥續航力強，可同時攻擊多個敵人。@B弱點：防御與血量較低。',
	'巫師':'擁有致命詛咒和毒素法術，殺人無形，是敵人的頭號噩夢。@B@B優勢：爆發力強，在PK中可能秒殺各種血少職業；是唯一擁有解除狀態的反控製技能的職業。@B@B弱點：各方面比較平均，沒有控製技能，持續性攻擊力不足。',
	'射手':'洞穿一切的雙眼，是老練的斥候和恐怖殺手。@B@B優勢：@B擁有遠程優勢；高命中、高傷害、攻擊效果多樣。@B弱點：防御與血量較低，不擅於近身搏鬥。',
	'戰士':'鋼鐵般的身軀和堅強的意誌使得戰士成為戰場上的最佳戰友。@B@B優勢：擁有所有職業中最高的防御力和很多控製技能。@B弱點：行動較為遲緩，攻擊力一般，法術抗性較低。',
}

