# -*- coding: gb18030 -*-

Datas = {	"chiyou":{"info":"钢铁般的身躯和坚强的意志使得战士成为战场上的最佳战友。拥有所有职业中最高的防御力和很多控制技能。","skills":[323077001, 323078001, 323079001, 323076001]},
		"huangdi":{"info":"爆发力惊人，舞双剑冲锋陷阵，关键时能用法术致命一击。爆发力强；能够无视防御和抗性有效打击敌人。","skills":[323081001, 323080001, 323083001, 323082001]},
		"houyi":{"info":"洞穿一切的双眼，是老练的斥候和恐怖杀手。拥有远程优势,高命中、高伤害、攻击效果多样。","skills":[323084001, 323075001, 323085001, 323086001]},
		"nuwo":{"info":"掌握着自然界的奥秘，擅用各种法术援友袭敌。拥有远程优势，攻击力和战斗续航力强，可同时攻击多个敌人。","skills":[323087001, 323088001, 323089001, 323073001]}
	}