# -*- coding: UTF-8 -*-
Datas = {
	32:{
		'faceNum':(1000000,1000001,1000002,1000003,),'hairNum':(1010000,1010001,1010002,1010003,),'hairName':('酷炫型','成熟型','冷漠型','冷酷型',),'faceName':('刚毅型','冷酷型','英俊型','热血型',),
	},
	48:{
		'faceNum':(2000000,2000001,2000002,2000003,),'hairNum':(2010000,2010001,2010002,2010003,),'hairName':('时尚型','酷炫型','文雅型','冷漠型',),'faceName':('英俊型','冷酷型','文雅型','热血型',),
	},
	33:{
		'faceNum':(1000004,1000005,1000006,1000007,),'hairNum':(1010004,1010005,1010006,1010007,),'hairName':('可爱型','淑女型','性感型','活泼型',),'faceName':('智慧型','妩媚型','活泼型','温柔型',),
	},
	65:{
		'faceNum':(4000004,4000005,4000006,4000007,),'hairNum':(4010004,4010005,4010006,4010007,),'hairName':('淑女型','活泼型','可爱型','文静型',),'faceName':('柔情型','妩媚型','可爱型','活泼型',),
	},
	49:{
		'faceNum':(2000004,2000005,2000006,2000007,),'hairNum':(2010004,2010005,2010006,2010007,),'hairName':('活泼型','成熟型','性感型','可爱型',),'faceName':('柔情型','妩媚型','可爱型','活泼型',),
	},
	64:{
		'faceNum':(4000000,4000001,4000002,4000003,),'hairNum':(4010000,4010001,4010002,4010003,),'hairName':('复古型','文雅型','冷漠型','酷炫型',),'faceName':('英俊型','冷酷型','刚毅型','文雅型',),
	},
	16:{
		'faceNum':(3000000,3000001,3000002,3000003,),'hairNum':(3010000,3010001,3010002,3010003,),'hairName':('民族型','酷炫型','冷漠型','火热型',),'faceName':('英俊型','冷酷型','刚毅型','热血型',),
	},
	17:{
		'faceNum':(3000004,3000005,3000006,3000007,),'hairNum':(3010004,3010005,3010006,3010007,),'hairName':('文静型','活泼型','性感型','可爱型',),'faceName':('智慧型','刚毅型','活泼型','温柔型',),
	},
	
}

