# -*- coding: UTF-8 -*-

Datas = {
# GameMgr.py( 0x0000～0x0020 )
0x0000 : "你确实要退出游戏吗？",
0x0001 : "请用 Launcher.exe 登录游戏！",

# LoginMgr.py（0x0021～0x0060）
0x0021 : "登录失败: %s",
0x0022 : "登录失败: 未知错误: ( %d, %d )",
0x0023 : "你的账号已经被封锁，封存时间为%s！",
0x0024 : "永久",
0x0025 : "%Y年%m月%d日%H时%M分%S秒",
0x0031 : "The connection could not be initiated as either the client was already connected to a server!",
0x0032 : "登录成功。",
0x0033 : "无法连接到服务器。",
0x0034 : "无法连接到服务器。",
0x0035 : "CLIENT ERROR: An unknown client-side error has occurred.",
0x0036 : "客户端主动取消登录。",
0x0037 : "CLIENT ERROR: The client is already online locally (i.e. exploring a space offline).",
0x0038 : "非法登录数据。",
0x0039 : "版本不匹配，请升级到最新版本。",
0x003a : "帐号或密码不正确。",
0x003b : "帐号或密码不正确。",
0x003c : "此帐号已登录。",
0x003d : "版本不匹配，请升级到最新版本。",
0x003e : "服务器未启动（1, -70）。",
0x003f : "服务器未启动（1, -71）。",
0x0040 : "帐号或密码不正确。",
0x0041 : "服务器未启动（1, -73）。",
0x0042 : "SERVER ERROR: The updater is not ready yet.",
0x0043 : "服务器未启动（1, -75）。",
0x0044 : "服务器负载过重，请稍后再试(1, -76)。",
0x0045 : "服务器繁忙，请稍后再试(1, -77)。",
0x0046 : "服务器未启动（1, -78）。",
0x0047 : "服务器负载过重(1, -79)。",
0x0048 : "服务器未启动(1, -80)。",
0x0049 : "账号已被 GM 托管！",
0x004a : "自动激活队列已满，请稍后再试。",
0x004b : "登录成功，开始接受数据（2, 1）。",
0x004c : "从服务器断开（6, 1）。",
0x0050 : "名字长度不能超过 14 个字节",
0x0051 : "您输入的用户名无效，请重新输入",
0x0052 : "名称不合法！",
0x0053 : "输入的名字有禁用词汇！",
0x0054 : "存在角色数量已经达到上限！",

# FamilyInterface.py（0x0061～0x0080）
0x0061 : "你确认要花费20金币争夺该NPC吗?",
0x0062 : "您真的要放弃对这个NPC占领么？如果放弃，贵家族将不再占领任何NPC！",

# HyperlinkMgr.py（0x0081～0x00a0）
0x0081 : "是否使用引路蜂传送?",
0x0082 : "是否同意收对方为徒?",

# ItemsBag.py（0x00a1～0x00c0）
0x00a1 : "您的骑宠技能已满，是否随机替换其中一个技能？",
0x00a2 : "装备后将绑定，是否装备？",
0x00a3 : "强制解锁背包需要%s，解锁后密码将被清空，你确定要申请吗？",
0x00a4 : "特殊合成后的物品将与您绑定，是否继续？",
0x00a5 : "认主后此件装备将绑定，绑定后不可交易，确定认主吗?",
0x00a6 : "孵化后若重新封灵需要消耗符文石，确定要孵化?",
0x00a7 : "释灵后若重新封灵需要消耗符文石，确定要释灵？",

# Const.py（0x00c1～0x00e0）
0x00c1 : "你确定要将正在出战的宠物进行还童操作么？",
0x00c2 : "使用忘忧丹会让你的宠物遗忘所有技能，真的要这样做么？",
0x00c3 : "是否确定使用潜能天书？",
0x00c4 : "确定要将正在出战的宠物进行还童操作么？还童后宠物和其天赋技能都将变为1级，主动技能也会有损失！",
0x00c5 : "您确认要使用北冥炉遗忘所有技能么？",
0x00c6 : "是否使用天工槌修理所有装备？",
0x00c7 : "您已经没有可用的归命符箓，是否从商城购买？",
0x00c8 : "是否使用司辰沙漏？",
0x00c9 : "要延长司辰沙漏的时间么？",
0x00ca : "您已经没有可用的天工槌，是否从商店购买？",
0x00cb : "确定要将正在出战的宠物进行洗髓操作么？洗髓后宠物和其天赋技能都将变为1级，主动技能也会有损失！",

# LivingSystem.py（0x00e1～0x0100）
0x00e1 : "是否确认遗忘%s技能（等级%i）？",
0x00e2 : "是否花费%s将%s技能升级到%s？",
0x00e3 : "是否要遗忘%s？一旦遗忘，熟练度将会清空，请三思！",

# love3.py（0x0101～0x0120）
0x0101 : "游戏资源数据损坏，请重新安装游戏客户端。(1)",
0x0102 : "游戏资源数据损坏，请重新安装游戏客户端。(2)",
0x0103 : "版本不匹配，请升级到最新版本。",

# Role.py（0x0121～0x0140）
0x0121 : "真的要花费%s捐献么？",
0x0122 : "是否花费1金币来保存奖励时间？",
0x0123 : "冻结的劲舞时间无法保持到下一天，请问您是否确认冻结。",
0x0124 : "你所登录的场景已经满员了，请稍后登陆。",
0x0125 : "%s邀请您进行切磋。",
0x0126 : "游戏资源数据损坏，请重新安装游戏客户端",
0x0127 : "是否使用凤凰引原地复活？",
0x0128 : "%s在%s遭遇劫镖，是否前去协助？",
0x0129 : "%s正在帮会城战，邀请你前往协助",
0x012a : "您身上有伤，是否坚持邀请切磋？",
0x012b : "您身上有伤，是否坚持接受切磋？",
0x012c : "骑宠当前等级经验值将重置为0，是否继续？",
0x012d : "我将施展[%s]将您传送到%s处，准备好了吗?",

# RoleRelation.py（0x0141～0x0160）
0x0141 : "[%s]希望加你为好友一起游戏，您是否同意？",
0x0142 : "如果删除了友好关系好友度也会清除，真的要和[%s]决裂么？",
0x0143 : "是否删除黑名单[%s]？",
0x0144 : "%s 邀请你成为恋人，你是否接受？",
0x0145 : "%s 邀请你成为夫妻，你是否接受？",
0x0146 : "是否同意离婚",
0x0147 : "单方面的强制离婚可马上生效，但需要付出50金的离婚手续费，你确定要离吗？",
0x0148 : "是否解除与%s的师徒关系?",
0x0149 : "%s希望能拜你为师，接受你的教导，你是否接受？",
0x014a : "结拜需要大家组队，并且由队长交纳%i金和结拜仪式必要的黄纸、桃花酒。是否要结拜？",
0x014b : "更改结拜称号需要结拜的所有兄弟一起组队，并且交纳%i金手续费，真的要更改结拜称号么？",
0x014d : "结拜增加新成员需要原有所有人和新人组队，并且由队长交纳%i金和结拜仪式必要的黄纸、桃花酒。是否要结拜？",
0x014e : "结拜称号改名",
0x014f : "名字长度不能超过 14 个字节",
0x0150 : "您输入的用户名无效，请重新输入。",
0x0151 : "结拜称号只能由汉字和字母组成！",
0x0152 : "名称不合法！",
0x0153 : "输入的名字有禁用词汇!",
0x0154 : "多年情义就这样完结，你真的想好了么？真的要解除结拜关系么？",
0x0155 : "您的徒弟%s希望您到他的身边，是否接受召唤？",
0x0156 : "%s希望成为你的师父，你是否接受？",

# StatusMgr.py（0x0161～0x0180）
0x0161 : "服务器断开，请重新登录！",
0x0162 : "提示",
0x0163 : "伺服器已断线，请重新登入",

# Team.py（0x0181～0x01a0）
0x0181 : "您的队员%s欲邀请%s加入队伍，您是否同意？",
0x0182 : "你已不在该副本的队伍中，将在%s秒后离开此副本。点击确定可以立刻离开。",
0x0183 : "是否要跟随队长行动?",
0x0184 : "如果选择解散队伍，所有人将被传送出副本，副本关闭。您确定要解散队伍么？",
0x0185 : "如果选择离开队伍，你将会被传送出副本。确定要离开队伍吗？",
0x0186 : "如果你将该队友踢出队伍，他将会被传送出副本。你确定要这样做吗？",

# FamilyFacade.py（0x01a1～0x01c0）
0x01a1 : "%s邀请你加入%s家族, 是否接受?",
0x01a2 : "族长使用了集结令.你愿意跟随族长吗?",

# TongFacade.py（0x01c1～0x01e0）
0x01c1 : "【%s】邀请您加入其帮会【%s】一同开天辟地，降妖除魔。您是否愿意？",
0x01c2 : "%s帮会邀请你的帮会结为同盟, 是否接受?",
0x01c3 : "帮主使用了集结令.你愿意跟随帮主吗?",
0x01c4 : "%s帮会邀请贵帮成为帮会夺城战中的战斗盟友，一起并肩战斗成就大业！%s",

# AntiRabotWindow.py（0x01e1～0x0200）
0x01e1 : "请先点击选出不相同的形状！",

# BigMap.py（0x0201～0x0220）
0x0201 : "该地图暂时没开放！",
0x0202 : "你当前所在的区域不允许查看地图",

# bigmap\NPCLister.py（0x0221～0x0240）
0x0221 : "请输入要搜索的 NPC 名字！",
0x0222 : "NPC：%s 不存在！",
0x0223 : "请选择一个 NPC！",

# chatwindow\ChatLogViewer.py（0x0241～0x0260）
0x0241 : "聊天记录已成功保存到%s文件中。",
0x0242 : "保存文件失败！%s",
0x0243 : "文件%s已存在，是否覆盖？",
0x0244 : "名字已经存在！",

# chatwindow\rolebroadcaster\Sender.py（0x0261～0x0270）
0x0261 : "请输入广播信息",

# chatwindow\playmatechat\PLMChatWindow.py（0x0271～0x0280）
0x0271 : "%s不是您的好友，不能进行好友聊天！",

# commissionsale\ModelPanel.py（0x0281～0x02a0）
0x0281 : "创建模型失败！",

# commissionviewer\GoodsPanel.py（0x02a1～0x02c0）
0x02a1 : "等级上限不能低于等级下限，请重新输入！",
0x02a2 : "您的金钱不足以购买该物品！",

# commissionviewer\PetPanel.py（0x02c1～0x02e0）
0x02c1 : "等级上限不能低于等级下限，请重新输入！",
0x02c2 : "您的金钱不足以购买该宠物！",

# commissionsale\pointcardwindow\PCSellWindow.py（0x02e1～0x0300）
0x02e1 : "密码不能为空！",
0x02e2 : "点卡未定价！",
0x02e3 : "您输入的卡号不正确，请核实后再输入！",

# tishouwindow\sellwindow\GoodsPanel.py（0x0301～0x0320）
0x0301 : "请先暂停寄售再进行该操作！",
0x0302 : "价格超出了上限！",
0x0303 : "该物品不允许出售!",
0x0304 : "该物品还没有定价!",
0x0305 : "寄售界面已装满!",

# tishouwindow\sellwindow\PetsPanel.py（0x0321～0x0340）
0x0321 : "您的宠物携带数量已满。",
0x0322 : "价格超出了上限！",
0x0323 : "未找到寄售NPC！",
0x0324 : "请先暂停寄售再进行该操作！",
0x0325 : "该宠物还没有定价!",

# TiShouSellWindow.py（0x0341～0x0360）
0x0341 : "未找到替售NPC！",
0x0342 : "您还没有开始寄售物品，是否开始寄售？",

# StuffsPanel.py（0x0361～0x0380）
0x0361 : "确定移除材料%s?",

# StatWindow.py（0x0381～0x03a0）
0x0381 : "是否确定离开战斗？",

# GameQuiz.py（0x03a1～0x03c0）
0x03a1 : "是否确定退出知识问答？",
0x03a2 : "想获得大量经验和潜能吗？知识答题简单又有趣，快点击确定参与吧。",
0x03a3 : "是否需要传送回复活点进行答题？",
0x03a4 : "知识答题活动正在进行，您是否参加活动？",
0x03a5 : "知识答题活动正在进行，是否需要传送回复活点进行答题？",

# KitBag.py（0x03c1～0x03e0）
0x03c1 : "包裹密码已经成功设定，请牢记您的密码",
0x03c2 : "包裹已经成功永久解锁",
0x03c3 : "包裹密码已经成功修改，请牢记您的密码",
0x03c4 : "您输入的密码不正确，请重新输入",
0x03c5 : "背包上锁成功。",
0x03c6 : "背包解锁成功。",
0x03c7 : "您已经输入密码错误三次，请稍候再试",
0x03c8 : "成功进行永久开锁，之前的密码已被清空。",
0x03c9 : "给包裹上锁会导致交易取消,确定吗?",
0x03ca : "您输入的旧密码不正确，请重新输入",
0x03cb : "神机匣中有被锁定物品，不能进行该操作。",
0x03cc : "是否确定要遗忘@B%s?",

# kitbag\ObjectItem.py（0x03e1～0x0400）
0x03e1 : "您是否要使用金丝木为你的仓库开启下一个包裹?",
0x03e2 : "确定销毁%s?",
0x03e3 : "你要花费%s购买%s个%s么?",
0x03e4 : "确定花费%d元宝购买%d个%s?",
0x03e5 : "请放入水晶摘除符。",
0x03e6 : "请放入水晶摘除符或者要摘除水晶的装备。",

# kitbag\KitbagItem.py（0x0401～0x0420）
0x0401 : "摆摊时不能使用神机匣功能。",
# kitbag\AritRefine.py
0x0411: "只有50级以上的绿色武器才能炼制神器。",

# knowledgeQandA\QandAWindow.py（0x0421～0x0440）
0x0421 : "您还未答题，是否确定退出？",
0x0422 : "答错了，不要气馁哦，您可以再次回答。",
0x0423 : "退出回答，您需要重新对话开始。",

# MailBox.py（0x0441～0x0460）
0x0441 : "邮件%s含有物品或金钱，确定删除?",
0x0442 : "确定邮寄物品或金钱给%s?",
0x0443 : "请在发件箱中输入邮件内容。",
0x0444 : "您有来自%s的信件, 主题为: %s。",
0x0445 : "您有未查看的信件，请注意查收。",
0x0446 : "您有来自系统的信件, 主题为：%s。",

# MiniMap.py（0x0461～0x0480）
0x0461 : "您低于30级，无法查看商城。",

# Exp2PotWindow.py（0x0481～0x04a0）
0x0481 : "确定要将%d点经验兑换成%d点潜能吗?",

# UnchainPrentice.py（0x04a1～0x04c0）
0x04a1 : "你是否要解除徒弟%s",

# PetCombine.py（0x04c1～0x04e0）
0x04c1 : "必须选择一个材料宠物！",

# PetModelRender.py（0x04e1～0x0500）
0x04e1 : "创建模型失败！",

# PetPanel.py（0x0501～0x0520）
0x0501 : "确定把宠物%s放生?",

# VehicleRender.py（0x0521～0x0540）
0x0521 : "创建模型失败！",
0x0522 : "骑宠模型\'%i\'不存在！",

# PetTrade.py（0x0541～0x0560）
0x0541 : "%s请求与你宠物交易",
0x0542 : "取消交易",

# TalismanModelRender.py（0x0561～0x0580）
0x0561 : "创建模型失败！",
0x0562 : "法宝模型不存在！",

# QuestList.py（0x0581～0x05a0）
0x0581 : "是否放弃任务%s?",
0x0582 : "你被邀请参与帮会运镖任务，你是否接受？",
0x0583 : "是否继续已保存的环任务？",

# relationship\family\AfficheEdit.py（0x05a1～0x05e0）
0x05a1 : "家族公告必须在1000字节内",
0x05a2 : "输入的内容有禁用词汇!",

# relationship\family\FamilyPanel.py（0x05e1～0x0600）
0x05e1 : "确定将%s请出家族？",

# relationship\family\MenuItem.py（0x0601～0x0620）
0x0601 : "确定提升%s为家族族长?",
0x0602 : "确定解散家族：%s?",
0x0603 : "确定退出家族：%s?",

# relationship\family\ChangeNameBox.py（0x0621～0x0640）
0x0621 : "名字长度不能超过 14 个字节",
0x0622 : "您输入的用户名无效，请重新输入。",
0x0623 : "家族名称只能由汉字和字母组成！",
0x0624 : "名称不合法！",
0x0625 : "输入的名字有禁用词汇!",

# relationship\family\FoundFamily.py（0x0641～0x0660）
0x0641 : "对不起，你已经有一个家族了。",
0x0642 : "名字长度不能超过 14 个字节",
0x0643 : "您输入的用户名无效，请重新输入。",
0x0644 : "家族名称只能由汉字和字母组成！",
0x0645 : "名称不合法！",
0x0646 : "输入的名字有禁用词汇!",
0x0647 : "对不起，创建家族至少需要10金币,您的金钱不足。",
0x0648 : "对不起，创建家族需要至少30级。",

# relationship\relationship\RelationPanel.py（0x0661～0x0680）
0x0661 : "是否确定将玩家%s添加进好友名单?",
0x0662 : "是否确定将玩家%s加为恋人?",
0x0663 : "是否确定将玩家%s添加进不友好目标列表?",
0x0664 : "是否确定将玩家%s添加进黑名单?",
0x0665 : "是否确认删除恋人:%s?",
0x0666 : "是否确认删除不友好目标:%s?",

# relationship\RelationWindow.py（0x0681～0x06a0）
0x0681 : "您还没有家族",
0x0682 : "你还没有帮会",
0x0683 : "每周只能领取一次俸禄，是否确定现在领取？",

# relationship\tong\AffichePanel.py（0x06a1～0x06c0）
0x06a1 : "帮会公告必须在200字节内",
0x06a2 : "输入的内容有禁用词汇!",

# relationship\tong\ManagerPanel.py（0x06c1～0x06e0）
0x06c1 : "确定将%s请出帮会？",
0x06c2 : "帮会没有该成员！",
0x06c3 : "不能添加自己帮会为同盟！",
0x06c4 : "已存在该同盟帮会！",
0x06c5 : "没有该同盟帮会！",
0x06c6 : "确定与%s帮会解除同盟关系？",

# relationship\tong\MenuItem.py（0x06e1～0x0700）
0x06e1 : "必须先将帮主职位转让给帮会里的其他成员，才可以退出帮会。",
0x06e2 : "确定退出帮会：%s?",
0x06e3 : "确定将帮主之位让给%s?",
0x06e4 : "[%s]曾为帮会立下汗马功劳，您真的要开除他么？",

# relationship\tong\ChangeNameBox.py（0x0701～0x0720）
0x0701 : "名字长度不能超过 14 个字节",
0x0702 : "您输入的帮会名无效，请重新输入。",
0x0703 : "名称不合法！",
0x0704 : "帮会名称只能由汉字和字母组成！",
0x0705 : "输入的名称有禁用词汇!",

# relationship\tong\DutyPanel.py（0x0721～0x0740）
0x0721 : "备注不能超过7个字符!",
0x0722 : "输入的备注有禁用词汇!",

# relationship\tong\DutySetting.py（0x0741～0x0760）
0x0741 : "名称长度不能超过 10 个字节",
0x0742 : "您输入的用户名无效，请重新输入。",
0x0743 : "名称不合法！",
0x0744 : "输入的名字有禁用词汇!",
0x0745 : "已存在相同的职务名称!",

# relationship\tong\FoundTong.py（0x0761～0x0780）
0x0761 : "对不起，你已经有一个帮会了。",
0x0762 : "名字长度不得超过7个汉字或14个英文字母",
0x0763 : "您输入的用户名无效，请重新输入。",
0x0764 : "名称不合法！",
0x0765 : "帮会名称只能由汉字和字母组成！",
0x0766 : "输入的名称有禁用词汇!",
0x0767 : "对不起，创建帮会至少需要30金币,您的金钱不足。",
0x0768 : "对不起，创建帮会需要至少45级。",

# rolestrading\TradingWindow.py（0x0781～0x07a0）
0x0781 : "取消交易",
0x0782 : "%s请求与你交易",

# specialshop\FittingModelRender.py（0x07a1～0x07c0）
0x07a1 : "创建模型失败！",
0x07a2 : "骑宠模型\'%i\'不存在！",

# specialshop\SpecialItem.py（0x07c1～0x07e0）
0x07c1 : "确定花费%d元宝购买%d个%s?",

# specialshop\SpecialShop.py（0x07e1～0x0800）
0x07e1 : "游戏商城正在更新，商城界面需关闭。",
0x07e2 : "确定花费%d元宝购买%s?",
0x07e3 : "你确定要撤销该求购订单吗？",
0x07e4 : "本次挂单将收取%s作为保管费不退还，确定以单价%s/100@I{p=guis/general/specialshop/yuanbao.gui}出售%d@I{p=guis/general/specialshop/yuanbao.gui}?",
0x07e5 : "本次挂单将收取%s作为保管费不退还，确定以单价%s/100@I{p=guis/general/specialshop/yuanbao.gui}求购%d@I{p=guis/general/specialshop/yuanbao.gui}?",
0x07e6 : "寄售单价不能超过250@I{p=guis/controls/goldicon.gui}。",
0x07e7 : "单笔寄售数量不能超过1000x100@I{p=guis/general/specialshop/yuanbao.gui}。",
0x07e8 : "您身上的金元宝不足。",
0x07e9 : "单笔求购数量不能超过1000x100@I{p=guis/general/specialshop/yuanbao.gui}。",
0x07ea : "求购单价不能低于20@I{p=guis/controls/goldicon.gui}。",
0x07eb : "本次操作将取出您的交易系统账户内所有的游戏币，是否确认取出？",
0x07ec : "本次操作将取出您的交易系统账户内所有的金元宝，是否确认取出？",
0x07ed : "你确定要撤销该寄售订单吗？",
0x07ee : "该订单最大出售元宝数量为%d，购买元宝数超过该数量。",
0x07ef : "该订单最大购买元宝数量为%d，出售元宝数超过该数量。",

# storewindow\ItemsPanel.py（0x0801～0x0820）
0x0801 : "您输入的名称无效，请重新输入。",
0x0802 : "名称不合法！",
0x0803 : "输入的名称有禁用词汇！",
0x0804 : "您输入的名称超过8字节，请重新输入。",

# storewindow\StoreItem.py（0x0821～0x0840）
0x0821 : "确定丢弃%s？",

# storewindow\StoreWindow.py（0x0841～0x0880）
0x0841 : "您是否要将钱庄中剩余的存款%d金%d银%d铜全部取出？",
0x0842 : "您需要%d个金丝木才可以获得这一包裹,确定么?",
0x0843 : "是否确定将%d元宝兑换为元宝票?",
0x0844 : "钱庄密码已经成功设定，请牢记您的密码",
0x0845 : "钱庄密码已经成功修改，请牢记您的密码",
0x0846 : "您输入的密码不正确，请重新输入",
0x0847 : "您输入的旧密码不正确，请重新输入",
0x0848 : "钱庄上锁成功。",
0x0849 : "钱庄解锁成功。",
0x084a : "您已经输入密码错误三次，请%s秒后再试",
0x084b : "成功进行永久开锁，之前的密码已被清空。",
0x084c : "一次可兑换的元宝票最大数量为%d。",
0x084d : "一次可兑换的元宝票最小数量为%d。",
0x084e : "要兑换元宝数超过携带元宝数！",

# syssetting\AVPanel.py（0x0881～0x08a0）
0x0881 : "带有*的选项设置后需要重新启动，将于下次客户端运行时生效。",

# syssetting\KeySetter.py（0x08a1～0x08c0）
0x08a1 : "当前已经设置为该按键，重复设置将会清除该设置，是否继续？",
0x08a2 : "按键重复，导致“%s-->%s”快捷键变为未设置。",

# tongabout\BiddingBox.py（0x08c1～0x08e0）
0x08c1 : "请输入数字",
0x08c2 : "帮会可用资金不足。",
0x08c3 : "最低竞拍价格要为10金的整数倍，您的竞价不满足要求。",
0x08c4 : "最低追加竞拍价要为10金的整数倍，您的追加价不满足要求。",

# tongabout\ModelRender.py（0x08e1～0x0900）
0x08e1 : "创建模型失败！",

# tongabout\SkillReSearch.py（0x0901～0x0920）
0x0901 : "你确定研发技能%s?",
0x0902 : "你确定研发%s, 同时放弃正在研发的%s?",

# tongabout\WarIntergral.py（0x0921～0x0940）
0x0921 : "是否确定离开帮会战场？",

# tongabout\tongstorage\StorageItem.py（0x0941～0x0960）
0x0941 : "确定丢弃%s？",

# tongabout\ApplyRobWar.py（0x0961～0x0980）
0x0961 : "名字长度不能超过 14 个字节",
0x0962 : "您输入的帮会名无效，请重新输入。",
0x0963 : "名称不合法！",
0x0964 : "帮会名称只可能由汉字和字母组成！",
0x0965 : "输入的名称有禁用词汇!",

# tongabout\BuildReSearch.py（0x0981～0x09a0）
0x0981 : "该建筑正在升级过程中！",
0x0982 : "你确定升级建筑%s？",
0x0983 : "你确定升级建筑%s，同时取消%s的升级吗？",

# tongabout\ShenShouBeckon.py（0x09a1～0x09c0）
0x09a1 : "该神兽已经存在!",
0x09a2 : "你没有选择神兽的权限!",
0x09a3 : "帮会资金不足,选择或者更换神兽需要%d金帮会资金。",
0x09a4 : "帮会行动力不足,选择或者更换神兽需要%d点帮会行动力。",

# tongabout\TaxRateSetBox.py（0x09c1～0x09e0）
0x09c1 : "税率只能为1%-50%，请输入一个1-50的整数，请重新输入。",

# tongabout\TongQuery.py（0x09e1～0x0a00）
0x09e1 : "对不起，您还没有帮会。",
0x09e2 : "帮会宣传内容不合法！",
0x09e3 : "帮会宣传含有禁用词汇!",
0x09e4 : "帮会宣传必须在40字节内",

# tradewindow\BuyPanel.py（0x0a01～0x0a20）
0x0a01 : "%s，是否确定需要修理?",

# tradewindow\TradeWindow.py（0x0a21～0x0a40）
0x0a21 : "钓鱼中...",

# tradewindow\Repairer.py（0x0a41～0x0a60）
0x0a41 : "该装备不需要修理",
0x0a42 : "请选择需要修理的装备",
0x0a43 : "%s，是否确定修理?",

# vendwindow\buywindow\ItemsPanel.py（0x0a61～0x0a80）
0x0a61 : "你要花费%s购买%s个%s么?",

# vendwindow\buywindow\PurchasePanel.py（0x0a81～0x0aa0）
0x0a81 : "成功出售XXX",
0x0a82 : "确定出售%s个%s？",
0x0a91 : "您没有足够的物品出售！",

# vendwindow\sellwindow\GoodsPanel.py（0x0aa1～0x0ac0）
0x0aa1 : "请先停止摆摊再进行该操作！",
0x0aa2 : "该物品不允许出售!",
0x0aa3 : "该物品还没有定价!",
0x0aa4 : "物品界面已装满!",
0x0aa5 : "价格超出了上限！",
0x0aa6 : "增加此商品会导致出售后您所携带的金钱总量超出上限，增加商品不成功！",

# vendwindow\sellwindow\PurchasePanel.py（0x0ac1～0x0ae0）
0x0ac1 : "该物品不支持收购!",
0x0ac2 : "请先停止摆摊再进行该操作！",
0x0ac3 : "您没有足够的金钱收购物品。",
0x0ac4 : "请先选择一个收购物品!",
0x0ac5 : "收购界面已装满!",
0x0ac6 : "该物品还没有定价!",
0x0ac7 : "界面空位不足!",

# tishouwindow\buywindow\ItemsPanel.py（0x0ae1～0x0b00）
0x0ae1 : "店家还没开始摆摊",
0x0ae2 : "你要花费%s购买%s个%s么?",

# tishouwindow\sellwindow\PurchasePanel.py（0x0b01～0x0b20）
0x0b01 : "未找到寄售NPC！",
0x0b02 : "请先停止寄售再进行该操作！",
0x0b03 : "收购界面已装满!",
0x0b04 : "该物品还没有定价!",
0x0b05 : "界面空位不足!",
0x0b06 : "物品未定价！",
0x0b07 : "你的背包处于上锁状态，请解锁后再进行此操作。",

# loginuis\logindialog\LoginDialog.py（0x0b21～0x0b40）
0x0b21 : "错误的密保卡号!",
0x0b22 : "你输入密保号 %i 次，将重新申请矩阵组，请认准组号重新输入！",

# loginuis\logindialog\LoginDialog.py（0x0b41～0x0b60）
0x0b41 : "确定要放弃排队吗？",
0x0b42 : "已提交您的登入申请。目前你排在第%i位，等待时间少于一分钟。",
0x0b43 : "已提交您的登入申请。目前你排在第%i位，大概需要等待%i分钟。",
0x0b44 : "请输入账号和密码!",
0x0b45 : "找不到 launcher",
0x0b46 : "此功能未开通",

# loginuis\roleselector\RoleSelector.py（0x0b61～0x0b80）
0x0b61 : "角色成功改名为：%s",
0x0b62 : "存在角色数量已经达到上限！",
0x0b63 : "请选择一个角色！",
0x0b64 : "输入错误，删除取消",
0x0b65 : "角色需要改名",

# passwordbox\PasswordOperate.py（0x0b81～0x0ba0）
0x0b81 : "您还没有设置密码",
0x0b82 : "密码必须为4-6位数字",
0x0b83 : "忘记密码请到凤鸣城钱庄的解锁师那里，可以强制解除密码。",

# passwordbox\PasswordSetting.py（0x0ba1～0x0bc0）
0x0ba1 : "密码必须为4-6位数字",
0x0ba2 : "两次输入密码不一致，请重新输入新密码",

# T_SoundSetter.py（0x0bc1～0x0be0）
0x0bc1 : "路径“res/entities/common/tempconfigs”不存在，保存失败",
0x0bc2 : "保存以下事件声音失败：%s原因可能是该控件不支持设置事件声音，请与程序联系！",
0x0bc3 : "保存成功！",
0x0bc4 : "声音 \'%s\' 不存在!",

# T_UIColorTester.py（0x0be1～0x0c00）
0x0be1 : "不是可测试的文本标签（鼠标必须击中一段文本）",

# T_UIModelAdjuster.py（0x0c01～0x0c20）
0x0c01 : "有的模型更改了还没保存，你要保存吗？",
0x0c02 : "保存成功!",
0x0c03 : "保存失败，路径“%s”不存在",
0x0c04 : "@A{C}我是大懒人，网站还没建设好，@B哈哈@I{p=maps/emote/emote_13.gui}",
0x0c05 : "没有可调整的模型",
0x0c06 : "模型观察器不包含“__config”属性，不能调整",

# Account.py（0x0c21～0x0c40）
0x0c21 : "创建角色成功",
0x0c22 : "提示",

# TongInterface.py（0x0c41～0x0c60）
0x0c41 : "[%s]希望加入贵帮，是否同意？",
0x0c42 : "你确定要取消当前会标？",
0x0c43 : "你确定花%s参加该城市帮会夺城战？",
0x0c44 : "请注意领取%s金后帮会资金是否会溢出。",
0x0c45 : "贵帮会是否确认放弃对%s的占领权？",

# helper\Searcher.py（0x0c61～0x0c80）
0x0c61 : "请输入关键字！",
0x0c62 : "找不到相关主题！",
0x0c63 : "找不到相关怪物！",
0x0c64 : "找不到相关任务！",

# npctalk\QuestTalkWindow.py（0x0c81～0x0ca0）
0x0c81 : "请选择一个奖励的物品",

# petswindow\aboutnpc\StorageTenancy.py（0x0ca1～0x0cc0）
0x0ca1 : "金元宝不足",

# petswindow\petpanel\ChangeNamePanel.py（0x0cc1～0x0ce0）
0x0cc1 : "名字长度不得超过7个汉字或14个英文字母",
0x0cc2 : "您输入的用户名无效，请重新输入。",
0x0cc3 : "名称不合法！",
0x0cc4 : "输入的名字有禁用词汇!",

# petswindow\petpanel\PetPanel.py（0x0ce1～0x0d00）
0x0ce1 : "宠物处于战斗中不能放生！",
0x0ce2 : "宠物正在出售，不能放生！",

# petswindow\vehiclepanel\VehiclePanel.py（0x0d01～0x0d20）
0x0d01 : "确定要将骑宠[%s]放生?",
0x0d02 : "放生后骑宠将无法恢复，确认要放生?",
0x0d03 : "是否要为骑宠传功？传功后的潜能将无法回收。",

# playerprowindow\PlayProWindow.py（0x0d21～0x0d40）
0x0d21 : "您未装备法宝",
0x0d22 : "您的经验代练界面尚未激活",

# targetinfo\TargetInfo.py（0x0d41～0x0d60）
0x0d41 : "%s 邀请你共舞，你是否接受？",
0x0d42 : "武道大会第%s轮比赛开始,请尽快进入比赛场地！",
0x0d43 : "想要祈福需要花费%d金，真的要祈福么？",

# teammateinfo\TeammateArray.py（0x0d61～0x0d80）
0x0d61 : "%s 邀请你加入他的队伍，你是否接受？",
0x0d62 : "%s 请求加入你的队伍，你是否同意？",
0x0d63 : "%s 邀请你跟随他，你是否接受？",

# chatwindow\YellVerifyBox.py（0x0d81～0x0da0）
0x0d81 : "在世界频道发言需要耗 %i 银币，确定要发言吗！",

# tongabout\ItemReSearch.py（0x0da1～0x0dc0）
0x0da1 : "你确定生产%s, 同时放弃正在生产的%s？",
0x0da2 : "你确定生产物品%s？",

# tooluis\fixrewardbox\FixRewardBox.py（0x0dc1～0x0de0）
0x0dc1 : "欢迎来到创世，听说新手导师鹏妹妹有事找你呢，正前方头顶问号的就是她啦，快去看看吧。",
0x0dc2 : "领取第%s份礼物",
0x0dc3 : "@B今天您还可以领取%d份礼物。",

# vendwindow\sellwindow\PetsPanel.py（0x0de1～0x0e00）
0x0de1 : "该宠物已是待售宠物！",
0x0de2 : "该宠物还没有定价!",

# vendwindow\sellwindow\SellPanel.py（0x0e01～0x0e20）
0x0e01 : "商品(%s)标价超过上限!",
0x0e02 : "宠物标价超过上限!",
0x0e03 : "你有商品尚未标价!",
0x0e04 : "没有出售或收购的商品!",
0x0e05 : "您没有足够的金钱收购物品!",
0x0e06 : "名字长度不能超过 20个字节！",
0x0e07 : "您输入的名称无效！",
0x0e08 : "名称不合法！",
0x0e09 : "输入的名称有禁用词汇!",

# loginuis\rolecreator\RoleCreator.py（0x0e21～0x0e40）
0x0e21 : "请输入角色名字",
0x0e22 : "@S{6}确定要加入%s? @B@S{6}(一经确定将无法修改)",
0x0e23 : "确定退出阵营选择界面?",
0x0e24 : "确定退出角色创建界面?",

# tools\__init__.py（0x0e41～0x0e50）
0x0e41 : "找不到合适的控件",
0x0e42 : "请首先关闭 %s",

# damagestatic\StatisWindow.py（0x0e51～0x0e60）
0x0e51 : "您希望重置伤害统计数据么？",

# general\tanabata\(0x0e61～0x0e80)
0x0e61 : "请先选择一项",
0x0e62 : "请选择一个好友。",
0x0e63 : "请输入留言内容。",
0x0e64 : "每条留言不得少于10个字符。",
0x0e65 : "要发送消息不合法。",
0x0e66 : "要发送消息含有禁用词汇。",
0x0e67 : "您的投票发送成功。",
# Bank.py( 0x0e81～0x0e90 )
0x0e81 : "强制解锁仓库需要%s，解锁后密码将被清空，你确定要申请吗？",

#general\equipextract\( 0x0ea1～0x0ec0 )
0x0ea1 : "请放入一件装备。",
0x0ea2 : "请至少放入一颗封灵石或超级封灵石。",
0x0ea3 : "灌注的属性不能被抽取，是否继续？",
0x0ea4 : "您的封灵石数量不足，不能把所有属性都抽取，只能随机抽取其中的属性，是否继续？",
0x0ea5 : "使用已绑定的装备抽取属性，所有封灵石都将变为绑定的，是否继续？",
0x0ea6 : "请放入封灵石或超级封灵石。",
0x0ea7 : "封灵石不能混用。",
0x0ea8 : "请放入10级以上且品质在蓝色以上的装备。",
0x0ea9 : "只能放入神征令。神征令可将抽取成功率提高到100%，在副本掉落，也可在道具商城购买到。",
0x0eab : "请放入一个韵灵琥珀。",
0x0eac : "使用已绑定的韵灵琥珀灌注装备，装备将会变为绑定的，是否继续？",
0x0ead : "请放入韵灵琥珀。",
0x0eae : "请放入一个飞升灵玉",
0x0eaf : "使用已绑定的飞升灵玉提升装备品质，装备将会变为绑定的，是否继续？",
0x0eb0 : "您放入的飞升灵玉与装备等级不符",
0x0eb1 : "您放入装备的等级与飞升灵玉不符",
0x0eb2 : "请放入%i级以上的%s装备。",
0x0eb3 : "请放入可以强化且已强化等级不到9的装备。",
0x0eb4 : "请放入龙珠。",
0x0eb5 : "请放入幸运石。",

# PlayerInfo.py( 0x0ec1～0x0ec8 )
0x0ec1 : "您确定新建装备组合，并将现在穿着的装备保存其中么？",
0x0ec2 : "您输入的名称过长。",
0x0ec3 : "只能对已经保存过的组合重新命名。",

# \quickbar\QuickBar.py
0x0ec4 : "@I{p=maps/emote/emote.gui;t=maps/emote/emote_205.texanim;s=32.000000,32.000000}恭喜你升级到20级！从现在起，你可以使用“自动战斗”功能了!",
0x0ec5 : "@I{p=maps/emote/emote.gui;t=maps/emote/emote_205.texanim;s=32.000000,32.000000}恭喜你开启了“自动战斗”功能！",
0x0ec6 : "自动战斗功能还未开放。",

# navigatewnd\NavigateWindow.py( 0x0ec9～0x0ed0 )
0x0ec9 : "未找到“%s”的相关信息！",

# CameraEventMgr( 0x0ed1～0x0ee0 )
0x0ed1 : "是否跳过剧情动画？",

# RoleChallengeInterface.py
0x0ee1 : "组队擂台第%s轮比赛开始,请尽快进入比赛场地！",
0x0ee2 : "个人竞技开始入场,请尽快前往竞技场管理员处进入比赛场地！",
0x0ee3 : "帮会竞技开始入场,请尽快前往竞技场管理员处进入比赛场地！",
0x0ee4 : "组队竞技开始入场，请尽快前往竞技场管理员处进入比赛场地！",
0x0ee5 : "帮会擂台初赛开始,请尽快进入比赛场地！",
0x0ee6 : "帮会擂台四分之一决赛开始,请尽快进入比赛场地！",
0x0ee7 : "帮会擂台半决赛开始,请尽快进入比赛场地！",
0x0ee8 : "帮会擂台决赛开始,请尽快进入比赛场地！",
0x0ee9 : "是否进入观战模式，确定请按是！",
0x0eea : "你已成功被组队擂台招募，是否马上加入？",
0x0eeb : "是否传送到阵营烽火连天副本中，确定请按是！",

# CopySpaceInfo.py
0x0ef1 : "劈山救母",

# GameSettingMgr.py( 0x0f00～0x0f10 )
0x0f00 : "进入该场景将会调整客户端设置以保证视效，是否接受这些改变？\n(放弃将无法看到该场景的全部效果，但不会影响游戏进程)",

# copyteam( 0x0f11～0x0f20 )
0x0f11 : "你必须至少选择一个职务。",
0x0f12 : "你必须至少选择一个副本。",
0x0f13 : "是否加入%s副本，已消灭%d/%d首领？",

# YXLMInterface.py
0x1000 : "匹配完成，请在1分钟内到达旬苞处准备进入副本，单击传送，可以直接传送至旬苞处",
#RobotChoice.py
0x1001 : "不可重复添加相同机器人。",

0x10a0 : "是否确定花费1000元宝召唤%s?",
0x10a1 : "开启至此道心位置，需花费%d元宝。",
0x10a2 : "元宝不够，道心格子解锁失败。",
0x10a3 : "目标道心格子未激活，不能拖放。",
0x10a4 : "道法 %s 将吞噬道法 %s 获得%d经验值。",
0x10a5 : "确定丢弃道法 %s？",
0x10a6 : "一键证道将自动证道直至界面中道法已满或机缘不足，是否继续？",
0x10a7 : "一键合成将出售白色道法并合成全部道法至%s，是否继续？",
0x10a8 : "一键合成将出售全部白色道法，是否继续？",
0x10a9 : "是否锁定道法 %s？",
0x10aa : "是否解锁道法 %s？",
0x10ab : "请选择需要锁定或解锁的道法。",
0x10ac : "一键合成将合成全部道法至%s，是否继续？",
0x10ad : "普通道心栏为空，无法一键合成。",


#RoleQuestInterface.py
0x10ae : "道具刷新将强制放弃已领取悬赏任务，是否继续？",
0x10af : "是否消耗5元宝，额外获得1倍奖励？",

#fising/ControlPanel.py
0x10c0 : "是否要离开捕鱼高手活动？（剩余的炮弹将换算成等值的金币和元宝）",

#RoleYiJieZhanChangInterface.py
0x1100 : "离开战场之后会获得相应的惩罚，战绩也不会保留，您确定离开战场吗？",

#guis.general.highdance
0x11a0 : "您现在的舞王等级较高，获得经验较多。是否确定要挑战低等级舞王？",
0x11a1 : "是否需要离开舞厅？",
0x11a2 : "是否需要练习斗舞？",

0x11b0 : "确定将物品%s分配给帮会成员%s?",
0x11b1 : "帮贡搜索最小值不能大于最大值，请重新输入数值。",

#guis.general.TongAlliance.py
0x11c0 : "请输入246个字符以内。",
0x11c1 : "内容不能为空。",
}


import Language
if Language.LANG == Language.LANG_BIG5:
	Datas[0x0411] = "只有50级以上的橘色武器才能炼制神器。"