# -*- coding: UTF-8 -*-
Datas = {
	'剑客':'@F{fc = ( 255, 241, 217, 255 )}爆发力惊人，舞剑冲锋陷阵，关键时能用法术致命一击。@B@B@F{fc = ( 0, 255, 0, 255 )}优势：@F{fc = ( 255, 241, 217, 255 )}爆发力强；能够无视防御和抗性有效打击敌人@B@F{fc = ( 255, 0, 0, 255 )}弱点：@F{fc = ( 255, 241, 217, 255 )}持续攻击力不足，输出不稳定',
	'祭师':'@F{fc = ( 255, 241, 217, 255 )}拥有福泽全队的强大精神力，是活跃在杀戮战场上的生命之光。@B@B@F{fc = ( 0, 255, 0, 255 )}优势：@F{fc = ( 255, 241, 217, 255 )}能够使用各种增益和恢复能力@B@F{fc = ( 255, 0, 0, 255 )}弱点：@F{fc = ( 255, 241, 217, 255 )}攻击力较弱；如果缺乏队友的保护，则生存能力较弱',
	'法师':'@F{fc = ( 255, 241, 217, 255 )}掌握着自然界的奥秘，擅用各种法术援友袭敌。@B@B@F{fc = ( 0, 255, 0, 255 )}优势：@F{fc = ( 255, 241, 217, 255 )}拥有远程优势，攻击力和战斗续航力强，可同时攻击多个敌人。@B@F{fc = ( 255, 0, 0, 255 )}弱点：@F{fc = ( 255, 241, 217, 255 )}防御与血量较低。',
	'巫师':'@F{fc = ( 255, 241, 217, 255 )}拥有致命诅咒和毒素法术，杀人无形，是敌人的头号噩梦。@B@B@F{fc = ( 0, 255, 0, 255 )}优势：@F{fc = ( 255, 241, 217, 255 )}爆发力强，在PK中可能秒杀各种血少职业；是唯一拥有解除状态的反控制技能的职业。@B@F{fc = ( 255, 0, 0, 255 )}弱点：@F{fc = ( 255, 241, 217, 255 )}各方面比较平均，没有控制技能，持续性攻击力不足。',
	'射手':'@F{fc = ( 255, 241, 217, 255 )}洞穿一切的双眼，是老练的斥候和恐怖杀手。@B@B@F{fc = ( 0, 255, 0, 255 )}优势：@F{fc = ( 255, 241, 217, 255 )}拥有远程优势；高命中、高伤害、攻击效果多样。@B@F{fc = ( 255, 0, 0, 255 )}弱点：@F{fc = ( 255, 241, 217, 255 )}防御与血量较低，不擅于近身搏斗。',
	'战士':'@F{fc = ( 255, 241, 217, 255 )}钢铁般的身躯和坚强的意志使得战士成为战场上的最佳战友。@B@B@F{fc = ( 0, 255, 0, 255 )}优势：@F{fc = ( 255, 241, 217, 255 )}拥有所有职业中最高的防御力和很多控制技能。@B@F{fc = ( 255, 0, 0, 255 )}弱点：@F{fc = ( 255, 241, 217, 255 )}行动较为迟缓，攻击力一般，法术抗性较低。',
}

Teacher_Desc = {
	'战士':( '@B@F{fc = ( 255, 255, 0, 255 )}','战士，师从女娲娘娘，学道于娲皇宫', '战士，师从准提道人，学道于修罗殿'),
	'剑客':( '@B@F{fc = ( 255, 255, 0, 255 )}','剑客，师从元始天尊，学道于玉虚宫', '剑客，师从接引道人，学道于雷音寺'),
	'射手':( '@B@F{fc = ( 255, 255, 0, 255 )}','射手，师从通天教主，学道于碧游宫', '射手，师从魔师鲲鹏，学道于无极殿'),
	'法师':( '@B@F{fc = ( 255, 255, 0, 255 )}','法师，师从太上老君，学道于八景宫', '法师，师从冥河道人，学道于火云宫')	
	
}