# -*- coding: cp950 -*-

BCT_PHFKJS_BEGAIN_0                           = "瘋狂祭師將在10分鐘後潛入帝王古墓二層，勇士們請做好準備。"
BCT_TONGCOMPETITION_END_NOTIFY              = "幫會競技活動已經結束，下一次幫會競技活動歡迎你的參與！"
BCT_WDDH_4TH_WILLBEGIN_NOTIFY                 = "武道大會第四輪比賽開始，請晉級的勇士在3分鐘內進入武道會場！"
BCT_ACTIVITY_CHUNJIE_NOTICE_02                = "特急軍情：報！“年獸之王”已攜著大批年獸已包圍各地城區，妄想破壞虎年新春！大家趕緊拿起武器，將它們趕回深山去吧！"
BCT_HUNDUN_END_NOTIFY                         = "混沌入侵活動已經結束，下一次混沌入侵活動歡迎你的參與！"
BCT_JZ_ESTABLISH                              = "恭喜%s成立了%s家族!"
BCT_PHZHDD_BEGAIN                             = "撼地大將進入帝王古墓四層，他帶著鱷魚人在帝王古墓裡企圖幫助巨靈魔逃出封印，各位勇士快舉起你的武器把撼地大將消滅。"
BCT_DUDUZHU_BOSS_NOTIFY                       = "邪惡嘟嘟豬出現了，大家小心啊。"
BCT_TONGCOMPETITION_BEGIN_NOTIFY_0          = "幫會競技活動將在10分鐘後開始，去鳳鳴城找峮歐（102:132）準備報名報名。"
BCT_FUBEN_WU_YAO_QIAN_SHAO_OVER               = "BOSS獅虎獸王死亡了，任務完成，60秒後將離開副本！"
BCT_KJHS_COMMENDATION                         = "@F{fc=(0,255,255)}[%s]@F{fc=(255,255,0)}學識淵博，深得考官喜歡，在會試的考試中獲得額外的一個%s獎勵！"
BCT_ACTIVITY_SGMJ_NOTIFY                      = "神鬼秘境是一個非常詭異的地方，但是有挑戰就有收獲。組織三人以上的隊伍，在鳳鳴城金烏近衛軍官（212：166）領取任務、進入副本。每天可以進行兩次，千萬不要錯過機會啊！"
BCT_JTNM_BEGIN_NOTIFY_0                       = "擊退牛魔王將在10分鐘後開始，上吧！勇士們！去各個城市的周邊把牛魔王消滅掉吧！"
BCT_TONGCOMPETITION_BEGIN_NOTIFY            = "幫會競技開始了，誰將會是本次的勝者？誰又能刷新新的榮譽記錄呢？讓我們拭目以待。"
BCT_ZZDLLR_BEGAIN_0                           = "墮落獵人將在10分鐘後潛入帝王古墓一層，勇士們請做好準備。"
BCT_FYBSY_BEGAIN                              = "帝王古墓三層的封印減弱，白蛇妖想乘機離開帝王古墓，各位勇士快舉起你的武器把白蛇妖重新封印。"
BCT_KJKS_NO_JINSHI                            = "本周沒有人中得進士。"
BCT_QNZD_WILL_OPEN                            = "潛能亂鬥即將於10分鐘後開啟，天下能人誌士皆可來此勝地修煉！活動開啟後，即可在鳳鳴城雙倍經驗管理員吳霜處報名。"
BCT_TGHD_WILL_OPEN_NOTIFY                     = "天關已經開啟，強力的挑戰、豐厚的經驗、誘人的寶箱，快快組齊3人的隊伍，在天關開啟後到鳳鳴城（221:158）天關管理員那裡去報名進入吧！"
BCT_WDDH_1TH_WILLBEGIN_NOTIFY                 = "武道大會第一輪比賽開始，請已報名的勇士在3分鐘內進入武道會場！"
BCT_FYBSY_SNAKE_DIE                           = "%s成功地把白蛇妖再次封印。"
BCT_BHGL_TONG_ESTABLISH_NOTIFY                = "恭喜%s成立了%s幫會!"
BCT_KJKS_DOING_FOR_DIANSHI                    = "科舉殿試已經開始，請獲得殿試資格的勇士們盡快到鳳鳴城（81:213）找殿試官員參加殿試。"
BCT_PROTECTTONG_MONSTER_CLEAR_NOTIFY          = "混沌偷襲%s幫會的計劃被金烏的勇士們成功破壞"
BCT_TEAMCOMPETITION_END_NOTIFY                = "組隊競賽活動已經結束，下一次組隊競賽活動歡迎你的參與！"
BCT_GWGC_MONSTER_ACTIVE_NOTIFY                = "偵察兵發現怪物正在集結，它們可能又準備攻擊各城市了，請各位勇士作好戰鬥準備，盡快回防！"
BCT_WDDH_WILL_BEGIN_NOTIFY                    = "武道大會即將開始，若想參與大會請立刻前往鳳鳴城的賽刑天（183，170）處報名，名額有限，獎勵豐厚，誰才是本次的PK王？如果你足夠強！"
BCT_KJKS_TOP_THREE_NOTIFY                     = "請盡快到鳳鳴城（69:149）找殿試官員領取獎勵！"
BCT_TGHD_GRADE_FINISH                         = "本關卡已經成功通過，請進入下一個關卡。"
BCT_JZLT_BEGIN_NOTIFY                         = "家族擂臺將在10分鐘後召開，正在招募天下英雄報名！有信心的家族族長快來鳳鳴（-34:0）找家族管理員少帝準備參加吧！"
BCT_HUNDUN_BEGIN_NOTIFY_0                     = "混沌入侵活動將在10分鐘後開始，組織3人的隊伍，去各城市等待，先到先得，來晚了可就沒啦！"
BCT_BSDS_PREPARE_NOTIFY                       = "變身大賽活動還有%d分鐘就要開始了，想參加的朋友快來鳳鳴城海灘（-149:-22）找變身小丑報名啊！"
BCT_JSGX_BECOME_LOVERS                        = "%s 與 %s 成為了戀人，大家恭喜他們。"
BCT_FYBSY_BEGAIN_0                            = "封印白蛇妖將在10分鐘後開始，上吧！勇士們！去帝王古墓的三層把白蛇妖封印吧！"
BCT_TGHD_BEGIN_NOTIFY                         = "天神為玩家準備了豐厚的獎勵，但是也要面對嚴峻的挑戰。組織三人以上的隊伍，在鳳鳴城羿巫(222：158)進入副本。每天可以進行一次，千萬不要錯過機會啊！"
BCT_YAYU_BEGIN_NOTIFY_0                       = "狩人氏的主神猰貐被混沌圍困，需要你的幫助！組織三人以上的隊伍，在鳳鳴城找碧血(-48：149)進入副本。每天可以進行兩次，千萬不要錯過機會啊！"
BCT_KJKS_CELEBRATE_FOR_JUREN                  = "本次會試圓滿結束，中得舉人的玩家為%s恭喜他們獲得周日下午在鳳鳴城（69:149）參加殿試的機會。請盡快到鳳鳴城（-66:141）找科舉報名官員領取獎勵！"
BCT_KJKS_CELEBRATE_FOR_JINSHI                 = "本次殿試圓滿結束，中得進士的玩家為%s恭喜他們!請盡快到鳳鳴城（69:149）找殿試官員領取獎勵！"
BCT_DTHD_WILL_OPEN_1                          = "答題活動將在1分鐘後開始，請玩家做好準備！答題過程中不能移動，請選擇安全的位置參與活動！"
BCT_DTHD_WILL_OPEN_3                          = "想輕鬆獲得大量經驗嗎？考驗智力的知識問答即將在10分鐘後開始，放鬆你的身體進入到答題的挑戰中來吧！"
BCT_DTHD_WILL_OPEN_2                          = "答題活動將在30秒後開始，請玩家做好準備！答題過程中不能移動，請選擇安全的位置參與活動！"
BCT_TANABATA_QUIZ_START                       = "七夕情感大問答開始了！"
BCT_TANABATA_QUIZ_FINISH                      = "本時段的【感情大考驗】活動雖已結束，但這或許是個新的開始。希望你們能承載著幸福之舟，面對種種考驗，迎風破浪，相攜永遠。"
BCT_TANABATA_QUIZ_NOTICE					  = "傳說中，有緣人會在七夕之時邂逅，只要贏得守護情侶的考驗，便可獲得永恒的祝福，請與異性玩家組隊一起接受鳳鳴城楚纖雲的考驗吧！"
BCT_JTNM_DEVIL_DIE                            = "牛魔王的本次進攻被%s成功阻止，牛魔王丟下寶箱落荒而逃。"
BCT_JSGX_BECOME_COUPLE                        = "恭喜 %s 與 %s 結為夫妻，祝兩人白頭到老，永結同心。"
BCT_CITY_WAR_START_NOTIFY                     = "問鼎天下，決戰禁城。今晚各大城市將展開廝殺，沒有鮮花，沒有歡呼，這將是血的一戰，血染戰場將是各位勇士無法避免的結果，勝者將站在各大城市的巔峰之處，戰場將在20:00開啟，請各大幫會做好準備！"
BCT_CITY_WAR_SEMI_RESULT_NOTIFY					= "經過多輪激烈的幫會城市爭奪戰預賽，%s幫會脫穎而出順利晉級。"
BCT_CITY_WAR_FINAL_RESULT_NOTIFY				= "%s城市爭奪戰完滿結束，%s擁有的%s幫會最終獲得了飛來石的擁有權，恭喜%s幫會！！！！！"
BCT_PROTECTTONG_BEGIN_NOTIFY                  = "%s幫會被混沌派來的怪物精英偷襲，請幫會弟子和各社會名士火速救援。"
BCT_WDDH_5TH_WILLBEGIN_NOTIFY                 = "武道大會第五輪比賽開始，請晉級的勇士在3分鐘內進入武道會場！"
BCT_JSGX_STUDY_GRADUATED                      = "%s在%s的幫助下，終於成長為一代大蝦，順利告別師門。"
BCT_SMHD_BEGIN_NOTIFY                         = "賽馬大賽將在10分鐘後開始，各位勇士，請先暫忘緊張的戰鬥，盡情在競速中放鬆吧！想參加活動的勇士，請到鳳鳴採薇（183:173）處報名吧！"
BCT_SMHD_CELEBRATE                            = "%s 獲得本次賽馬第%i名，將獲得大量的經驗和金錢"
BCT_PHFKJS_DIE                                = "%s成功地把瘋狂祭師趕出帝王古墓。"
BCT_ROLECOMPETITION_BEGIN_NOTIFY_0            = "個人競技場活動即將在10分鐘後開始，請在鳳鳴城“個人競技管理員”迢斬（102:150）處報名進入。"
BCT_TEAMCOMPETITION_BEGIN_NOTIFY              = "組隊競賽活動已經開始，組織3人的隊伍參加！"
BCT_TJBH_TIMER_ACTIVITY_END                   = "本次“天降寶盒”活動已經結束，清點一下你的背包，這次收獲不小吧！"
BCT_TONG_ROB_WAR_BEGIN_NOTIFY                 = "幫會掠奪戰將在10分鐘後開始，請申請成功的幫會做好戰鬥準備！"
BCT_QNDW_BEGIN_NOTIFY                         = "混沌把千年毒蛙放在各個城市的門口，它打算用蛙毒來攻破城市的防線，勇士們，趕快加入戰鬥，阻止混沌的陰謀。"
BCT_CITY_WAR_SIGNUP_RESULT_NOTIFY             = "各大城市的競拍爭奪已經結束，在未來的一個星期內這些城市將迎來下面各大幫會的龍爭虎鬥，誰將是未來的王者呢讓我們拭目以待吧。"
BCT_TIANJIANGQISHOU_BEGIN_NOTIFY_0            = "天降奇獸活動將在10分鐘後開始，組織3人的隊伍，去留仙臺準備抓小暴龍吧！"
BCT_TJBH_TIMER_ACTIVITY_START                 = "“天降寶盒”活動已經開始，在野外殺怪就有機會獲得“招財”、“進寶”寶盒，快快尋找寶盒吧！"
BCT_MADROP_ACTIVITY_START                 = "9月22日至10月7日，收集“天上人間一周年大禮包”中的不同字符，就可以在鳳鳴城月影處換取內測周年禮包。天上人間一周年，風雨同進步。"
BCT_MADROP_ACTIVITY_END                 = "收集字符活動結束，怪物將不會掉落活動道具。"
BCT_KJKS_NO_JUREN                             = "本次會試結束了，沒有玩家中得舉人，真可惜。"
BCT_ROLECOMPETITION_END_NOTIFY                = "個人競技活動已經結束，下一次個人競技活動歡迎你的參與！"
BCT_BSDS_BEGIN_NOTIFY                         = "大家各就各位，變身大賽馬上開始！！！！"
BCT_JBXTDJ_DIE                                = "%s成功地把嘯天大將趕出帝王古墓。"
BCT_FUBEN_SHEN_GUI_MI_JING_OVER               = "齋南死亡了，任務完成，60秒後將離開副本！"
BCT_DUDUZHU_BEGIN_NOTIFY                      = "嘟嘟豬活動已經開始，組織3人的隊伍參加！"
BCT_PHZHDD_BEGAIN_0                           = "撼地大將將在10分鐘後潛入帝王古墓四層，勇士們請做好準備。"
BCT_TIANJIANGQISHOU_BOSS_NOTIFY               = "大頭暴龍媽媽出現了，她看起來不是一般的生氣。"
BCT_ACTIVITY_WYQS_NOTIFY                      = "巫妖王組織大量怪物準備進攻鳳鳴，先下手為強。組織三人以上的隊伍，在鳳鳴城勾玉文（122：148）領取任務、進入副本。每天可以進行兩次，千萬不要錯過機會啊！"
BCT_JYLD_IS_DOING                             = "經驗亂鬥正在進行,請本周還沒參與的玩家抓緊時間,組織3人以上的隊伍在鳳鳴城雙倍經驗管理員吳霜處報名參與!"
BCT_FYJLM_BEGAIN                              = "帝王古墓六層的封印減弱，巨靈魔想乘機離開帝王古墓，各位勇士快舉起你的武器把巨靈魔重新封印。"
BCT_YB_BEGIN_NOTIFY                           = "國運活動開始了！在國運期間完成運鏢任務可以獲得雙倍收益！大家趕緊去運鏢吧！"
BCT_DBJY_WILL_BEGIN_NOTIFY                    = "系統多倍獎勵時間將在10分鐘後開始！"
BCT_HUNDUN_BEGIN_NOTIFY                       = "偵察兵報告在城市附近發現有混沌精兵，勇士們快去阻止混沌精兵的破壞行動吧！"
BCT_SMHD_REWARD_ITEM                          = "賽馬活動參賽者在比賽後可找賽馬管理員採薇領取一份獎品"
BCT_TIANJIANGQISHOU_END_NOTIFY                = "天降奇獸活動已經結束，下一次天降奇獸歡迎你的參與！"
BCT_PROTECTTONG_FIND_ITEM_NOTIFY              = "%s在散落一地的怪物精英的牙齒中竟發現了%s鑲嵌水晶！"
BCT_FUBEN_SHEN_GUI_MI_JING_BOSS_COME          = "齋南在巢穴盡頭出現了,大家快去截殺他!"
BCT_KJKS_BEGIN_FOR_UP_LEVEL                   = "科舉鄉試已經開始，各位達到十級以上的勇士請到鳳鳴城（-66:141）找科舉報名官員參與。"
BCT_TEAMCOMPETITION_BEGIN_NOTIFY_0            = "組隊競賽活動將在10分鐘後開始，組織3人的隊伍，去鳳鳴城（183:167）找戰八方準備報名報名！"
BCT_SMHD_SIGN_UP_NOTIFY                       = "賽馬將在2分鐘後開始，抓緊時間報名吧！想參加活動的勇士，請到鳳鳴採薇（183:173）處報名。"
BCT_WDDH_2TH_WILLBEGIN_NOTIFY                 = "武道大會第二輪比賽開始，請晉級的勇士在3分鐘內進入武道會場！"
BCT_FYJLM_BEGAIN_0                            = "封印巨靈魔將在10分鐘後開始，上吧！勇士們！去帝王古墓六層把巨靈魔封印吧！"
BCT_DBJY_GODSEND_NOTIFY                       = "天神降福，普天之下各位勇士殺死怪物時所獲得的經驗潛能將額外多出%s%%，望眾位努力殺敵！"
BCT_PROTECTTONG_BEGIN_NOTIFY_0                = "混沌將於10分鐘後攻擊%s幫會，請各路英雄做好準備，抵御混沌的襲擊。"
BCT_KJKS_DOING_FOR_UP_LEVEL                   = "科舉鄉試正在進行，請沒有參與的勇士盡快到鳳鳴城（-66:141）找科舉報名官員參與。"
BCT_FUBEN_SHEN_GUI_MI_JING_MONSTER_PET_COME   = "蒙蒙出現在副本入口處，準備向頭領報信,大家快截住他!"
BCT_QNDW_BEGIN_NOTIFY_0                       = "消滅千年毒蛙將在10分鐘後開始，上吧！勇士們！去各個城市的周邊把千年毒蛙消滅掉吧！"
BCT_YB_PREPARE_NOTIRY                         = "國運活動快要開始了，在國運期間完成運鏢任務可以獲得雙倍收益！大家趕緊去運鏢吧！"
BCT_YB_END_NOTIFY                             = "國運活動結束了！"
BCT_YAYU_END_NOTIFY                           = "拯救猰貐活動已經結束，下一次拯救猰貐活動歡迎你的參與！"
BCT_SJFB_BEGIN_NOTIFY_0                       = "水晶活動即將在10分鐘後開始，組織3人的隊伍，在鳳鳴城（-18：150）雲舒那裡報名參加！"
BCT_FYJLM_JULINGMO_DIE                        = "%s成功地把巨靈魔再次封印。"
BCT_KJXS_COMMENDATION                         = "@F{fc=(0,255,255)}[%s]@F{fc=(255,255,0)}學識淵博，深得考官喜歡，在鄉試的考試中獲得額外的一個${o0}獎勵！"
BCT_TJBH_TIMER_ACTIVITY_BEING                 = "“天降寶盒”活動正在進行，在野外殺怪就有機會獲得“招財”、“進寶”寶盒，快快尋找寶盒吧！"
BCT_ACTIVITY_CHUNJIE_NOTICE_04                = "親愛的玩家朋友，春節活動期間（2月12日-2月28日）參加科舉考試可獲得“虎年利是封”哦，祝您好運常在，笑口常開！"
BCT_ACTIVITY_CHUNJIE_NOTICE_05                = "親愛的玩家朋友，春節活動期間（2月12日-2月28日）參加知識問答可獲得“虎年利是封”哦，祝您好運常在，笑口常開！"
BCT_ROLECOMPETITION_START                     = "個人競技場開始了，誰將會是本次的勝者？誰又能刷新新的榮譽記錄呢？讓我們拭目以待。"
BCT_ACTIVITY_CHUNJIE_NOTICE_01                = "“火樹銀花不夜天，人間萬里共團圓”，恭祝全體玩家新年快樂，闔家安康！在辭舊迎新的大喜日子裡，天上人間邀您共慶佳節：鳳鳴城中，四位“虎年賜福天官”從天而降，趕緊去找他們吧，意想不到的驚喜正在等著你！"
BCT_JTNM_BEGIN_NOTIFY                         = "牛魔王帶領部下攻打城市來啦，勇士們，舉起你的武器，共同抵抗牛魔王的入侵吧！"
BCT_ACTIVITY_CHUNJIE_NOTICE_03                = "“東風夜放花千樹，寶馬雕車香滿路”，又到了迎春花燈放彩的時分啦，天上人間各大城區都已掛滿了花燈，大家快快前去找到花燈猜燈謎，學問越多，禮品越多哦！"
BCT_JBXTDJ_BEGAIN                             = "嘯天大將進入帝王古墓五層，他帶著戰狼騎兵在帝王古墓裡企圖幫助巨靈魔逃出封印，各位勇士快舉起你的武器把嘯天大將消滅。"
BCT_ACTIVITY_CMS_NOTICES03                    = "一年一度的聖誕節快到了，各大補給點為大家準備了驚喜哦，趕快去找到聖誕樹領取自己的禮物吧！"
BCT_ACTIVITY_CMS_NOTICES02                    = "聖誕節，節目多多，玩活動，好禮相送！快到鳳鳴（70，-115）處找NPC喜慶參加聖誕節活動吧！"
BCT_ACTIVITY_CMS_NOTICES01                    = "聖誕節刷雪人、參加活動、收集聖誕糖果換好禮！快來參與吧！"
BCT_QNZD_IS_DOING                             = "潛能亂鬥正在進行,請本周還沒參與的玩家抓緊時間,組織3人以上的隊伍在鳳鳴城雙倍經驗管理員吳霜處報名參與!"
BCT_SJFB_END_NOTIFY                           = "水晶活動已經結束，下一次水晶活動將於明日同期舉行！"
BCT_SJFB_BEGIN_NOTIFY                         = "水晶活動已經開始，組織3人的隊伍，在鳳鳴城（-18：150）雲舒那裡報名參加！"
BCT_QNDW_FROG_DIE                             = "千年毒蛙被消滅了，%s成功解除鳳鳴的水源污染危機。"
BCT_PROTECTTONG_END_NOTIFY                    = "混沌士兵撤出%s幫會的領地，%s幫會回覆平靜"
BCT_TONGCOMPETITION_START                     = "幫會競技活動開始了！"
BCT_DUDUZHU_END_NOTIFY                        = "邪惡嘟嘟豬和它的狂暴軍團已經被驅趕，巫苗寨又恢復平靜。"
BCT_JZLT_NOT_WINNER                           = "很遺憾，今天的家族擂臺賽沒有勝利者。"
BCT_TJBH_TIMER_ONE_MIN_REMAIN                 = "天現祥雲，降福人間，寶氣神賜，盒贈勇者。“天降寶盒”活動將在1分鐘後開始，請各位玩家做好準備。"
BCT_ACTIVITY_SLBZ_NOTIFY                      = "據說巫妖王把她搜羅的寶物藏在一個山谷裡，一起去尋找寶藏吧。組織三人以上的隊伍，在鳳鳴城旬苞（34：148）領取任務、進入副本。每天可以進行兩次，千萬不要錯過機會啊!"
BCT_JZLT_START                                = "家族擂臺開始，請各位英雄各就各位準備戰鬥！"
BCT_FUBEN_SHEN_GUI_MI_JING_MONSTER_PET_ESCAPE = "巫妖王寵物蒙蒙逃走報信了，任務失敗，10秒後將離開副本！"
BCT_KJKS_BEGIN_FOR_XIUCAI                     = "科舉會試已經開始，請本周內擁有秀才稱號的勇士們盡快到鳳鳴城（-66:141）找科舉報名官員報名參加會試。"
BCT_JZTZ_BEGIN                                = "%s 家族向 %s 家族發起了%i小時的挑戰賽。在此期間可任意切磋，PK值不會增加！"
BCT_JZLT_CELEBRATE                            = "@F{fc=(255,255,0)}%s@F{fc=(255,255,255)}家族在家族擂臺賽中勢如破竹，無人可擋，成為今天的冠軍家族！恭喜他們。"
BCT_FUBEN_WU_YAO_QIAN_SHAO_BOSS_COME          = "獅虎獸王出現在獅虎山中部,大家小心!"
BCT_YB_SHOULD_END_NOTIFY                      = "國運活動快要結束了，大家加把勁！"
BCT_GWGC_WAS_OCCUPIED                         = "%s地區的抗戰失敗！"
BCT_BHGL_ALIGNMENT_NOTIFY                     = "%s與%s結成了同盟。"
BCT_KJKS_DOING_FOR_XIUCAI                     = "科舉會試正在進行，請本周內擁有秀才稱號但沒有參與的勇士盡快到鳳鳴城（-66:141）找科舉報名官員報名參與。"
BCT_TEAMCOMPETITION_START                     = "組隊競賽活動開始了！"
BCT_TJBH_TIMER_FIVE_MIN_REMAIN                = "天現祥雲，降福人間，寶氣神賜，盒贈勇者。“天降寶盒”活動將在5分鐘後開始，請各位玩家做好準備。"
BCT_PROTECTTONG_WIN_NOTIFY                    = "以%s為首的金烏勇士把搗亂%s幫會的怪物精英打得滿地找牙。"
BCT_YAYU_BEGIN_NOTIFY                         = "拯救猰貐活動開始了，大家趕緊去參加啊！"
BCT_JSGX_DIVROCE                              = "%s 與 %s 勞燕分飛，離婚成功，又成為單身一族了。"
BCT_JSGX_NEW_ALLY					= "%s在鳳鳴燒黃紙，結義金蘭，從此同闖天下。"
BCT_JSGX_NEW_TEACH					= "恭喜%s正式收了%s為徒，開始了雙方的修煉。"
BCT_JSGX_FIND_TEACHER				= "[@L{t=%s;m=viewRoleInfo:%s}]骨骼精奇，天資聰穎，是個練武奇才，現求良師益友一名，有意者請速與其聯繫。"
BCT_JSGX_AUTO_DISBAND			= "%s果然天資聰穎，短短時間就在%s的門下出師，順利成為一代大俠！"
BCT_TJBH_TIMER_TEN_MIN_REMAIN                 = "天現祥雲，降福人間，寶氣神賜，盒贈勇者。“天降寶盒”活動將在10分鐘後開始，請各位玩家做好準備。"
BCT_JZLT_SIGN_UP                              = "家族擂臺準備召開，正在招募天下英雄報名！有信心的家族族長快來鳳鳴找家族管理員少帝報名吧！"
BCT_HSSR_TRADER_SITE_NOTIFY                   = "投機商人出現在%s的%d:%d，本次他收購的物品是%s。想賺錢的朋友快來看看吧！"
BCT_CITY_WAR_QUEST_START                      = "[蘑菇任務]統帥感到餓了，想吃其他房間中生長的蘑菇，每一朵可以恢復1%的生命。"
BCT_JZLT_END_SIGN_UP                          = "本次家族擂臺報名結束，請各位有誌族長等待下次機會！"
BCT_BSDS_END_NO_PARTICIPANT                   = "本次變身大賽沒有玩家報名，活動結束。"
BCT_DUOLUOLIEREN_DIE                          = "%s成功地把墮落獵人趕出帝王古墓。"
BCT_JYLD_PRE_NOTIFY                           = "經驗亂鬥即將於10分鐘後開啟，天下能人誌士皆可來此勝地修煉！活動開啟後，即可在鳳鳴城吳霜處報名。"
BCT_CITY_WAR_SIGNUP_NOTIFY                    = "幫會城市爭奪權報名正在進行中。幫主在想要爭奪的城市管理員那裡進行競價，出價高的前6個幫會將能在下周爭奪該城市。極端挑戰，高額回報，等你來參與！"
BCT_GWGC_WON_OVER                             = "%s地區勇士成功殲滅聚集的敵人。"
BCT_TGHD_CLOSE_NOTIFY                         = "天關活動已經關閉，每周二、四、六的18:00-19:00天關將再次開啟。"
BCT_FUBEN_WU_YAO_WANG_BAO_ZANG_OVER           = "BOSS巫妖王之影死亡了，任務完成，60秒後將離開副本！"
BCT_DUDUZHU_BEGIN_NOTIFY_0                    = "嘟嘟豬的叛逆將在10分鐘後開始，組織3人的隊伍，去巫苗寨準備抓嘟嘟豬吧！"
BCT_JBXTDJ_BEGAIN_0                           = "嘯天大將將在10分鐘後潛入帝王古墓五層，勇士們請做好準備。"
BCT_PHFKJS_BEGAIN                             = "瘋狂祭師進入帝王古墓二層，他帶著機關人在帝王古墓裡做著危險的實驗，各位勇士快舉起你的武器把瘋狂祭師消滅。"
BCT_WDDH_3TH_WILLBEGIN_NOTIFY                 = "武道大會第三輪比賽開始，請晉級的勇士在3分鐘內進入武道會場！"
BCT_PHZHDD_DIE                                = "%s成功地把撼地大將趕出帝王古墓。"
BCT_HUNDUN_BOSS_NOTIFY                        = "混沌精兵隊長:誰那麼大膽，來破壞我的營地。"
BCT_ROLECOMPETITION_BEGIN_NOTIFY              = "個人競技場開始了，誰將會是本次的勝者？誰又能刷新新的榮譽記錄呢？讓我們拭目以待。"
BCT_ZZDLLR_BEGAIN                             = "墮落獵人進入帝王古墓一層，想解開帝王古墓的封印，各位勇士快舉起你的武器把墮落獵人消滅。"
BCT_TIANJIANGQISHOU_BEGIN_NOTIFY              = "天降奇獸活動已經開始，組織3人的隊伍參加！"
BCT_FRUIT_TREE_START						  = "浪漫的七夕之旅拉開帷幕，快去鳳鳴城的鵲橋仙子楚纖雲處領取魅力種子，種下自己的夢想，收獲自己的希望！"
BCT_KJHS_NO_1              	= "本周無狀元。"
BCT_KJHS_NO_2              = "本周無榜眼。"
BCT_KJHS_NO_3              = "本周無探花。"
BCT_KJHS_TOP_1              = "本周狀元:%s！"
BCT_KJHS_TOP_2              = "本周榜眼:%s！"
BCT_KJHS_TOP_3              = "本周探花:%s！"
BCT_GOD_WEAPON              = "【%s】歷盡千辛萬苦，訪名山拜高人，終於煉製成驚天動地，舉世無雙的神兵%s，從此天下又多了一位斬妖除魔的大俠！"
BCT_TEAM_COLLECT         = "銀沙村落下大量銀河墜入凡間的星辰，請到楚纖雲處領取乞巧鋤，與異性玩家一起開啟星辰的寶藏。"
BCT_PROTECTTONG_MID_AUTUMN_WIN_NOTIFY			= "以%s為首的金烏勇士把搗亂%s幫會的月餅怪吃的乾乾淨淨。"
BCT_PROTECTTONG_MID_AUTUMN_BEGIN_NOTIFY_0		= "圓月之日%s幫會領地將舉辦月餅大亂鬥，請在10分鐘後進入幫會領地，參加盛大節日派對，共享月餅盛宴！"
BCT_PROTECTTONG_MID_AUTUMN_BEGIN_NOTIFY			= "%s幫會的領地中有大量好吃的月餅，請各路英雄速去赴宴，佳節美食，舍我其誰。"
BCT_PROTECTTONG_MID_AUTUMN_END_NOTIFY			= "酒過三巡，菜過五味，月餅卻剩三兩只，看來這家月餅有色有香不夠味，下回的月餅亂鬥我們去別家，不見不散！"
BCT_PROTECTTONG_MID_AUTUMN_MONSTER_CLEAR_NOTIFY	= "月餅盛宴到此結束，今日舉杯邀月，把酒言歡，歡迎改日再來！"
BCT_EXTABLISH_YB_BUY_BILL				= "玩家%s在天幣交易界面發布了求購訂單，單價為%i銅/100天幣。"
BCT_EXTABLISH_YB_SELL_BILL				= "玩家%s在天幣交易界面發布了寄售訂單，單價為%i銅/100天幣。"
BCT_BHLT_SIGN_UP             = "幫會擂臺準備召開，正在招募天下英雄報名！有信心的幫會幫主快來鳳鳴找幫會擂臺管理員報名吧！"
BCT_BHLT_START               = "幫會擂臺開始，請各位英雄各就各位準備戰鬥！"
BCT_BHLT_END_SIGN_UP         = "本次幫會擂臺報名結束，請各位有誌幫主等待下次機會！"
BCT_BHLT_CELEBRATE           = "@F{fc=(255,255,0)}%s@F{fc=(255,255,255)}幫會在幫會擂臺賽中勢如破竹，無人可擋，成為今天的冠軍幫會！恭喜他們。"
BCT_BHLT_NOT_WINNER          = "很遺憾，今天的幫會擂臺賽沒有勝利者。"
BCT_BHLT_BEGIN_NOTIFY        = "幫會擂臺將在10分鐘後召開，正在招募天下英雄報名！有信心的幫會幫主快來鳳鳴找幫會擂臺管理員準備參加吧！"
# ********************************************************************************************
# gossip
# ********************************************************************************************

GOSSIP_1 = "完成"
GOSSIP_2 = "確定"
GOSSIP_3 = "接受"
GOSSIP_4 = "好！讓我去掃除這些妖孽吧！"
GOSSIP_5 = "完成任務"
GOSSIP_6 = "在下能力有限，這個任務無法完成！"
GOSSIP_7 = "我願意。"
GOSSIP_8 = "我來助拳！"
GOSSIP_9 = "廢話少說，迎戰吧！"
GOSSIP_10 = "繼續戰鬥！"
GOSSIP_11 = "受死吧，我來教訓你們這幫妖魔。"
GOSSIP_12 = "我惹不起你，快快跑吧！"
GOSSIP_13 = "進入其他幫會領地"
GOSSIP_14 = "開戰吧！"


BCNPC_S_1 = {
	"gw0028_1":"野豬",
	"gw0365_1":"貓頭鷹",
	"gw0016_1":"山鬼",
	"gw0041_1":"木傀",
	"gw0341_2":"螃蟹",
	"gw0072_1":"蘑菇",
	"gw0121_1":"鱷魚",
	"gw0031_1":"狗熊",
}

CELL_POTENTIALREFUGEE_S_1 = [
	"被他們抓來已經兩三個月了，不知家裡的老娘怎麼樣了……",
	"這些天殺的，不得好死！",
	"謝天謝地，總算有人來救我們了，老天開眼啊！",
	"手裡捧著窩窩頭，菜裡沒有一滴油……窩窩頭是什麼？",
	"你們如果晚來一步，怕是我也要和他們一樣了！",
	"上天有好生之德，你們就是救苦救難的活菩薩！",
]




#------------------------------------------------------------------------------------------------------------------------
#GM管理
#------------------------------------------------------------------------------------------------------------------------
WIZCOMMAND_BING_LIN_CHENG_XIA							= "兵臨城下"
WIZCOMMAND_HEI_SHI_SHANG_REN                            = "黑市商人"
WIZCOMMAND_JIA_ZU_LEI_TAI                               = "家族擂臺"
WIZCOMMAND_GUO_YUN_HUO_DONG                             = "國運活動"
WIZCOMMAND_JIA_ZU_ZHAN_ZHENG_BAO_MING                   = "家族戰爭報名"
WIZCOMMAND_BANG_HUI_CHENG_SHI_ZHAN_JING_PAI             = "幫會城市戰競拍"
WIZCOMMAND_BANG_HUI_LUE_DUO_ZHAN                        = "幫會掠奪戰"
WIZCOMMAND_BANG_HUI_LUE_DUO_ZHAN_BAO_MING               = "幫會掠奪戰報名"
WIZCOMMAND_TIAN_JIANG_BAO_HE                            = "天降寶盒"
WIZCOMMAND_MAT                            = "中秋掉落"
WIZCOMMAND_BIAN_SHEN_DA_SAI                             = "變身大賽"
WIZCOMMAND_JIA_ZU_ZHAN_ZHENG                            = "家族戰爭"
WIZCOMMAND_ZHI_SHI_WEN_DA                               = "知識問答"
WIZCOMMAND_ZU_DUI_JING_SAI                              = "組隊競賽"
WIZCOMMAND_XI_TONG_SHUANG_BEI                           = "系統雙倍"
WIZCOMMAND_HUN__RU_QIN                                  = "混沌入侵"
WIZCOMMAND_BAO_HU_BANG_PAI_ZHUN_BEI                     = "保護幫派準備"
WIZCOMMAND_BAO_HU_BANG_PAI                              = "保護幫派"
WIZCOMMAND_PROTECT_TONG_MID_AUTUMN_READY                = "中秋保護幫派準備"
WIZCOMMAND_PROTECT_TONG_MID_AUTUMN                      = "中秋保護幫派"
WIZCOMMAND_TIAN_JIANG_QI_SHOU                           = "天降奇獸"
WIZCOMMAND_FENG_YIN_BAI_SHE_YAO                         = "封印白蛇妖"
WIZCOMMAND_FENG_YIN_JU_LING_MO                          = "封印巨靈魔"
WIZCOMMAND_QIAN_NIAN_DU_WA                              = "千年毒蛙"
WIZCOMMAND_NIU_MO_WANG_HUO_DONG                         = "牛魔王活動"
WIZCOMMAND_DU_DU_ZHU                                    = "嘟嘟豬"
WIZCOMMAND_DUO_LUO_LIE_REN                              = "墮落獵人"
WIZCOMMAND_FENG_KUANG_JI_SHI                            = "瘋狂祭師"
WIZCOMMAND_HAN_DI_DA_JIANG                              = "撼地大將"
WIZCOMMAND_XIAO_TIAN_DA_JIANG                           = "嘯天大將"
WIZCOMMAND_GE_REN_JING_JI                               = "個人競技"
WIZCOMMAND_BANG_HUI_JING_JI                               = "幫會競技"
WIZCOMMAND_GUAI_WU_GONG_CHENG                           = "怪物攻城"
WIZCOMMAND_FEI_CHENG_WU_RAO	                            = "非誠勿擾"
WIZCOMMAND_TANABATA_QUIZ	                            = "七夕情感問答"
WIZCOMMAND_TEAM_COLLECT	                          		= "銀河落九天"
WIZCOMMAND_FRUITTREE	                          		= "魅力果樹"
WIZCOMMAND_BANG_HUI_LEI_TAI                             = "幫會擂臺"

#------------------------------------------------------------------------------------------------------------------------
#共用資源
#------------------------------------------------------------------------------------------------------------------------

#------------------------------------------------------------------------------------------------------------------------
#拯救猰貐
#------------------------------------------------------------------------------------------------------------------------
YA_YU_VOICE1				= "謝謝你們幫我擊退了混沌兵團！雖然混沌將領和他的爪牙們還會再來的，不過到時候我會讓他們感受到我猰貐的強大。"
YA_YU_VOICE2				= "拯救猰貐活動正在進行，%i點%i分試圖再次開啟拯救猰貐活動。"
YA_YU_VOICE3				= "拯救猰貐活動已經結束，%i點%i分試圖再次結束拯救猰貐活動。"
YA_YU_VOICE4			  	= "猰貐被成功拯救了。"
YA_YU_VOICE5			  	= "拯救猰貐傳送點"
YA_YU_VOICE6				= "拯救猰貐"
YA_YU_VOICE7				= "混沌藍魔先鋒部隊開始向猰貐進攻了，大家做好迎戰準備。"
YA_YU_VOICE8		        = "混沌將領"
YA_YU_VOICE9		        = "猰貐已經奄奄一息，解決掉他我們就可以交差了，弟兄們不要給他任何的機會。"
YA_YU_VOICE10		        = "混沌兵團的第二波進攻開始了，這一次他們派出了剛硬無比的硬甲藍魔。"
YA_YU_VOICE11		        = "你們這些渺小的螻蟻，與混沌為敵等於自掘墳墓。"
YA_YU_VOICE12		        = "混沌兵團的精銳部隊進攻了，大家要小心那些會爆炸的爆裂紅魔和會偷襲的混沌刺客。"
YA_YU_VOICE13		        = "不要以為你們已經贏了？其實遊戲才剛剛開始。"
YA_YU_VOICE14		        = "混沌兵團的軍隊發動最後的總攻，最激烈的戰鬥開始了。"
YA_YU_VOICE15		        = "弟兄們上吧，不要留給他們任何的機會。"
YA_YU_VOICE16		        = "強大的混沌將領出戰了。"
YA_YU_VOICE17		        = "看來你們有兩下子。好，讓我來親自會會你們。"
YA_YU_VOICE18				= "拯救猰貐副本"
YA_YU_VOICE19				= "猰貐"
YA_YU_VOICE20				= "我的身邊出現混沌刺客，快回來幫我。"


#------------------------------------------------------------------------------------------------------------------------
#變身大賽
#------------------------------------------------------------------------------------------------------------------------
BIAN_SHEN_VOICE_1 = "比賽即將開始,請各就各位!"
BIAN_SHEN_VOICE_2 = "變身大賽結束了，本次沒有玩家過關，真可惜。"
BIAN_SHEN_VOICE_3 = "變身大賽結束了，本次活動共有%s個玩家過關，記得在下次比賽開始前來我這裡領取獎勵哦!"
BIAN_SHEN_VOICE_4 = "我要變成%s！"
BIAN_SHEN_VOICE_5 = "啊哈哈，被騙了吧，啊哈哈！"
BIAN_SHEN_VOICE_6 = "你被淘汰了。本次比賽你闖到了第%d輪，下次再努力！"
BIAN_SHEN_VOICE_7 = "淘汰出局"
BIAN_SHEN_VOICE_8 = "本輪有%s位玩家過關，%s個玩家被淘汰"

#------------------------------------------------------------------------------------------------------------------------
#天降奇獸
#------------------------------------------------------------------------------------------------------------------------
TIANJIANGQISHOUMGR_NOTICE_1 = "天降奇獸活動正在進行，%i點%i分試圖再次開啟天降奇獸活動。"
TIANJIANGQISHOUMGR_NOTICE_2 = "天降奇獸活動已經結束，%i點%i分試圖再次結束天降奇獸活動。"





CELL_WXMONSTER_2 = "以%s為首的金烏勇士們"

#------------------------------------------------------------------------------------------------------------------------
#寶盒
#------------------------------------------------------------------------------------------------------------------------
BAO_HE_VOICE_1 = "我是寶藏的守衛者,想拿走寶藏,沒門！"
BAO_HE_VOICE_2 = "上古老妖精"
BAO_HE_VOICE_3 = "老子在地下憋了幾千年了,終於可以透透氣了,弟兄們,快跑啊!"
BAO_HE_VOICE_4 = "%s偷偷挖掘上古寶藏,結果觸動了鎮壓上古老妖精的機關,3個上古老妖精向%s逃去,企圖再次危害人間,大家快去消滅它們!"



#------------------------------------------------------------------------------------------------------------------------
#武道大會
#------------------------------------------------------------------------------------------------------------------------
ACTIVITY_WU_DAO_DA_HUI					 			= "武道大會"
WU_DAO_DA_HUI_VOICE_1 								= "%s神功蓋世，所向披靡，獲得%i-%i等級組武道大會比賽冠軍。"
WU_DAO_DA_HUI_VOICE_2								= "本次武道大會你所在等級組報名人數已滿，請下次趕早！"
WU_DAO_DA_HUI_VOICE_3								= "您已經報名成功，比賽即將開始，請耐心等待！"
WU_DAO_DA_HUI_VOICE_4								= "報名成功，比賽將於10分鐘內開始，請不要離開太遠，做好戰鬥準備！"
WU_DAO_DA_HUI_VOICE_5								= "現在不是武道大會活動的報名時間，活動將於每星期日10：00-10：10接受報名，請屆時參加。"



#------------------------------------------------------------------------------------------------------------------------
#牛魔王
#------------------------------------------------------------------------------------------------------------------------
NIU_MO_WANG_VOICE_1									="老牛~！受死吧！"
NIU_MO_WANG_VOICE_2					="打不起嘛我還躲不起嘛我？"
NIU_MO_WANG_VOICE_3				="來人~把這礙事的家伙給剁了~"
NIU_MO_WANG_VOICE_4				="這次就放過你~下次別讓我見到你~！"
NIU_MO_WANG_VOICE_5			  	= "@S{4}先把你手頭的事情干完再找我，俺老牛不喜歡人多欺人少。"
NIU_MO_WANG_VOICE_6			  	= "@S{4}1、2、3、4、5、6、7~~~~我的姑娘在哪裡~~~~"
NIU_MO_WANG_VOICE_9								= "你沒有資格從我這裡得到任何東西!"
NIU_MO_WANG_VOICE_10								= "我一定會再回來的！！！"
NIU_MO_WANG_VOICE_11					 				= "要打就一起來吧，反正多一個不多，少一個不少！"
NIU_MO_WANG_NOTICE_01							= "牛魔王活動正在進行，%i點%i分試圖再次開啟牛魔王活動。"
NIU_MO_WANG_NOTICE_02							= "牛魔王活動已經結束，%i點%i分試圖再次結束牛魔王活動。"


#------------------------------------------------------------------------------------------------------------------------
#千年毒蛙
#------------------------------------------------------------------------------------------------------------------------
QIAN_NIAN_DU_WA_VOICE_1							="讓我鏟除這個污染源頭！"
QIAN_NIAN_DU_WA_VOICE_2				="這家伙我惹不起，我還是走吧！"
QIAN_NIAN_DU_WA_VOICE_3			="小家伙們~上！呱呱.."
QIAN_NIAN_DU_WA_VOICE_4				 = "@S{4}送死何必著急？先結束你的戰鬥再來找我。"
QIAN_NIAN_DU_WA_VOICE_5				 = "@S{4}。。。呱呱。。。呱呱。。。"
QIAN_NIAN_DU_WA_VOICE_8					 = "不！我不會失敗的!"
QIAN_NIAN_DU_WA_NOTICE_1					  		= "千年毒蛙活動正在進行，%i點%i分試圖再次開啟千年毒蛙活動。"
QIAN_NIAN_DU_WA_NOTICE_2					  		= "千年毒蛙活動已經結束，%i點%i分試圖再次結束千年毒蛙活動。"
CELL_GOSSIP_OBJECTSCRIPT_TOXINFROG_0	="讓我鏟除這個污染源頭！"
CELL_GOSSIP_OBJECTSCRIPT_TOXINFROG_1	="這家伙我惹不起，我還是走吧！"
CELL_GOSSIP_OBJECTSCRIPT_TOXINFROG_2	="小家伙們~上！呱呱.."


#------------------------------------------------------------------------------------------------------------------------
#帳號
#------------------------------------------------------------------------------------------------------------------------
ACCOUNT_NOTICE_1				= "進入選擇角色畫面"
ACCOUNT_NOTICE_2				= "賬號開始排隊"
ACCOUNT_NOTICE_3				= "賬號在別處登陸"
ACCOUNT_NOTICE_4				= "人物被銷毀,賬號下線"
ACCOUNT_NOTICE_5				= "Lose Cell,賬號下線"
ACCOUNT_NOTICE_6				= "賬號下線"
ACCOUNT_NOTICE_7						= "_改名"


#------------------------------------------------------------------------------------------------------------------------
#倉庫
#------------------------------------------------------------------------------------------------------------------------
BANK_NOTICE_1					= "存入倉庫"
BANK_NOTICE_2					= "倉庫取出物品"
BANK_NOTICE_3					= "倉庫銷毀物品"
BANK_NOTICE_4					= "天幣票兌換"



#------------------------------------------------------------------------------------------------------------------------
#baseEntity
#------------------------------------------------------------------------------------------------------------------------
BASEAPPENTITY_NOTICE_0			= "服務器將在%i秒後停機維護，請大家立即下線。"
BASEAPPENTITY_NOTICE_1			= "服務器將在%i分%i秒後停機維護，請大家盡快下線。"
BASEAPPENTITY_NOTICE_2			= "服務器將在%i分鐘後停機維護，請大家盡快下線。"
BASEAPPENTITY_NOTICE_3			= "服務器將在%i分後停機維護，請大家盡快下線。"



#------------------------------------------------------------------------------------------------------------------------
#技能
#------------------------------------------------------------------------------------------------------------------------
SKILL_DES_JIAN_ZHUANG				= "健壯"
SKILL_DES_PU_TONG_WU_LI_GONG_JI		= "普通物理攻擊"
SKILL_DES_MENG_JI				= "猛擊"
SKILL_DES_CHUAN_SONG				= "傳送"
SKILL_DES_ZHUO_YUE				= "卓越"
SKILL_DES_KUAI_JIAN				= "快劍"
SKILL_DES_MIN_RUI				= "敏銳"
SKILL_DES_JIN_SHE				= "勁射"
SKILL_DES_CONG_HUI				= "聰慧"
SKILL_DES_BING_ZHUI_SHU				= "冰錐術"


#------------------------------------------------------------------------------------------------------------------------
#嘟嘟豬
#------------------------------------------------------------------------------------------------------------------------
DUDUZHU_NOTICE_1								= "嘟嘟豬活動正在進行，%i點%i分試圖再次開啟嘟嘟豬活動。"
DUDUZHU_NOTICE_2								= "嘟嘟豬活動已經結束，%i點%i分試圖再次結束嘟嘟豬活動。"
DUDUZHU_CHUAN_SONG_DIAN			 	= "嘟嘟豬傳送點"


#------------------------------------------------------------------------------------------------------------------------
#家族
#------------------------------------------------------------------------------------------------------------------------
FAMILY_INFO_1						= "加入家族"
FAMILY_INFO_2						= "系統"
FAMILY_INFO_3			= "您成功加入了家族[%s]。"
FAMILY_INFO_4			= "%s加入了家族。"
FAMILY_INFO_5			= "退出家族:操作者自己"
FAMILY_INFO_6					= "您已經離開了家族[%s]!"
FAMILY_INFO_7			= "創建家族"
FAMILY_INFO_8			= "解散家族"


#------------------------------------------------------------------------------------------------------------------------
#科舉
#------------------------------------------------------------------------------------------------------------------------
KE_JU_VOICE_1		= "@S{4}非常可惜，您這次科舉鄉試失敗了，還是下次再來吧。"
KE_JU_VOICE_2		  = "@S{4}智慧的勇士，您已經參加過這次科舉鄉試了，請下次再來吧。"
KE_JU_VOICE_3		  = "@S{4}勇士，你還沒有參加科舉鄉試的資格，請繼續努力吧。"
KE_JU_VOICE_4		= "@S{4}你不是正在考試麼，怎麼跑我這裡來了，快點回去答題，超過了時間可就麻煩了。"
KE_JU_VOICE_5				= "@S{4}勇士，你還沒有參加科舉會試的資格，請繼續努力吧。"
KE_JU_VOICE_6		= "@S{4}非常可惜，您這次科舉會試失敗了，還是下次再來吧。"
KE_JU_VOICE_7		  = "@S{4}智慧的勇士，您已經參加完這次科舉會試了，您的成績正在統計中，請耐心等待。如果您對您的成績不滿意，您可以在科舉會試結束之前進行補考，共有三次補考的機會，不過需要繳納一定的金錢。我們會取成績最好的一次作為您最終的成績。"
KE_JU_VOICE_8		 = "@S{4}尊敬的勇士，現在科舉考試尚未召開，請在科舉開始後再來找我吧。"
KE_JU_VOICE_9		= "@S{4}歡迎參加下周的科舉考試，並預祝您取得好成績。"
KE_JU_VOICE_10		 = "@S{4}您已經參加過殿試考試了，請密切關注您的郵箱看是否取得了成績，如果您取得了成績，要及時來領取獎勵，過期作廢。"
KE_JU_VOICE_11		 = "@S{4}會試一天只能補考三次，您今天已經不能再補考!"
KE_JU_VOICE_12		 = "@S{4}補考需要繳納%s，您的金錢不足。"
KE_JU_VOICE_13		 = "補考需要消耗%s,你確定要補考麼?"
KE_JU_VOICE_14		= "%s%i/%i(正確: %s)"
KE_JU_VOICE_15		= "%i / %i(正確: %s)"
KE_JU_VOICE_16		= "現在可以去%d號考官處考試了"
KE_JU_VOICE_17		  = "@S{4}您必須放棄已失敗的科舉任務才能重新進行科舉考試。"
KE_JU_VOICE_18		  = "%s分%s秒"
KE_JU_VOICE_19		= "恭喜: 您獲得舉人資格, 請及時來我這裡領取舉人資格獎勵，過期將作廢。並請於本周日準時參加殿試吧!"
KE_JU_VOICE_20		= "恭喜: 您獲得進士資格, 請及時來我這裡領取獎勵!過期不領取將作廢。"
KE_JU_VOICE_21		= "殿試考官"
KE_JU_VOICE_22		= "科舉報名官員(會試考官)"
KE_JU_VOICE_23		= "科舉考試會試結果"
KE_JU_VOICE_24		= "科舉考試殿試結果"
KE_JU_YI_JI_CAI_LIAO		= "一級材料"
KE_JU_ER_JI_CAI_LIAO		= "二級材料"
KE_JU_SAN_JI_CAI_LIAO		= "3級材料"
KE_JU_SI_JI_CAI_LIAO		= "四級材料"
KE_JU_WU_JI_CAI_LIAO		= "五級材料"
KE_JU_CHU_JI_XING_YUN_SHI		= "初級幸運石"
KE_JU_GAO_JI_XING_YUN_SHI		= "高級幸運石"
KE_JU_KE_JU_XIANG_SHI		= "科舉鄉試"
KE_JU_KE_JU_HUI_SHI	 	= "科舉會試"
KE_JU_KE_JU_DIAN_SHI		= "科舉殿試"
KE_JU_SHUANG		 = "雙"
KE_JU_SAN		= "三"
KE_JU_SI		= "四"
KE_JU_WU		= "五"
KE_JU_LIU		 = "六"
KE_JU_QI		= "七"
KE_JU_BA		 = "八"
KE_JU_JIU		 = "九"
KE_JU_SHI		 = "十"
KE_JU_ER		= "二"
KE_JU_INFO_1					= "@L{t='1號考官($xz{10111184})';m=goto:10111184;cfc=c4;hfc=c3}"
KE_JU_INFO_2					= "@L{t='2號考官($xz{10111185})';m=goto:10111185;cfc=c4;hfc=c3}"
KE_JU_INFO_3					= "@L{t='3號考官($xz{10111186})';m=goto:10111186;cfc=c4;hfc=c3}"
KE_JU_INFO_4					= "@L{t='4號考官($xz{10111187})';m=goto:10111187;cfc=c4;hfc=c3}"
KE_JU_INFO_5					= "@L{t='5號考官($xz{10111188})';m=goto:10111188;cfc=c4;hfc=c3}"
KE_JU_INFO_6					= "@L{t='6號考官($xz{10111189})';m=goto:10111189;cfc=c4;hfc=c3}"
KE_JU_INFO_7					= "@L{t='7號考官($xz{10111190})';m=goto:10111190;cfc=c4;hfc=c3}"
KE_JU_INFO_8					= "@L{t='8號考官($xz{10111191})';m=goto:10111191;cfc=c4;hfc=c3}"
KE_JU_INFO_9					= "@L{t='9號考官($xz{10111192})';m=goto:10111192;cfc=c4;hfc=c3}"
KE_JU_INFO_10					= "@L{t='10號考官($xz{10111193})';m=goto:10111193;cfc=c4;hfc=c3}"
KE_JU_INFO_11					= "@L{t='11號考官($xz{10111194})';m=goto:10111194;cfc=c4;hfc=c3}"
KE_JU_INFO_12					= "@L{t='12號考官($xz{10111195})';m=goto:10111195;cfc=c4;hfc=c3}"
KE_JU_INFO_13					= "@L{t='13號考官($xz{10111196})';m=goto:10111196;cfc=c4;hfc=c3}"
KE_JU_INFO_14					= "@L{t='14號考官($xz{10111197})';m=goto:10111197;cfc=c4;hfc=c3}"
KE_JU_INFO_15					= "@L{t='15號考官($xz{10111198})';m=goto:10111198;cfc=c4;hfc=c3}"


#------------------------------------------------------------------------------------------------------------------------
#GM管理器
#------------------------------------------------------------------------------------------------------------------------
GMMGR_ABC_FENG_SUO_ZHANG_HAO_3600			= "abc 封鎖帳號 3600"
GMMGR_ZHUANG_TAI			= "狀態"
GMMGR_WEI_ZHI			= "位置"
GMMGR_JIN_QIAN			= "金錢"
GMMGR_CANG_KU			= "倉庫"
GMMGR_BEI_BAO			= "背包"
GMMGR_JI_NENG			= "技能"
GMMGR_DENG_LU			= "登陸"
GMMGR_SHANG_CI_DENG_LU			= "上次登陸"
GMMGR_ZHANG_HAO			= "帳號"
GMMGR_BO_ZHUO			= "捕捉"
GMMGR_DAO_DA			= "到達"
GMMGR_TI_REN			= "踢人"
GMMGR_ZAI_XIAN_REN_SHU			= "在線人數"
GMMGR_FENG_SUO_ZHANG_HAO			= "封鎖帳號"
GMMGR_ZAI_XIAN_MING_ZI			= "在線名字"
GMMGR_SHUA_GUAI_SU_DU			= "刷怪速度"
GMMGR_CHONG_WU_LING_XING_ZHI			= "寵物靈性值"
GMMGR_CHONG_WU_SHOU_MING			= "寵物壽命"
GMMGR_CHONG_WU_KUAI_LE_DU			= "寵物快樂度"
GMMGR_CHONG_WU_FAN_ZHI			= "寵物繁殖"



#------------------------------------------------------------------------------------------------------------------------
#混沌入侵
#------------------------------------------------------------------------------------------------------------------------
HUN_DUN_RU_QIN_NOTICE_1								= "混沌入侵活動正在進行，%i點%i分試圖再次開啟混沌入侵活動。"
HUN_DUN_RU_QIN_NOTICE_2								= "混沌入侵活動已經結束，%i點%i分試圖再次結束混沌入侵活動。"
HUN_DUN_RU_QIN_CHUAN_SONG_DIAN		= "混沌入侵傳送點"


#------------------------------------------------------------------------------------------------------------------------
#怪物攻城
#------------------------------------------------------------------------------------------------------------------------
MONSTERACTIVITYMGR_NOTICE_1						= "兵臨城下活動正在進行，%i點%i分試圖再次開啟兵臨城下活動。"
MONSTERACTIVITYMGR_NOTICE_2						= "兵臨城下活動已經結束，%i點%i分試圖再次結束兵臨城下活動。"
ACTIVITY_MONSTERACTIVITY			        	= "怪物入侵"
MONSTERACTIVITY_GONGCHENG								 	= "怪物攻城"
MONSTERACTIVITY_VOICE_1				= "你還沒有資格來挑戰我，先去完成之前的挑戰吧！"
MONSTERACTIVITY_VOICE_2				= "你終於來了，我已經等你多時了！做好戰鬥準備了嗎？"
MONSTERACTIVITY_VOICE_3				= "你已經把我打敗了，趕緊回去領獎吧"
MONSTERACTIVITY_VOICE_4				= "以你現在的實力，應該去完成更高的挑戰，何必來找我的麻煩呢？"
MONSTERACTIVITY_VOICE_5		= "@S{4}我不想欺負你，等你離開戰鬥我再和你較量!"
MONSTERACTIVITY_VOICE_6		= "@S{4}%s是我們的，你別想阻止我們！"
MONSTERACTIVITY_VOICE_7								= "你是誰？想惹惱我麼，哼哼……"
MONSTERACTIVITY_VOICE_8			= "是軍師派你來的？就憑你也想除掉我？找死！"
MONSTERACTIVITY_VOICE_9			= "出來混，遲早都要還的。現在我還給你了……"

#------------------------------------------------------------------------------------------------------------------------
#寵物
#------------------------------------------------------------------------------------------------------------------------
PETPROCREATIONMGR_VOICE_1				= "寵物繁殖成功了"
PETPROCREATIONMGR_VOICE_2				= "寵物繁殖成功了，請在48小時內領取，逾時會被放生。"
PETSTORAGE_INFO_1						= "租用寵物倉庫"
PETSTORAGE_INFO_2						= "取出寵物"
PETTRAINER_INFO_1						= "寵物代練石沖值"
PET_TYPE_LI_LIANG							= "力量型"
PET_TYPE_MI_JIE						 		= "敏捷型"
PET_TYPE_ZHI_LI								= "智力型"
PET_TYPE_JUN_HENG					 		= "均衡型"
PET_SHUXING_TISHI						 	= "體質屬性"
PET_SHUXING_LILIANG						 	= "力量屬性"
PET_SHUXING_ZHILI						 	= "智力屬性"
PET_SHUXING_MIJIE						 	= "敏捷屬性"


#------------------------------------------------------------------------------------------------------------------------
#點卡寄售
#------------------------------------------------------------------------------------------------------------------------
POINT_CARD_INFO_1							= "寄售點卡成功"
POINT_CARD_INFO_2					= "你寄售的點卡(卡號:%s)已經成功賣出。"
POINT_CARD_INFO_3					= "交易成功"
POINT_CARD_INFO_4					= "天幣將在稍後充值入你的帳戶，請及時查看。如果24小時內沒有天幣到賬，請和GM聯繫。"
POINT_CARD_INFO_5						= "寄售點卡失敗"
POINT_CARD_INFO_6					= "你寄售的點卡(卡號:%s)帳號和密碼有誤，已經下架，押金沒收。"
POINT_CARD_INFO_7							= "交易失敗"
POINT_CARD_INFO_8					= "購買的點卡信息有誤，已經下架，本郵件包含本次交易費用，請取回。"
POINT_CARD_INFO_9					= "你寄售的點卡(卡號:%s)已經使用，已經下架，押金沒收。"
POINT_CARD_INFO_10					= "這次寄售交易出錯。本郵件包含本次交易費用，請取回。"
POINT_CARD_INFO_11					= "你寄售的點卡(卡號:%s)之前已被封號，不能使用，押金沒收。"
POINT_CARD_INFO_12					= "點卡(卡號:%s)不存在或未激活，押金沒收。"
POINT_CARD_INFO_13					= "寄售的點卡信息有誤，已經下架，本郵件包含本次交易費用，請取回。"
POINT_CARD_INFO_14					= "你寄售的點卡(卡號:%s)面值不符，請重新寄售，上次寄售的押金沒收。"
POINT_CARD_INFO_15					= "點卡寄售"
POINT_CARD_INFO_16					= "你寄售的點卡（卡號：%s）在有效時間內無人購買，該點卡依然有效，押金沒收。"


#------------------------------------------------------------------------------------------------------------------------
#春節活動
#------------------------------------------------------------------------------------------------------------------------
CHUN_JIE_QUIZGAMEMGR_0					= "春節活動獎勵派發錯誤。"


#------------------------------------------------------------------------------------------------------------------------
#角色相關
#------------------------------------------------------------------------------------------------------------------------
ROLE_INFO_1											= "人物下線"
ROLE_INFO_2						            = "人物上線"
ROLE_INFO_3						            = "lose cell，人物下線"
ROLE_INFO_4						            = "人物注銷到登錄界面"
ROLE_INFO_5						            = "@B@S{4}本周在線時間：%i時%i分%i秒"
ROLE_INFO_6					            = "某人"
ROLE_INFO_7					            = "玩家代練石沖值"
ROLE_INFO_8				            = "使用天幣答題"
ROLE_INFO_9							= "]、["
ROLE_INFO_10						 				= "普通"
ROLE_INFO_11											= "刻苦"
ROLE_INFO_12						 			= "帶血的"
ROLE_STATE_FREE									= "自由狀態"
ROLE_STATE_DIE						        	= "死亡狀態"
ROLE_STATE_XIUXI					        	= "休息狀態"
ROLE_STATE_FIGHT						        	= "戰鬥狀態"
ROLE_STATE_WEIJUE						        	= "未決狀態"
ROLE_STATE_GUAIQI						        	= "掛起狀態"
ROLE_STATE_BAITAN						        	= "擺攤狀態"
ROLE_STATE_BISAI						        	= "比賽狀態"
ROLE_STATE_BIANSHEN						        	= "變身狀態"
ROLE_STATE_WENDA						        	= "問答狀態"




#------------------------------------------------------------------------------------------------------------------------
#商城
#------------------------------------------------------------------------------------------------------------------------
SHANG_CHENG_INFO_1								= "商城購買物品(id:%s,amount:%s)"
SHANG_CHENG_INFO_2										= "商城自動購買物品(id:%s,amount:%s)"


#------------------------------------------------------------------------------------------------------------------------
#幫會城戰
#------------------------------------------------------------------------------------------------------------------------
TONGCITYWAR_VOICE_1					= "%i年%i月%i日%i時%i分"
TONGCITYWAR_VOICE_2			  		= "%s將%s的稅收調整為%i%%！"
TONGCITYWAR_VOICE_3			  		= "你沒有權限查看!"
TONGCITYWAR_VOICE_4			  		= "當前稅收:%s"
TONGCITYWAR_VOICE_5			  		= "當前稅收:0銅"
TONGCITYWAR_VOICE_6			  		= "@B您幫會當前競價金額：%s"
TONGCITYWAR_VOICE_7			  		= "當前還沒有競爭者!"
TONGCITYWAR_VOICE_8			  		= "沒有任何記錄!"
TONGCITYWAR_VOICE_9			  		= "沒找到幫主[%i]"
TONGCITYWAR_VOICE_10			  		= "本輪的城市爭奪戰結束"
TONGCITYWAR_VOICE_11					= "地區"
TONGCITYWAR_VOICE_12				 	= ",%s幫會和%s幫會平局"
TONGCITYWAR_VOICE_13				 	= ",%s戰勝%s幫會"
TONGCITYWAR_VOICE_14					= "西南虎威"
TONGCITYWAR_VOICE_15					= "@S{4}你都沒有錢，還來找我幹什麼，你是想要我施舍你麼？"
TONGCITYWAR_SHOU_FANG_TONG_SHUAI	    	= "守方統帥"

TONGCITYWAR_WU_PIN						= "物品"
TONGCITYWAR_XI_NAN_HU_WEI				= "西南虎威"
TONGCITYWAR_DONG_NAN_HU_WEI        		= "東南虎威"
TONGCITYWAR_DONG_BEI_FENG_XIANG        	= "東北鳳翔"
TONGCITYWAR_XI_BEI_FENG_XIANG        	= "西北鳳翔"
TONGCITYWAR_BANG_HUI_CHENG_SHI_ZHAN	 	= "幫會城市戰"
TONGCITYWAR_SHOU_FANG		= "守方"
TONGCITYWAR_SHOU_FANG_JIANG_LING		= "守方將領"
TONGCITYWAR_GONG_FANG_JIANG_LING		= "攻方將領"
TONGCITYWAR_SHOU_FANG_CHUAN_SONG_YUAN		= "守方傳送員"
TONGCITYWAR_GONG_FANG_CHUAN_SONG_YUAN		= "攻方傳送員"
TONGCITYWAR_WO		= "我"
TONGCITYWAR_JIN_RU		= "進入"
TONGCITYWAR_DI		= "敵"
TONGCITYWAR_LI_KAI		= "離開"

#------------------------------------------------------------------------------------------------------------------------
#替售
#------------------------------------------------------------------------------------------------------------------------
TI_SHOU_INFO_1											= "寵物"
TI_SHOU_INFO_2					 			= "替售信息"
TI_SHOU_INFO_3					 			= "您的NPC寄售商店已經結束，請領取剩餘金錢和物品！"



#------------------------------------------------------------------------------------------------------------------------
#幫會
#------------------------------------------------------------------------------------------------------------------------
TONG_INFO_1								= "加入幫會"
TONG_INFO_2						 			= "幫會遣散費"
TONG_INFO_3							= "你離開了幫會，幫會將會給你一定的遣散費。"
TONG_INFO_4								= "幫主工資發放"
TONG_INFO_5								= "你的努力使幫會日益壯大，請繼續加油。"
TONG_INFO_6							= "副幫主工資發放"
TONG_INFO_7							= "幫會日益壯大離不開你，請繼續加油。"
TONG_INFO_8							= "建設度"
TONG_INFO_9							= "幫會等級"
TONG_INFO_10							= "行動力"
TONG_INFO_11						    = "聲望值"
TONG_INFO_12						    = "後勤值"
TONG_INFO_13						    = "研究度"
TONG_INFO_14						    = "幫會自動解散"
TONG_INFO_15						    = "由於貴幫會7天內累計上線人數不足5人，自動解散！"
TONG_INFO_16						    = "創建幫會"
TONG_INFO_17						    = "歡迎加入!"
TONG_INFO_18									= "解散幫會"
TONG_INFO_19						= "@B您的幫會積分:%i"
TONG_INFO_20					 		= "幫會建築維護費拖欠%s，如果在%s之前未及時補充幫會資金幫會將下降一級。"
TONG_INFO_21					 		= "幫會降級警告"
TONG_INFO_22					 		= "幫會建築維護費拖欠%s，幫會將在%s自動解散。"
TONG_INFO_23					 		= "幫會解散警告"
TONG_INFO_24					 			= "幫會領地"
TONG_INFO_25					 = "幫會任命通知"
TONG_INFO_26					= "老幫主已經隱退，您成為【%s】幫會的新幫主。"
TONG_ZHIYE_BANG_ZHU				= "幫主"
TONG_ZHIYE_FU_BANG_ZHU				= "副幫主"
TONG_ZHIYE_HU_FA				= "護法"
TONG_ZHIYE_TANG_ZHU				= "堂主"
TONG_ZHIYE_SHANG_REN				= "商人"
TONG_ZHIYE_XIAO_TOU_MU				= "小頭目"
TONG_ZHIYE_JING_YING				= "精英"
TONG_ZHIYE_LOU_LUO				= "嘍囉"


SHARE_YONG_HENG_ZHI_GUANG					  		= "永恒之光"

#------------------------------------------------------------------------------------------------------------------------
#賽馬
#------------------------------------------------------------------------------------------------------------------------
ACTIVITY_SAI_MA											= "賽馬"

#------------------------------------------------------------------------------------------------------------------------
#運鏢
#------------------------------------------------------------------------------------------------------------------------
DART_INFO_1				 	= "運鏢"
DART_INFO_2					 				= "興隆鏢局"
DART_INFO_3					 				= "昌平鏢局"
DART_INFO_4					 			= "鏢車"
DART_INFO_5						= "@S{4}你正在幫敵對鏢局做事呢吧，你還以為我不知道？算了,我不想同你講話。。。"
DART_INFO_6				  		= "@S{4}想放棄任務，總要先接受本鏢局的任務吧？真是服了你了。。。"

#------------------------------------------------------------------------------------------------------------------------
#闖天關
#------------------------------------------------------------------------------------------------------------------------
TIAN_GUAN_MONSTER_DEF_1					= "闖天關"
TIAN_GUAN_MONSTER_DEF_2					= "闖天關副本"
TIAN_GUAN_MONSTER_DEF_3			  		= "大力"
TIAN_GUAN_MONSTER_DEF_4			  	    = "潑法"
TIAN_GUAN_MONSTER_DEF_5			  	    = "永固"
TIAN_GUAN_MONSTER_DEF_6			        = "飛星"
TIAN_GUAN_MONSTER_DEF_7			        = "天罡"
TIAN_GUAN_MONSTER_DEF_8			        = "甲子神"
TIAN_GUAN_MONSTER_DEF_9			        = "丁丑神"
TIAN_GUAN_MONSTER_DEF_10			        = "甲寅神"
TIAN_GUAN_MONSTER_DEF_11			        = "丁卯神"
TIAN_GUAN_MONSTER_DEF_12			        = "甲辰神"
TIAN_GUAN_MONSTER_DEF_13				    = "丁已神"
TIAN_GUAN_MONSTER_DEF_14				    = "甲午神"
TIAN_GUAN_MONSTER_DEF_15				    = "丁未神"
TIAN_GUAN_MONSTER_DEF_16				    = "甲申神"
TIAN_GUAN_MONSTER_DEF_17				    = "丁酉神"
TIAN_GUAN_MONSTER_DEF_18				    = "殉"
TIAN_GUAN_MONSTER_DEF_19				    = "義"
TIAN_GUAN_MONSTER_DEF_20				    = "夭"
TIAN_GUAN_MONSTER_DEF_21				    = "仁"
TIAN_GUAN_MONSTER_DEF_22				    = "慈"
TIAN_GUAN_MONSTER_DEF_23				    = "將"


#------------------------------------------------------------------------------------------------------------------------
#水晶副本
#------------------------------------------------------------------------------------------------------------------------
ACTIVITY_SHUIJING										= "水晶副本"
SHUIJING_INFO_1									= "水晶精靈副本"

#------------------------------------------------------------------------------------------------------------------------
#潛能亂鬥
#------------------------------------------------------------------------------------------------------------------------
ACTIVITY_QIAN_NENG_LUAN_DOU							= "潛能亂鬥"
QIAN_NENG_LUAN_DOU_INFO_1								= "潛能點"
QIAN_NENG_LUAN_DOU_INFO_2								= "潛能亂鬥副本"

#------------------------------------------------------------------------------------------------------------------------
#經驗亂鬥
#------------------------------------------------------------------------------------------------------------------------
ACTIVITY_JING_YAN_LUAN_DOU								= "經驗亂鬥"
JING_YAN_LUAN_DOU_INFO_1										= "點經驗"
JING_YAN_LUAN_DOU_INFO_2											= "您"
JING_YAN_LUAN_DOU_INFO_3							  	= "經驗亂鬥副本"

#------------------------------------------------------------------------------------------------------------------------
#組隊競技
#------------------------------------------------------------------------------------------------------------------------
ACTIVITY_ZU_DUI_JING_JI									= "%s的隊伍在組隊競技中獲得第一名，可以到戰八方那獲得豐厚獎勵！"
ZU_DUI_JING_JI_INFO_1			    = "組隊競賽玩家 %s 的名次是 %s."
ZU_DUI_JING_JI_INFO_2			    = "%s隊伍獲得這次組隊競賽第一名，將可以在戰八方處領取豐厚獎勵！"

#------------------------------------------------------------------------------------------------------------------------
#關係系統
#------------------------------------------------------------------------------------------------------------------------
ROLERELATION_INFO_1							= "戀人關係解除了"
ROLERELATION_INFO_2				        	= "與你分手，真絕情。"
ROLERELATION_INFO_3						    = "師徒關係解除了"
ROLERELATION_INFO_4				        	= "%s已經55級可以獨當一面，離開了師父的懷抱！"
ROLERELATION_INFO_5				        	= "玩家"
ROLERELATION_INFO_6				        	= "和你解除了師徒關係。"
ROLERELATION_INFO_7			 	        	= "天上人間幣"
ROLERELATION_INFO_8			 	        	= "拜師贈送物品"
ROLERELATION_INFO_9			 	        	= "恭喜您獲得拜師成功贈送的物品，請注意收取郵件內的附件物品。"
ROLERELATION_INFO_10			 	        	= "出師贈送物品"
ROLERELATION_INFO_11			 	        	= "恭喜，請注意收取郵件內的附件物品。"
ROLERELATION_INFO_12			 	        	= "徒弟升級獲贈物品"

#------------------------------------------------------------------------------------------------------------------------
#潛能副本
#------------------------------------------------------------------------------------------------------------------------
POTENTIAL_VOICE1	 	= "潛能任務"
POTENTIAL_VOICE2		= "你就是他們派來找我麻煩的？"
POTENTIAL_VOICE3		= "真是不知天高地厚的家伙，你那點三腳貓的功夫還遠遠不夠看啊！"
POTENTIAL_VOICE4		= "我。。。我。。。我真的不怕你，恩，不怕你。"
POTENTIAL_VOICE5		= "我想你一定是認錯人了，你要找的那個誰誰在那邊。"
POTENTIAL_VOICE6		= "好吧，既然你都找到這來了，那麼，單挑還是群毆，你選吧！"
POTENTIAL_VOICE7		= "你們，還沒有準備好！"
POTENTIAL_VOICE8		= "還沒有人能在我面前走過三個照面，你也想試試？"
POTENTIAL_VOICE9		= "我說，你們還是回家洗洗睡了吧，何必自討苦吃。"
POTENTIAL_VOICE10		= "此山是我開，此樹是我栽，要打此路過，留下買路財！"
POTENTIAL_VOICE11		= "我是不會和你動手的，有多遠走多遠。"
POTENTIAL_VOICE12		= "難道說你也要來插一腳嗎？沒關係，來多少都照收！"
POTENTIAL_VOICE13		= "還不服輸嗎？"
POTENTIAL_VOICE14		= "@S{4}我瞧你目前身體單薄，實戰經驗還差太多，不適合潛能的修煉，萬一有個閃失，我可擔當不起，晚些再來吧。"
POTENTIAL_VOICE15		= "%s的試煉"
POTENTIAL_VOICE16		= "消滅%s"
POTENTIAL_VOICE17		= "@S{4}%s的@L{t='%s($xz{%s})';m=goto:%s;cfc=c4;hfc=c3}請你去消滅在%s野外@L{t='$area{%s,%s,%s,%s,%s}';m=goto:%s;cfc=c4;hfc=c3}的@L{t='%s%s';m=goto:%s;cfc=c4;hfc=c3}。"
POTENTIAL_VOICE18		= "@S{4}既然你已經有了隊伍，還是請你的隊長來吧。"
POTENTIAL_VOICE19		= "@S{4}連這點小事也做不好，怎麼能讓我放心再給你任務呢？"
POTENTIAL_VOICE20		= "@S{4}學習技能所需要的潛能是在特別的戰鬥中得到的領悟。最近天下妖魔橫行，民不聊生，如果你能去把它們消滅掉，不僅為民除害，還能積累戰鬥經驗，你看如何？"
POTENTIAL_VOICE21		= "@S{4}好樣的！總算沒有辜負我對你的期望！"
POTENTIAL_VOICE22		= "@S{4}妖孽仍在猖狂，請速去剿滅！"
POTENTIAL_VOICE23		= "@S{4}莫非是這個試煉對你來說還是太難了？好吧，既然你執意要這麼做，我也不會為難你，只是需要你去反省一段時間，遲一些才能再來，你可願意？"
POTENTIAL_VOICE24		= "@S{4}很好！我已經為你安排好了這次試煉，@L{t='%s(%i,%i)';m=goto:%s;cfc=c4;hfc=c3}正在%s野外的@L{t='$area{%s,%s,%s,%s,%s}';m=goto:%s;cfc=c4;hfc=c3}肆虐，這件事就交給你了，別讓我失望。"
POTENTIAL_VOICE25		= "@S{4}強壯的勇士啊，請幫助我剿滅匪徒吧。"
POTENTIAL_VOICE26		= "消滅匪徒"
POTENTIAL_VOICE27		= "看你樣子挺強的，來較量較量吧！"
POTENTIAL_VOICE28       = "朋友，是否願與我比試比試！"
POTENTIAL_VOICE29       = "請賜教！"
POTENTIAL_VOICE30       = "承讓，承讓，哈哈哈！"
POTENTIAL_VOICE31       = "你還是多練幾年吧！哈哈哈！"
POTENTIAL_VOICE32       = "呵呵呵，你比我想象中的還要弱！"
POTENTIAL_VOICE33       = "嗚嗚嗚，我輸了。"
POTENTIAL_VOICE34       = "我居然，居然敗了。"
POTENTIAL_VOICE35       = "大俠果然是人中龍鳳，小弟甘拜下風。"
POTENTIAL_VOICE36		= "解救被困的難民！"
POTENTIAL_SHAN_ZHAI_TIE_WEI		= "山寨鐵衛"
POTENTIAL_TIE_JIA_SHI_CONG		= "鐵甲侍從"
POTENTIAL_ZHONG_JIA_QIANG_DAO		= "重甲強盜"
POTENTIAL_BING_JIA_KUANG_CHONG		= "冰甲狂蟲"
POTENTIAL_DUO_WEN_YAO_BING		= "多聞妖兵"
POTENTIAL_YAO_HUA__REN			= "妖化鮫人"
POTENTIAL_ZHONG_JIA_JI_KUI		= "重甲機傀"
POTENTIAL_MAN_LI_XUE_REN		= "蠻力雪人"
POTENTIAL_FENG_MO_LONG_WANG		= "瘋魔龍王"
POTENTIAL_FENG_MO_LONG_REN		= "瘋魔龍人"
POTENTIAL_HUO_YUN_XIAN_FENG		= "火雲先鋒"
POTENTIAL_ZENG_HEN_NV_YAO		= "憎恨女妖"
POTENTIAL_WU_FA_MAO_YAO			= "巫法貓妖"
POTENTIAL_HU_MEI_YAO			= "狐媚妖"
POTENTIAL_MI_FA_YAO_REN			= "秘法妖人"
POTENTIAL_E_JING			= "蛾精"
POTENTIAL_HEI_YI_DA_PENG		= "黑翼大鵬"
POTENTIAL_YING_TOU_LIE_SHOU		= "鷹頭獵手"
POTENTIAL_JIAO_FEI			= "剿匪"
POTENTIAL_CHU_YAO			= "除妖"
POTENTIAL_JIANG_MO			= "降魔"
POTENTIAL_QIAN_NENG_FU_BEN		= "潛能副本"
POTENTIAL_ZHUA_YA			= "爪牙"
POTENTIAL_QIAN_NENG_FU_BEN_CHUAN_SONG_DIAN		= "潛能副本傳送點"
POTENTIAL_KUANG_BAO_HAN_FEI		= "狂暴悍匪"
POTENTIAL_XUN_SHAN_JING_BING		= "巡山精兵"
POTENTIAL_SHAN_ZHAI_MAN_BING		= "山寨蠻兵"
POTENTIAL_LIU_KOU_SHAO_TAN		= "流寇哨探"
POTENTIAL_SHAN_YE_E_ZEI			= "山野惡賊"
POTENTIAL_SHAN_ZHAI_CI_KE		= "山寨刺客"
POTENTIAL_SHAN_ZEI_ZHAO_LONG		= "山賊趙龍"
POTENTIAL_SHAN_ZEI_ZHANG_GUI		= "山賊張貴"
POTENTIAL_SHAN_ZEI_WAN_ZHONG		= "山賊萬盅"
POTENTIAL_SHAN_ZEI_HONG_WU		= "山賊洪五"
POTENTIAL_TU_FEI_XU_BA			= "土匪徐霸"
POTENTIAL_TU_FEI_WANG_MA_ZI		= "土匪王麻子"
POTENTIAL_TU_FEI_LIU_JIN	        = "土匪劉金"
POTENTIAL_TU_FEI_YANG_BIAO	        = "土匪楊表"
POTENTIAL_CAO_KOU_HUANG_XIN	        = "草寇黃信"
POTENTIAL_CAO_KOU_ZHANG_HUA	        = "草寇張華"
POTENTIAL_CAO_KOU_DUAN_LIU	        = "草寇段六"
POTENTIAL_CAO_KOU_JIN_QUAN	        = "草寇金全"
POTENTIAL_QIANG_DAO_ZHU_FENG	        = "強盜朱風"
POTENTIAL_QIANG_DAO_GUO_SAN	        = "強盜郭三"
POTENTIAL_QIANG_DAO_SUN_HAI	        = "強盜孫海"
POTENTIAL_QIANG_DAO_QIAN_SHU	        = "強盜錢書"
POTENTIAL_KUANG_BAO_SHOU_YAO	        = "狂暴獸妖"
POTENTIAL_HEI_SHAN_LAO_YAO	        = "黑山老妖"
POTENTIAL_ZHAO_ZE_YAO_WANG	        = "沼澤妖王"
POTENTIAL_SHI_XUE_KUANG_YAO	        = "嗜血狂妖"
POTENTIAL_MO_XING			= "魔形"
POTENTIAL_MO_YIN			= "魔音"
POTENTIAL_MO_YI				= "魔翼"
POTENTIAL_MO_CHUI			= "魔錘"
POTENTIAL_TU_FEI_MEI_WEN_HUA		= "土匪梅溫華"
POTENTIAL_SHAN_ZEI_BO_SHI_ZI		= "山賊卜士孜"
POTENTIAL_CAO_KOU_YI_GEN_JIN		= "草寇易根金"
POTENTIAL_NIU_MO_WANG			= "牛魔王"
POTENTIAL_DUO_LUO_TIAN_JIANG	        = "墮落天將"
POTENTIAL_HUANG_SHI_LAO_YAO	        = "黃獅老妖"
POTENTIAL_NIU_YAO_XIAO_JIANG	        = "牛妖小將"
POTENTIAL_HUN__TIAN_BING	        = "混沌天兵"
POTENTIAL_XUE_JIAN_YAO_JIANG	        = "血劍妖將"
POTENTIAL_SHEN_GONG_YAO_JIANG	        = "神弓妖將"
CELL_POTENTIALREFUGEE_1 = "解救被困的難民！"
POTENTIAL_MONSTER1	        = "地影刑天"
POTENTIAL_MONSTER2	        = "天兵"
POTENTIAL_MONSTER3	        = "三眼神將"
POTENTIAL_MONSTER4	        = "血牙蠻將"
POTENTIAL_MONSTER5	        = "滅世天王"
POTENTIAL_MONSTER6	        = "幽冥鬼劍師"
POTENTIAL_MONSTER7	        = "劍仙"
POTENTIAL_MONSTER8	        = "烈火劍聖"
POTENTIAL_MONSTER9	        = "沐雨師"
POTENTIAL_MONSTER10	        = "血羽妖"
POTENTIAL_MONSTER11	        = "飛天"
POTENTIAL_MONSTER12	        = "土行孫"
POTENTIAL_MONSTER13	        = "箍仙獸"
POTENTIAL_MONSTER14	        = "黑牛將"
POTENTIAL_MONSTER15	        = "天將"
POTENTIAL_MONSTER16	        = "女鬼王"
POTENTIAL_MONSTER17	        = "食月犬神"
POTENTIAL_MONSTER18	        = "冷面星官"
POTENTIAL_MONSTER19	        = "白鳥神弓"
#------------------------------------------------------------------------------------------------------------------------
#天降奇獸
#------------------------------------------------------------------------------------------------------------------------
TIAN_JIANG_QI_SHOU_INFO_1			= "天降奇獸傳送點"
TIAN_JIANG_QI_SHOU_INFO_2			= "天降神獸"



#------------------------------------------------------------------------------------------------------------------------
#三環副本
#------------------------------------------------------------------------------------------------------------------------
ACTIVITY_SHEN_GUI_MI_JING					 				= "神鬼秘境"
ACTIVITY_WU_YAO_QIAN_SHAO		= "巫妖前哨"
ACTIVITY_WU_YAO_WANG		 	= "巫妖王"


#------------------------------------------------------------------------------------------------------------------------
#任務相關
#------------------------------------------------------------------------------------------------------------------------
QUEST_INFO_1	 = "等級 %i - %i"
QUEST_INFO_2 			 = "職業要求：%s"
QUEST_INFO_3 			= "押金"
QUEST_INFO_4 		= "幫貢"
QUEST_INFO_5 		= "經驗值"
QUEST_INFO_6 		 = "經驗加成"
QUEST_INFO_7 		 = "經驗值0"
QUEST_INFO_8 		 = "勢力:"
QUEST_INFO_9 		 = "聲望:"
QUEST_INFO_10		= "幫會建設度"
QUEST_INFO_11		 = "幫會資金"
QUEST_INFO_12		 = "鄉試"
QUEST_INFO_13			= "會試"
QUEST_INFO_14		 = "周六13點整"
QUEST_INFO_15	 = "殿試"
QUEST_INFO_16		 = "周日13點整"
QUEST_INFO_17			= "鏢車("
QUEST_INFO_18			= "%d 銅"
QUEST_INFO_19			= "%d 銀"
QUEST_INFO_20			= "%d 銀 %d 銅"
QUEST_INFO_21			= "%d 金"
QUEST_INFO_22			= "%d 金 %d 銀"
QUEST_INFO_23			= "%d 金 %d 銀 %d 銅"
QUEST_INFO_24	 = "%i小時%i分鐘%i秒"
QUEST_INFO_25	 = "%i分鐘%i秒"
QUEST_INFO_26	 = "%i秒"
QUEST_INFO_27	 = "還剩 "
QUEST_INFO_28		 = "怪物缺失"
QUEST_INFO_29	 = "敵對鏢局鏢車"
QUEST_INFO_30	 = "擁有寵物%i/%i"
QUEST_INFO_31	 = "擁有寵物"
QUEST_INFO_32		= "當前等級(%i)"
QUEST_INFO_33		= "的畫像。"
QUEST_INFO_34		= "的畫像"
QUEST_INFO_35		= "畫像"
QUEST_INFO_36		= "的變身邀請。"
QUEST_INFO_37		= "的變身邀請"
QUEST_INFO_38		= "變身邀請"
QUEST_INFO_39		= "的跳舞邀請。"
QUEST_INFO_40		= "的跳舞邀請"
QUEST_INFO_41		= "跳舞邀請"
QUEST_INFO_42		= "抓寵物 %s%i/%i"
QUEST_INFO_43		 = "使寵物出戰"
QUEST_INFO_44			= "第%s組第%s環任務"
QUEST_INFO_45			 = "去[%s][%i:%i]尋找寶藏。"
QUEST_INFO_46				= "%s的畫像"
QUEST_INFO_47				= "空白的畫像"
QUEST_INFO_48				= "我正在忙！等一下！"
CELL_ROLEQUESTINTERFACE_1 					= "%s神功蓋世，所向披靡，獲得%i-%i等級組武道大會比賽冠軍。"
CELL_ROLEQUESTINTERFACE_2 					= "帶血的"
CELL_ROLEQUESTINTERFACE_3 					= "恭喜您獲得\"福幣\"一個！"
CELL_Transporter_1 = "您要去哪裡？"
CELL_WXMONSTER_1 = "要打就一起來吧，反正多一個不多，少一個不少！"
CELL_WXMONSTER_2 = "以%s為首的金烏勇士們"
CELL_QUEST_1 = "，獲得獎勵["
CELL_QUEST_2 = "恭喜您，您完成任務[%s]"
CELL_QUEST_TASK_LQ_EQUIP = "高級裝備"


#------------------------------------------------------------------------------------------------------------------------
#變身大賽
#------------------------------------------------------------------------------------------------------------------------
BIAN_SHEN_VOICE_1					= "@S{4}變身大賽將在每天的14:30和20:30舉行，請屆時參加。"
BIAN_SHEN_VOICE_2					= "@S{4}請耐心等待比賽開始!"
BIAN_SHEN_VOICE_3					= "@S{4}您的背包需要留出%s個空位來裝變身牌，整理好之後再來報名吧。"
BIAN_SHEN_VOICE_4					= "@S{4}您已經成功報名了，準備進行比賽吧！"
BIAN_SHEN_VOICE_5					= "@S{4}比賽正在進行,請在我不忙的時候再來領取!"
BIAN_SHEN_VOICE_6					= "@S{4}您沒有獎勵可以領取。"
BIAN_SHEN_VOICE_7						= "@S{4}您的背包滿了，請清理了之後再來領取獎勵吧！"
BIAN_SHEN_VOICE_8					= "@S{4}這是給你的獎勵，歡迎下次繼續參與。"
BIAN_SHEN_VOICE_9				 = "我要的是蘑菇! 你知道欺騙我會給你帶來什麼後果嗎?"
BCNPC_1 					= "比賽即將開始,請各就各位!"
BCNPC_2 					= "變身大賽結束了，本次沒有玩家過關，真可惜。"
BCNPC_3 					= "變身大賽結束了，本次活動共有%s個玩家過關，記得在下次比賽開始前來我這裡領取獎勵哦!"
BCNPC_4 					= "我要變成%s！"
BCNPC_5 					= "啊哈哈，被騙了吧，啊哈哈！"
BCNPC_6 					= "你被淘汰了。本次比賽你闖到了第%d輪，下次再努力！"
BCNPC_7 					= "淘汰出局"
BCNPC_8 					= "本輪有%s位玩家過關，%s個玩家被淘汰"


#------------------------------------------------------------------------------------------------------------------------
#採集珍珠
#------------------------------------------------------------------------------------------------------------------------
CAI_JI_ZHEN_ZHU_VOICE_0					 = "@S{4}龍王每天只接受%s次五色珍珠。請明天再來！"
CAI_JI_ZHEN_ZHU_VOICE_2					 = "@S{4}本次祈禱需要一套五色珍珠作為祭品，你身上的物品不足！"
CAI_JI_ZHEN_ZHU_VOICE_3					 = "@S{4}您集齊五色珍珠，受到龍王眷顧！"
CAI_JI_ZHEN_ZHU_VOICE_4					 = "@S{4}龍王每天只接受%s次彩虹寶珠。請明天再來！"
CAI_JI_ZHEN_ZHU_VOICE_6					 = "@S{4}要龍王顯靈需要一套彩虹寶珠作為祭品，你並不擁有足夠的祭品！"
CAI_JI_ZHEN_ZHU_VOICE_7					 = "@S{4}您收集齊了彩虹寶珠，龍王顯靈！"
CAI_JI_ZHEN_ZHU_VOICE_8					 = "@S{4}你要龍王幫你見證情緣要帶你的有緣人一起來這裡，否則龍王怎麼幫你們見證？"
CAI_JI_ZHEN_ZHU_VOICE_9					 = "@S{4}情緣成雙配對,只能帶一位有緣人來祈禱龍王見證!"
CAI_JI_ZHEN_ZHU_VOICE_10					= "@S{4}龍王每天只為您鑒定%s次情緣。請明天再來！"
CAI_JI_ZHEN_ZHU_VOICE_11					= "@S{4}每天只能祈禱%s次。%s今天已經不能再祈禱了。"
CAI_JI_ZHEN_ZHU_VOICE_12					= "@S{4}你們身上並沒有集齊情緣信物，看來並非有緣人！"
CAI_JI_ZHEN_ZHU_VOICE_14					= "@S{4}%s的背包滿了，請讓他清理了之後再來領取獎勵吧！"
CAI_JI_ZHEN_ZHU_VOICE_15					= "@S{4}祝福你們友誼長存！"
CAI_JI_ZHEN_ZHU_VOICE_16					= "每天只能吸收%s次珍珠精華，吸收太多小心受不了！"
CAI_JI_ZHEN_ZHU_VOICE_17					= "@S{4}想要吸取珍珠精華，需要凝結天地精華的彩色珍珠！"
CAI_JI_ZHEN_ZHU_VOICE_18					= "@S{4}你獲得了珍珠的精華！"

#------------------------------------------------------------------------------------------------------------------------
#幫會擂臺
#------------------------------------------------------------------------------------------------------------------------
TONG_ABA_VOICE_1						 = "@S{4}您還處於新手保護期，不能參加戰鬥。"
TONG_ABA_VOICE_2					 	 = "@S{4}只有幫主才能申請幫會擂臺。"
TONG_ABA_VOICE_3					 	 = "@S{4}幫會擂臺還沒開始，請耐心等待!"
TONG_ABA_VOICE_4					 	 = "@S{4}幫會擂臺只允許%i級以上精英成員進入，先努力升級吧！"

#------------------------------------------------------------------------------------------------------------------------
#釣魚
#------------------------------------------------------------------------------------------------------------------------
FISHING_VOICE_1							= "@S{4}您正在忙碌，請稍後再來領取釣魚時間。"
FISHING_VOICE_2							= "@S{4}您的釣魚時間增加了%s分鐘。"
FISHING_VOICE_3							= "@S{4}你身上沒有漁場垂釣卡，請重新檢查您的背包。"


#------------------------------------------------------------------------------------------------------------------------
#夸父神殿
#------------------------------------------------------------------------------------------------------------------------
KUAFU_REMAINS_DOOR					= "離開夸父神殿"


#------------------------------------------------------------------------------------------------------------------------
#保護幫派
#------------------------------------------------------------------------------------------------------------------------
BAO_HU_BANG_PAI_INFO_1		  	= "保護幫派副本"

#------------------------------------------------------------------------------------------------------------------------
#攝魂迷陣
#------------------------------------------------------------------------------------------------------------------------
SHE_HUN_MI_ZHEN_INFO_1		 	= "攝魂迷陣傳送點"
ACTIVITY_SHE_HUN_MI_ZHEN		 	= "攝魂迷陣"



#------------------------------------------------------------------------------------------------------------------------
#環任務
#------------------------------------------------------------------------------------------------------------------------
LOOP_QUEST_VOICE_1							= "@S{4}您已經成功保存過環任務了，無需重復保存！"
LOOP_QUEST_VOICE_2							= "@S{4}隨機任務記錄儲存成功！"
LOOP_QUEST_VOICE_3							= "重新接取需要花費%s，你確認要重新接取麼?"
LOOP_QUEST_INFO_1							= "金"
LOOP_QUEST_INFO_2							 					= "銀"
LOOP_QUEST_INFO_3						 					= "銅"



#------------------------------------------------------------------------------------------------------------------------
#跳舞
#------------------------------------------------------------------------------------------------------------------------
DANCE_VOICE_1					 		= "您的跳舞積分是：%d"


#------------------------------------------------------------------------------------------------------------------------
#在線獎勵
#------------------------------------------------------------------------------------------------------------------------
ON_LINE_GIFT_VOICE_0					= "@S{4}由於在線獎勵中還包括有物品，請清理出至少%i個空位，再來領取獎勵。"
ON_LINE_GIFT_VOICE_1					= "@S{4}感謝您的支持，記得在線時間累計5個小時後，還可以再來領取！"
ON_LINE_GIFT_VOICE_2					= "@S{4}你當前的累計在線時間尚未達到5個小時，無法領取獎勵。"
ON_LINE_GIFT_VOICE_3					= "@B你已經可以領取獎勵了！"
ON_LINE_GIFT_VOICE_4					= "@B你還需要再累計在線%i小時%i分%i秒，才可以領取獎勵。"
ON_LINE_GIFT_INFO_1									= "%d金"
ON_LINE_GIFT_INFO_2						 			= "%d銀"
ON_LINE_GIFT_INFO_3									= "%d銅"
ON_LINE_GIFT_INFO_4										= "一"
BASE_GOSSIP_ROLE_0						="@B@S{4}本周在線時間：%i時%i分%i秒"


#------------------------------------------------------------------------------------------------------------------------
#師徒獎勵
#------------------------------------------------------------------------------------------------------------------------
SHI_TU_GIFT_VOICE_0					= "‘創’字符道具"
SHI_TU_GIFT_VOICE_1					= "‘世’字符道具"
SHI_TU_GIFT_VOICE_2					= "‘師’字符道具"
SHI_TU_GIFT_VOICE_3					= "‘徒’字符道具"
SHI_TU_GIFT_VOICE_4					= "無效物品"
SHI_TU_GIFT_VOICE_5					= "@S{4}你的能力暫時獲得了提高。"
SHI_TU_GIFT_VOICE_7					= "@S{4}條件不滿足，領取獎勵需要物品:%s"
SHI_TU_GIFT_VOICE_8					= "@S{4}你湊齊了全部的物品，這是給你的獎勵。"
SHI_TU_GIFT_VOICE_9					= "@S{4}您還缺少“%s”，無法進行抽獎"
SHI_TU_GIFT_VOICE_11				  	= "@S{4}你必須要確保你的隊伍中，有且只有你們師徒二人才可以領取獎勵。"
SHI_TU_GIFT_VOICE_12				  = "@S{4}請由你的師傅來申請領取獎勵。"
SHI_TU_GIFT_VOICE_13				  = "@S{4}你的徒弟要跟你一起來才可以領取。"
SHI_TU_GIFT_VOICE_14				  = "@S{4}你徒弟的級別不夠啊，等他到了%s級以後再來吧。"
SHI_TU_GIFT_VOICE_15				  = "@S{4}你們已經領取過獎勵了啊，不能再領取了。"
SHI_TU_GIFT_VOICE_16				  = "@S{4}你的包裹空間不夠，請整理出空位再來領取獎勵。"
SHI_TU_GIFT_VOICE_17				  = "@S{4}你徒弟的包裹空間不夠，請讓他整理出空位再來領取獎勵。"
SHI_TU_GIFT_VOICE_18				  = "@S{4}你的徒弟達到了%s級， 這是給你們的獎勵。"
SHI_TU_GIFT_VOICE_19					= "@S{4}您不具有師徒關係，無法領取獎勵。"
SHI_TU_GIFT_INFO_1				= "%s金"
SHI_TU_GIFT_INFO_2					= "%s銀"
SHI_TU_GIFT_INFO_3					= "%s銅"


#------------------------------------------------------------------------------------------------------------------------
#採集技能
#------------------------------------------------------------------------------------------------------------------------
CAIJI_SKILL_VOICE_1							= "您還沒學得任何採集技能。"
CAIJI_SKILL_VOICE_2				= "您所習得的採集技能已經全滿級。"
CAIJI_SKILL_VOICE_3					= "@S{4}您身上擁有跑商物品，不允許進入金色海灘。"

#------------------------------------------------------------------------------------------------------------------------
#封測獎勵
#------------------------------------------------------------------------------------------------------------------------
FENG_CE_JIANG_LI_VOICE_1						= "等級不夠，還不能領取獎勵！"
FENG_CE_JIANG_LI_VOICE_2							= "您已經領取過了，不能再領取！"
FENG_CE_JIANG_LI_VOICE_3						= "您的背包空間不夠裝禮物，請清理出足夠的空位再來領取獎勵。"
FENG_CE_JIANG_LI_VOICE_4				= "您這周已經領取過獎勵了，下周再來吧。"
FENG_CE_JIANG_LI_VOICE_5				= "您沒有填寫推廣員，無法領取此獎品"
FENG_CE_JIANG_LI_VOICE_6				= "@B@S{4}您的帳號已經領取了%i級獎勵。"
FENG_CE_JIANG_LI_VOICE_7				= "@B@S{4}您的帳號還未領取%i級獎勵,請達到%i級之後來領取!"



#------------------------------------------------------------------------------------------------------------------------
#技能
#------------------------------------------------------------------------------------------------------------------------
SKILL_INFO_1					= "恭喜你發現寶藏中的物品"
SKILL_INFO_2						= "物理攻擊力提高"
SKILL_INFO_3						= "點，法術攻擊力提高"
SKILL_INFO_4						= "點。"
SKILL_INFO_5				= "%s的(%s,%s),(%s,%s),(%s,%s)"
SKILL_INFO_6			= "%s的變身邀請"
SKILL_INFO_7				= "%s的跳舞邀請"
SKILL_INFO_8			= "保鏢"
SKILL_INFO_9				= "普通地圖"
SKILL_INFO_11				= "城市爭奪戰場"
SKILL_INFO_12				= "幫會擂臺賽戰場"



#------------------------------------------------------------------------------------------------------------------------
#性別
#------------------------------------------------------------------------------------------------------------------------
SEX_MAN									 = "男性"
SEX_WOMAN								 = "女性"


#------------------------------------------------------------------------------------------------------------------------
#地圖
#------------------------------------------------------------------------------------------------------------------------
MAP_FENG_MING							= "鳳鳴"
MAP_BAN_QUAN							= "板泉"
MAP_BI_SHI_SHAN_GU						= "避世山谷"
MAP_FENGMINGCHENG						= "鳳鳴城"
MAP_FEI_LAI_SHI							= "飛來石"
MAP_FEI_YUN_PO							= "飛雲坡"
MAP_QING_FENG_YUAN						= "青鳳原"
MAP_WU_MIAO_ZHAO_ZE						= "巫苗沼澤"
MAP_YIN_SHA_CHUN						= "銀沙村"
MAP_GWM_001								= "帝王古墓第一層"
MAP_GWM_002								= "帝王古墓第二層"
MAP_GWM_003								= "帝王古墓第三層"
MAP_GWM_004								= "帝王古墓第四層"
MAP_GWM_005								= "帝王古墓第五層"
MAP_GWM_006								= "帝王古墓第六層"
MAP_ZHENG_ZHAN_GU						= "爭戰谷"
MAP_ZHU_TIAN_SHENG_DI					= "諸天勝地"
MAP_RI_GUANG_YU							= "日光浴"
MAP_TIAN_GUAN							= "天關"
MAP_QI_HUAN_SHEN_SHOU					= "奇獸幻境"
MAP_SHI_HU_SHAN							= "獅虎山"
MAP_YAO_YI_KONG_JIAN					= "妖異空間"
MAP_XUAN_TIAN_HUAN_JIE					= "玄天幻界"
MAP_JING_JI_CHANG						= "競技場"
MAP_GU_MI_GONG							= "古秘宮"
MAP_SHUI_JING_JIE_JIE					= "水晶結界"
MAP_PENG_LAI							= "蓬萊"
MAP_LONG_DONG_1_CENG					= "龍岐洞1層"
MAP_LONG_DONG_2_CENG					= "龍岐洞2層"
MAP_WU_TAI								= "舞臺"
MAP_LE_YUAN								= "嘟嘟樂園"
MAP_SHEN_CANG_YU						= "神藏峪"
MAP_XIE_LONG_DONG_XUE					= "邪龍洞穴"
MAP_SAI_MA_CHANG						= "賽馬場"
MAP_JIA_ZU_JING_JI_CHANG				= "家族競技場"
MAP_GE_REN_JING_JI_CHANG				= "個人競技場"
MAP_BANG_HUI_DUO_CHENG_A_FANG_JIAN		= "幫會奪城 A房間"
MAP_BANG_HUI_DUO_CHENG_B_FANG_JIAN		= "幫會奪城 B房間"
MAP_BANG_HUI_DUO_CHENG_C_FANG_JIAN		= "幫會奪城 C房間"
MAP_BANG_HUI_DUO_CHENG_D_FANG_JIAN		= "幫會奪城 D房間"
MAP_BANG_HUI_DUO_CHENG_E_FANG_JIAN		= "幫會奪城 E房間"
MAP_JIA_ZU_ZHAN_CHANG					= "家族戰場"
MAP_JIAN_YU								= "監獄"
MAP_JIU_HE_DU							= "九河渡"
MAP_LIU_XIAN_TAI						= "留仙臺"
MAP_BI_SHI_JIAN							= "避世澗"
MAP_QING_NIAO_YI						= "青鳥邑"
MAP_WU_MIAO_ZHAI						= "巫苗寨"
MAP_YAN_HUANG_GUO						= "炎黃國"
MAP_ZHU_LU_YUAN							= "逐鹿原"
MAP_GU_MI_GONG							= "古迷宮"
MAP_KUN_LUN								= "崑崙"
MAP_HUANG_QUAN							= "黃泉"
MAP_FENG_JIAN_SHEN_GONG				= "封劍神宮"
MAP_SHE_HUN_MI_ZHEN					= "攝魂迷陣"
MAP_SHI_TU_FU_BEN						= "鳳鳴後山"
MAP_KUAFU_REMAINS						= "夸父神殿"

#------------------------------------------------------------------------------------------------------------------------
#寵物
#------------------------------------------------------------------------------------------------------------------------
PET_CHENG_NIAN							= "成年"
PET_BAO_BAO								= "寶寶"
PET_ER_DAI_BAO_BAO						= "二代寶寶"
VOICE_COMMON_CONST_1					= "喊出我們的口號"



#------------------------------------------------------------------------------------------------------------------------
#物品屬性
#------------------------------------------------------------------------------------------------------------------------
ITEMATTRCLASS_INFO_1	= "神物溢光華"
ITEMATTRCLASS_INFO_2	= "、%s"
ITEMATTRCLASS_INFO_3	= "需求性別：男"
ITEMATTRCLASS_INFO_4	= "需求性別：女"
ITEMATTRCLASS_INFO_5	= "需要"
ITEMATTRCLASS_INFO_6	= "聲望："
ITEMATTRCLASS_INFO_7		= "價格%i"
ITEMATTRCLASS_INFO_8		= "裝備已到使用時限。"
ITEMATTRCLASS_INFO_9		= "裝備後開始計時，使用時限："
ITEMATTRCLASS_INFO_10		= "%s天"
ITEMATTRCLASS_INFO_11		= "%s時"
ITEMATTRCLASS_INFO_12		= "%s分"
ITEMATTRCLASS_INFO_13		= "%s秒"
ITEMATTRCLASS_INFO_14		= "剩餘次數：%s"
ITEMATTRCLASS_INFO_15		= "由玩家 %s 打造"
ITEMATTRCLASS_INFO_16		= "數量%i"
ITEMATTRCLASS_INFO_17		= "等級%i"
ITEMATTRCLASS_INFO_18		= "最大可容納空間%i"
ITEMATTRCLASS_INFO_19		= "耐久度 %i/%i"
ITEMATTRCLASS_INFO_20		= "耐久度"
ITEMATTRCLASS_INFO_21		= "需要等級 %i"
ITEMATTRCLASS_INFO_22		= "需要騎寵等級 %i"
ITEMATTRCLASS_INFO_23		= "需要等級"
ITEMATTRCLASS_INFO_24		= "前綴"
ITEMATTRCLASS_INFO_25	= "品質"
ITEMATTRCLASS_INFO_26		= "攻擊距離 %2.1f"
ITEMATTRCLASS_INFO_27		= "攻擊距離"
ITEMATTRCLASS_INFO_28		= "攻擊速度 %2.1f"
ITEMATTRCLASS_INFO_29		= "攻擊速度"
ITEMATTRCLASS_INFO_30		= "魂魄: %i/%i"
ITEMATTRCLASS_INFO_31		= "魂魄: 已滿"
ITEMATTRCLASS_INFO_32	= "魂魄:"
ITEMATTRCLASS_INFO_33		= "已滿"
ITEMATTRCLASS_INFO_34		= "已認主"
ITEMATTRCLASS_INFO_35		= "未認主"
ITEMATTRCLASS_INFO_36		= "(%s孔)"
ITEMATTRCLASS_INFO_37		= "鑲嵌位置：%s"
ITEMATTRCLASS_INFO_38		= "金天幣:%s"
ITEMATTRCLASS_INFO_39		= "銀天幣:%s"
ITEMATTRCLASS_INFO_40		= "戰場積分: %i"
ITEMATTRCLASS_INFO_41		= "剩餘點數：%s/%s"
ITEMATTRCLASS_INFO_42	= "%d小時"
ITEMATTRCLASS_INFO_43	= "%d分鐘"
ITEMATTRCLASS_INFO_44		= "銀票總值:%i"
ITEMATTRCLASS_INFO_45		= "你看不到"
ITEMATTRCLASS_INFO_46		= "由 %s 巧手升品"
ITEMATTRCLASS_INFO_47		= "、"

ITEM_TALISMAN_COMMON_DES			= "凡品"
ITEM_TALISMAN_IMMORTAL_DES			= "神品"
ITEM_TALISMAN_DEITY_DES				= "仙品"
ITEM_RESISTCHENMO_PER_DES			= "抵抗沉默+%i%s%s"
ITEM_RESISTCHENMO_VALUE_DES			= "抵抗沉默"
ITEM_RESISTGIDDY_PER_DES			= "抵抗眩暈+%i%s%s"
ITEM_RESISTGIDDY_VALUE_DES			= "抵抗眩暈"
ITEM_RESISTFIX_PER_DES				= "抵抗定身+%i%s%s"
ITEM_RESISTFIX_VALUE_DES			= "抵抗定身"
ITEM_REDUCETARGETHIT_PER_DES		= "降低對方物理命中點數+%i%s%s"
ITEM_REDUCETARGETHIT_VALUE_DES		= "降低對方物理命中點數"
ITEM_RESISTSLEEP_PER_DES			= "抵抗睡眠+%i%s%s"
ITEM_RESISTSLEEP_VALUE_DES			= "抵抗睡眠"
ITEM_RESISTHIT_PER_DES				= "招架+%i%s%s"
ITEM_RESISTHIT_VALUE_DES			= "招架"
ITEM_DODGE_PER_DES					= "閃避+%i%s%s"
ITEM_DODGE_VALUE_DES				= "閃避"
ITEM_REDUCETARGETMAGICHIT_PER_DES	= "降低對方法術命中點數+%i%s%s"
ITEM_REDUCETARGETMAGICHIT_VALUE_DES	= "降低對方法術命中點數"
ITEM_HEAD_DES			= "頭盔"
ITEM_NECK_DES			= "項鏈"
ITEM_BODY_DES			= "身甲"
ITEM_BREECH_DES			= "褲子"
ITEM_VOLA_DES			= "手套"
ITEM_LEFTHAND_DES		= "副手"
ITEM_RIGHTHAND_DES		= "主手"
ITEM_FEET_DES			= "鞋子"
ITEM_HAUNCH_DES			= "腰帶"
ITEM_CUFF_DES			= "手腕"
ITEM_LEFTRING_DES		= "戒指1"
ITEM_RIGHTRING_DES		= "戒指2"
ITEM_TWOHAND_DES		= "雙手"
ITEM_HANDS_DES			= "主手或副手"
ITEM_FINGERS_DES		= "雙戒指"
ITEM_RING_DES			= "戒指"
ITEM_RIGHTORTWO_DES		= "主手或雙手"
ITEM_TALISMAN_DES		= "法寶"
ITEM_CIMELIA_DES		= "魂魄石"
ITEM_FASHION_DES		= "時裝"
ITEM_POTENTIAL_BOOK	= "潛能天書"
ITEM_ACMENT_DES			= "飾品"
ITEM_AXE_DES			= "單手斧"
ITEM_SWORD_DES			= "單手劍"
ITEM_HAMMER_DES			= "單手錘"
ITEM_SPEAR_DES			= "單手矛"
ITEM_DAGGER_DES			= "匕首"
ITEM_TWOAXE_DES			= "雙手斧"
ITEM_TWOSWORD_DES		= "雙手劍"
ITEM_TWOHAMMER_DES		= "雙手錘"
ITEM_TWOSPEAR_DES		= "雙手矛"
ITEM_DOUBLESWORD_DES	= "雙持劍"
ITEM_TWOBOW_DES			= "長弓"
ITEM_BOW_DES			= "短弓"
ITEM_STAFF_DES			= "法杖"
ITEM_SHIELD_DES			= "盾牌"
ITEM_TRUMP_DES			= "法器"
ITEM_ARMOR_HEAD_DES		= "頭部防具"
ITEM_ARMOR_BODY_DES		= "胸部防具"
ITEM_ARMOR_HAUNCH_DES	= "腰部防具"
ITEM_ARMOR_CUFF_DES		= "腕部防具"
ITEM_ARMOR_HAND_DES		= "手部防具"
ITEM_ARMOR_BREECH_DES	= "腿部防具"
ITEM_ARMOR_FEET_DES		= "足部防具"
ITEM_MEDICINE_DES		= "藥水"
ITEM_FOOD_DES			= "食物"
ITEM_DRUG_DES			= "丹藥"
ITEM_CHARM_DES			= "符咒"
ITEM_COUP_DES			= "錦囊"
ITEM_SUNDRIES_DES		= "雜物"
ITEM_VOUCHER_DES		= "憑證道具"
ITEM_QUEST_DES			= "任務道具"
ITEM_SYSTEM_DES			= "系統功能道具"
ITEM_CASKET_DES			= "神機匣"
ITEM_STUFF_DES			= "材料"
ITEM_QUESTSTUFF_DES		= "任務材料"
ITEM_JEWELRY_DES		= "寶石"
ITEM_VEHICLE_DES		= "騎寵"
ITEM_VEHICLESADDLE_DES		= "騎寵馬鞍"
ITEM_VEHICLEHALTER_DES		= "騎寵籠頭"
ITEM_VEHICLENECK_DES		= "騎寵項鏈"
ITEM_VEHICLECLAW_DES		= "騎寵爪環"
ITEM_VEHICLEMANTLE_DES		= "騎寵披風"
ITEM_VEHICLEBREASTPLATE_DES	= "騎寵護甲"
ITEM_SUPERDRUG_DES			= "傷藥"
ITEM_SCROLL_DES				= "製作卷"
ITEM_PETBOOK_DES			= "寵物技能書"
ITEM_YAODING_DES			= "靈藥鼎"
ITEM_GODSTONE_DES			= "天罡石"
ITEM_YUANBAO_DES			= "天幣票"
ITEM_STILETTO_DES			= "孔針"
ITEM_VEHICLEBOOK_DES		= "騎寵技能書"
ITEM_AXE1_DES				= "斧"
ITEM_SWORD1_DES				= "劍"
ITEM_HAMMER1_DES			= "錘"
ITEM_SPEAR1_DES				= "矛"
ITEM_BOW1_DES				= "弓"
ITEM_HAVEBIND_DES					= "已綁定"
ITEM_PICKBIND_DES					= "拾取綁定"
ITEM_WIELDBIND_DES					= "裝備綁定"
ITEM_QUESTBIND_DES					= "任務綁定"
ITEM_ARMOR_PER_DES					= "物理防禦 %i%s%s"
ITEM_ARMOR_VALUE_DES				= "物理防禦"
ITEM_MAGICARMOR_PER_DES				= "法術防禦 %i%s%s"
ITEM_MAGICARMOR_PER_DES				= "法術防禦"

#------------------------------------------------------------------------------------------------------------------------
#寵物計算公式
#------------------------------------------------------------------------------------------------------------------------
PETFORMULAS_INFO_2			= "%s寶寶"
PETFORMULAS_INFO_3			= "二代%s寶寶"


#------------------------------------------------------------------------------------------------------------------------
# Share text
#------------------------------------------------------------------------------------------------------------------------
SHARE_SYSTEM				= "系統"







#------------------------------------------------------------------------------------------------------------------------
#寶盒
#------------------------------------------------------------------------------------------------------------------------
CELL_SPELL_322398002_1 = "我是寶藏的守衛者,想拿走寶藏,沒門！"
CELL_SPELL_322398002_2 = "上古老妖精"
CELL_SPELL_322398002_3 = "老子在地下憋了幾千年了,終於可以透透氣了,弟兄們,快跑啊!"
CELL_SPELL_322398002_4 = "%s偷偷挖掘上古寶藏,結果觸動了鎮壓上古老妖精的機關,3個上古老妖精向%s逃去,企圖再次危害人間,大家快去消滅它們!"

#------------------------------------------------------------------------------------------------------------------------
#點卡寄售公告
#------------------------------------------------------------------------------------------------------------------------
BCT_POINTCARD_SELLED_NOTICE_01					= "有人在點卡寄售員處以%i金%i銀%i銅的價格寄售了一張%i天幣的點卡!"

#------------------------------------------------------------------------------------------------------------------------
#NPC寄售
#------------------------------------------------------------------------------------------------------------------------
TISHOU_INFO_01									= "%s的店鋪"


#------------------------------------------------------------------------------------------------------------------------
#怪物攻城
#------------------------------------------------------------------------------------------------------------------------
MONSTER_ATTACK_NOTICE_01						= "金烏王：混沌七魔將%s率領混沌軍團即將進攻%s，為了保衛我們的家園，請各族勇士立即前往%s支援。"
MONSTER_ATTACK_NOTICE_02						= "金烏王：混沌七魔將是北斗七星墮落幻化而成，他們都擁有無比的傲氣，只有對魔將造成傷害最大的勇士才能夠獲得他們死亡後的寶藏。"
MONSTER_ATTACK_CONTENT_ONE_NOTICE_01			= "%s：面對混沌的恐懼吧，你們將會被毀滅！"
MONSTER_ATTACK_CONTENT_ONE_NOTICE_02			= "%s被擊殺，他的寶藏散落在%s內，大家趕快尋找吧。"
MONSTER_ATTACK_CONTENT_TWO_NOTICE_01			= "%s：任何挑戰都是無力的，接下我無盡的怒火吧。"
MONSTER_ATTACK_CONTENT_TWO_NOTICE_02			= "%s被擊殺，他的寶藏散落在%s內，大家趕快尋找吧。"
MONSTER_ATTACK_CONTENT_THREE_NOTICE_01			= "%s：你們很勇敢，但很遺憾今晚我將拿下這座城市！"
MONSTER_ATTACK_CONTENT_THREE_NOTICE_02			= "%s被擊殺，他的寶藏散落在%s內，大家趕快尋找吧。"
MONSTER_ATTACK_CONTENT_FOUR_NOTICE_01			= "混沌七魔將%s：很開心你們能夠殘存到現在，不過接下來你們將跟你們的城市一起毀滅在我手中！"
MONSTER_ATTACK_CONTENT_FOUR_NOTICE_02			= "%s被擊殺，他神秘的寶藏散落在%s內，大家趕快尋找吧。"
MONSTER_ATTACK_CONTENT_END_NOTICE_01			= "金烏王：感謝奮戰在%s的勇士們，他們用鮮血捍衛了我們的家園成功的擊退了混沌七魔將%s對%s的入侵，讓我們為他們歡呼。"
MONSTER_ATTACK_CONTENT_END_NOTICE_02			= "金烏王：在這一次混沌殘暴的進攻下，很遺憾的沒有抵擋住混沌七魔將%s的入侵，但是我相信它給我們留下的不僅僅斷墻殘壁的家園，更多得是我們再一次面對它的勇氣和信心。下次，當它再次進攻的時候必定將面對我們無盡的怒火和反抗。"
MONSTER_ATTACK_FENGMING_NOTICE_01				= "金烏王：混沌眾魔將率領混沌軍團即將進攻鳳鳴皇城，為了保衛我們的家園，請各族勇士立即前往鳳鳴城支援。"
MONSTER_ATTACK_BOSS_DIE_SAY_01					= "%s！你超越其他人的攻擊證明了你的勇氣，拿去吧，我的寶藏只屬於你。"

MONSTER_ATTACK_BOX_MI_WANG						= "迷茫之箱"
MONSTER_ATTACK_BOX_KONG_JU						= "恐懼之箱"
MONSTER_ATTACK_BOX_HEI_AN						= "黑暗之箱"

# ---------------------------------------------------------------------------------------------------------------
# 七夕活動
# ---------------------------------------------------------------------------------------------------------------
TANABATA_QUIZ_MAIL_TITLE						= "七夕情感問答獎勵"
TANABATA_TREE_PLANTING_MAIL_TITLE				= "魅力果實獎勵"

TANABATA_START_NOTICE							= "七夕傳情，天上人間幫你！七夕情人節將至，為了幫助牛郎和織女相見，為了讓有情人終成眷屬，趕快到七夕留言板前寫下你的愛情宣言感動比翼鳥吧！"
TANABATA_FCWR_NOTICE							= "非誠勿擾活動火熱進行中！8月12日20:00至8月19日20:00，參與七夕公告板留言及投票，更多搞笑驚喜等著你。"
TANABATA_MLZZ_NOTICE							= "浪漫的七夕之旅拉開帷幕，快去鳳鳴城的鵲橋仙子楚纖雲處領取魅力種子，種下自己的夢想，收獲自己的希望！"
TANABATA_YHXC_NOTICE							= "大量從銀河墜入凡間的星辰出現在銀沙村，請到楚纖雲處領取乞巧鋤，與異性玩家一起開啟星辰的寶藏。"


#----------------------------------------------------------------------------------------------------------------------------
#非誠勿擾
#----------------------------------------------------------------------------------------------------------------------------
FCWR_ACTIVITY_NO_RESULT							= "當前還沒有活動結果。"

FCWR_ACTIVITY_RESULT_WAN_ZHONG_ZHU_MU			= "%s接收的告白'%s'，收到最高投票(%i票)，毋庸置疑成為萬眾矚目的焦點，獲得“萬眾矚目”稱號。"
FCWR_ACTIVITY_RESULT_FU_QI_XIANG				= "%s接收的告白'%s'，他與告白者成為公認最相配的一對(%i票)，二人雙雙獲得“天生一對”稱號。"
FCWR_ACTIVITY_RESULT_DA_ZHONG_QING_SHENG		= "%s接收的告白'%s'，遭遇最多情敵(%i票)，看來是男女老幼心中共同的偶像，獲得“大眾情人”稱號。"
FCWR_ACTIVITY_RESULT_MENG_ZHONG_QING_REN		= "%s發表的告白'%s'，導致大片玩家失戀(%i票)，如此魅力令無數人魂牽夢縈，獲得“夢中情人”稱號。"
FCWR_ACTIVITY_RESULT_VOTE_1						= "%s投票數目最高(%i票)，熱情參與的好人，獲得“熱血好青年”稱號，並獲得500天幣。"
FCWR_ACTIVITY_RESULT_VOTE_2                     = "%s投票數目第二(%i票)，熱情參與的好人，獲得“熱血好青年”稱號，並獲得250天幣。"
FCWR_ACTIVITY_RESULT_VOTE_3						= "%s投票數目第三(%i票)，熱情參與的好人，獲得“熱血好青年”稱號，並獲得100天幣。"


FCWR_MAIL_TITLE									= "愛情告白"
FCWR_MAIL_SENDER_ANONYMITY						= "匿名"
FCWR_MAIL_REWARD_TITLE							= "非誠勿擾獎勵"


#------------------------------------------------------------------------------------------------------------------------
# 好友聊天
#------------------------------------------------------------------------------------------------------------------------
CHAT_FRIEND_IN_BLACKLIST							= "消息發送失敗，對方已將您加入黑名單。"
CHAT_FRIEND_RECEIVER_OFFLINE						= "對方目前不在線，已發送為離線消息，對方下次上線時即可收取。"
CHAT_FRIEND_OFFLINE_MSG_OVERFLOW					= "消息發送失敗，對方目前不在線且離線消息已滿。"
CHAT_FRIEND_RECEIVER_NOT_EXIST						= "此玩家不存在。"
CHAT_FRIEND_RECEIVER_NOT_FRIEND						= "此玩家並不是您的好友，無法進行好友聊天。"

#------------------------------------------------------------------------------------------------------------------------
# 魅力果樹
#------------------------------------------------------------------------------------------------------------------------
FRUIT_TREE_NAME										= "魅力果樹"


#------------------------------------------------------------------------------------------------------------------------
# 夸父神殿
#------------------------------------------------------------------------------------------------------------------------

KUA_FU_SHEN_DIAN_HOU_QING							= "後卿"
KUA_FU_SHEN_DIAN_JU_BI								= "拒比"
KUA_FU_SHEN_DIAN_FEI_LIAN							= "飛廉"
KUA_FU_SHEN_DIAN_ONE_STONE_DESTROY					= "居然有人能夠闖到法陣面前，兄弟們我們的時間不多了，得加快速度。"
KUA_FU_SHEN_DIAN_THREE_STONE_DESTROY				= "能量開始不穩定了，我們隨時會被反噬的。"
KUA_FU_SHEN_DIAN_FIVE_STONE_DESTROY					= "能量波動越來越大，我怕我抗不住了。"
KUA_FU_SHEN_DIAN_SIX_STONE_DESTROY					= "我不行了，啊！！。"
KUA_FU_SHEN_DIAN_SEVEN_STONE_DESTROY				= "我也快不行了。"
KUA_FU_SHEN_DIAN_KUA_FU_MAKE						= "哈哈，夸父的肉身終於得到了，混沌注定要統治整個世界。"
KUA_FU_SHEN_DIAN_TIME_OVER							= "夸父神殿的活動時間已經到了，20秒後，所有玩家將被傳出副本。"

#------------------------------------------------------------------------------------------------------------------------
# 中秋活動
#------------------------------------------------------------------------------------------------------------------------
MID_AUTUMIN_NOTICE									= "國慶盛宴，明月祝福。中秋國慶兩大節日精彩活動9月22日繽紛開啟，精彩好禮等你拿！"
MID_AUTUMIN_RABBIT_RUN_NOTICE						= "聽說月宮的小兔混入人間來過節，請速速飛抵鳳鳴城參加小兔快跑，看誰才是小兔中的戰鬥兔！"
MID_AUTUMIN_TONG_QUEST_NOTICE						= "眾人拾柴火焰高，十指抱拳禮千斤。中秋國慶節日期間完成幫會領地NPC月夕的任務，將會獲得驚喜幫會收益，幫助你的幫會迅速升級！"
MID_AUTUMIN_WORD_FIND_NOTICE						= "海上生明月，天涯共此時。請將月餅仙人精心製作的各色月餅送往四海宇內，讓天上人間共享中秋國慶歡樂時刻。"
MID_AUTUMIN_TONG_PROTECT_NOTICE						= "圓月之日幫會領地舉辦盛大節日派對，請在13:30和19:00進入幫會領地，參加節日派對，共享饕餮盛宴！"
MID_AUTUMIN_ZHOU_NIAN_GIFT_NOTICE					= "9月22日至10月7日，收集“天上人間一周年大禮包”中的不同字符，就可以在鳳鳴城月影處換取內測周年禮包。天上人間一周年，風雨同進步。"
MID_AUTUMIN_WORD_MAKE_NOTICE						= "好禮化字符，中秋潛入夜。鳳鳴城的月影正在虔誠地等待每一位幸運的字符收集者，她將用驚喜報答你的辛勞。"
MID_AUTUMIN_KILL_MOON_CAKE_NOTICE					= "國慶歡騰日，BOSS別錯過。9月22日-10月7日期間，與好友一起闖蕩失落的寶藏半路竟然殺出個大月餅！怎麼辦？告訴你個好方法，吃了它……"


MID_AUTUMIN_RABBIT_RUN								= "小兔快跑"
MID_AUTUMIN_TONG_QUEST								= "家和萬事興"
MID_AUTUMIN_WORD_FIND								= "千里共嬋娟"
MID_AUTUMIN_TONG_PROTECT							= "月餅大亂鬥"
MID_AUTUMIN_ZHOU_NIAN_GIFT							= "天上人間周年禮"
MID_AUTUMIN_WORD_MAKE								= "中秋禮包"
MID_AUTUMIN_KILL_MOON_CAKE							= "BOSS喜相逢"

MID_AUTUMIN_RABBIT_RUN_PLAYER_NOT_ENOUGH			= "參加遊戲的人數不足，10秒後副本將結束。"
MID_AUTUMIN_RABBIT_RUN_OVER_FOR_WIN					= "已經有30名玩家成功完成比賽，副本將在20秒後自動關閉。"
MID_AUTUMIN_RABBIT_RUN_OVER_FOR_TIME				= "比賽時間到達，副本將在20秒後自動關閉。"
MID_AUTUMIN_RABBIT_RUN_CELEBRATE                    = "%s 獲得本次小兔快跑第%i名，將獲得大量的經驗和金錢"
MID_ATUTMIN_COPY					= "月餅大亂鬥"


CHRISMAS_SPAWN											= "聖誕刷新"
CHRISMAS_RACE_HORSE									= "聖誕賽馬"
CHRISMAS_RACE_HORSE_NOTICE_01						= "聖誕賽馬大賽將在10分鐘後開始，各位勇士，請先暫忘緊張的戰鬥，盡情在競速中放鬆吧！參加活動的勇士，請到鳳鳴採薇（183:173）處報名。"
CHRISMAS_RACE_HORSE_NOTICE_02						= "聖誕賽馬大賽的參加者將有機會獲得各種聖誕專屬禮物，比賽將在1分鐘後開始，抓緊時間報名吧！參加活動的勇士，請到鳳鳴採薇（183:173）處報名。"
CHRISMAS_START_NOTICE								= "聖誕節就快來啦！我們已經準備了豐富的活動等待大家，大家快去找聖誕樹與神秘NPC參與活動吧，有空去賽賽馬，去城外逛逛，會有驚喜的哦！"
CHRISMAS_END_NOTICE									= "聖誕活動結束了，大家是不是收入頗豐呢？相信大家都度過了一個愉快的聖誕節吧？"

import Language
if Language.LANG == Language.LANG_BIG5:
	WU_DAO_DA_HUI_VOICE_5						= "現在不是武道大會活動的報名時間，活動將於每周六21:00-21:10接受報名，請屆時參加。"
	BIAN_SHEN_VOICE_1							= "@S{4}變身大賽將在每天11:30和17:30舉行，請屆時參加。"
	

	BCT_MADROP_ACTIVITY_START              				= "9月22日至9月28日，收集“天上人間中秋禮包”中的不同字元，就可以在鳳鳴城月影處換取中秋禮包。"
	BCT_MADROP_ACTIVITY_END           				    = "收集字元活動結束，怪物將不會掉落活動道具。"
	MID_AUTUMIN_WORD_MAKE_NOTICE						= "好禮化字元，中秋潛入夜。鳳鳴城的月影正在虔誠地等待每一位幸運的字元收集者，她將用驚喜報答你的辛勞。"
	MID_AUTUMIN_KILL_MOON_CAKE_NOTICE					= "月餅隨心到，BOSS喜相逢。9月22日-9月28日期間，與好友一起闖蕩副本半路竟然殺出個大月餅！怎麼辦？告訴你個好方法，吃了它……"



#------------------------------------------------------------------------------------------------------------------------
# 裝備屬性重鑄
#------------------------------------------------------------------------------------------------------------------------
EQUIP_ATTR_REBUILD_NEED							= "裝備屬性重鑄需要：${o0}"

